[
  {
    "source": "Starfinder #2: Temple of the Twelve pg. 53",
    "Name": "Weapon Spikes",
    "Level": "1",
    "Price": "—",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "A suit of armor covered in wicked spikes is an iconic piece of devourer cultist gear. You can add a one-handed basic melee weapon of light or negligible bulk to your armor to act as weapon spikes. You pay 125% of the cost of the selected basic melee weapon to add it as an upgrade. You must have a hand free to attack with the weapon spikes (so you can maneuver a foe into a position where the spikes are effective), unless the foe is grappling you or you are grappling the foe (in which case you can attack with the weapon spikes even if you do not have a free hand). You can also make attacks with weapon spikes when pinned, though only against the creature pinning you."
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Pet Carrier",
    "Level": "1",
    "Price": "100",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades"
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Remote Monitoring System",
    "Level": "1",
    "Price": "100",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "Your armor is equipped with a number of systems designed to monitor your health and activity, information that’s simultaneously broadcast to any comm unit set to receive this data. The upgrade includes an obvious camera and microphone mounted on the outside of your armor, and the upgrade transmits everything it sees and hears; it has access to any senses installed in the armor (for example, infrared sensors), but not any unusual senses you possess. The remote monitoring system upgrade tracks your vital signs, and an individual receiving the transmissions from this upgrade can see if you’ve taken Hit Point damage as well as any conditions currently affecting you."
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Easy Access Kit",
    "Level": "1",
    "Price": "125",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This set of mechanical supports and electric connectors allows you to install a single technological item with light or negligible bulk on your wrist or another easily accessible body part. Installing or swapping out a technological item attached to the upgrade requires 10 minutes, as though you were swapping out an armor upgrade. Whenever at least one of your hands is free, you can use the item as though it were in your hand. If the item normally requires two hands to use, you still need two free hands to use it."
  },
  {
    "source": "Starfinder #2: Temple of the Twelve pg. 53",
    "Name": "Grim Trophies (Magic)",
    "Level": "1",
    "Price": "125",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "Devourer cultists often adorn their armor with magically enhanced trophies representing their most meaningful kills, such as skulls or other bits of bone or exoskeleton taken from slain foes, defiled holy symbols, broken bits of weapons, or bloodied and tattered badges or seals of authority."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Light Projector",
    "Level": "1",
    "Price": "150",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "20",
    "Usage": "1/hour",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "This set of powerful lights includes a compact but long-lasting battery. While activated, a light projector increases the light level by one step in a 100-foot cone or a 50-foot radius. You can activate or deactivate the light projector or switch between the two light modes as a move action."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Tensile Reinforcement",
    "Level": "1",
    "Price": "150",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "When calculating your armor’s hardness and Hit Points (see page 409), treat it as if its item level were 5 higher."
  },
  {
    "source": "Starfinder #14: Soldiers of Brass pg. 17",
    "Name": "Thermal Regulator (Hybrid)",
    "Level": "1",
    "Price": "150",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "While activated, a thermal regulator reduces the severity of dangerous temperatures by two steps for its wearer. For example, severe cold becomes comfortable, while extreme cold is reduced to cold. A thermal regulator can be set to protect its wearer from cold or heat, but not both simultaneously. The regulator consumes the attached armor’s environmental protections, but at one-quarter the rate of having protections fully activated."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Sustenance System, Basic",
    "Level": "1",
    "Price": "150",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "A sustenance system provides a way for you to consume sustenance without removing your armor or shutting down environmental protections. The basic version of this system holds 1 Bulk of actual food and drink, whether field rations, R2Es, or other cuisine. Higher model numbers function as miniaturized culinary synthesizers of the same model number, allowing the armor to produce food and drink from UPBs on verbal or text command. These nonbasic systems can also store up to 1 Bulk of UPBs.\n"
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Concealed Compartments",
    "Level": "1",
    "Price": "175",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of many hidden compartments that are difficult to distinguish from the armor’s surface. Your armor grants you a +5 bonus to Sleight of Hand checks when hiding items on your body. You can store up to 1 bulk worth of items in your concealed compartments."
  },
  {
    "source": "Near Space pg. 152",
    "Name": "Aversion Coating",
    "Level": "1",
    "Price": "200",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This small module secretes a terrible-tasting chemical compound. The aversion coating grants you gain a +2 bonus to AC against bite attacks. If you are subject to the swallow whole universal creature rule, the swallowing creature must succeed at a Fortitude saving throw (DC \u003d 15 + the armor’s level) or become nauseated for 1d4 rounds. On a successful save, the creature is sickened for 1d6 rounds instead."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Infrared Sensors",
    "Level": "1",
    "Price": "200",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You gain darkvision with a range of 60 feet."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Radiation Buffer",
    "Level": "1",
    "Price": "200",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This device grants a +2 bonus to your initial saving throw against radiation (see page 403) in addition to any bonuses from your armor’s environmental protection. This doesn’t provide any bonus to saves against the secondary effects of radiation."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Leapers",
    "Level": "1",
    "Price": "205",
    "Slots": "1",
    "Armor Type": "Light",
    "Capacity": "20",
    "Usage": "1",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This system of electric motors and hydraulics augments the strength of your leg muscles, granting you a +8 enhancement bonus to Athletics checks when jumping. As long as you are proficient with the armor it takes no time to activate the leapers, you can choose to activate them or not as part of making a jump check."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 46",
    "Name": "Enviro-Sensor",
    "Level": "1",
    "Price": "250",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This sensor allows your armor to automatically activate environmental protections when the environment changes in a way contrary to your survival needs. This automatic process doesn’t require you to take or be able to take actions."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Voice-Command Module, Mk 1",
    "Level": "1",
    "Price": "250",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This microphone-linked control module allows you to activate one of your armor’s systems, such as environmental protections, with a verbal signal; no action is required. The function must require no more than a standard action for you to activate normally. Higher-end models can be linked to a number of different systems equal to the model number; different vocal commands activate each of these systems. At mk 2 and higher, this upgrade comes with an enviro-sensor built in.\n When combined with a computer interface, this upgrade has a voice command module that functions as a number of extra control modules equal to its model number. This feature allows you to program the computer interface to automate each system linked to the voice-command module in the same way the computer interface can automate one system on its own.\n"
  },
  {
    "source": "Starfinder Armory pg. 85",
    "Name": "Slickskin",
    "Level": "1",
    "Price": "300",
    "Slots": "1",
    "Armor Type": "Light",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This upgrade gives the armor a particularly slippery coating which is generally a combination of low-friction surfaces, long-lasting lubricants, and a redesign of surfaces to remove anything likely to catch on protrusions or be easily grabbed. Your armor grants you a +2 circumstance bonus to AC against grapple combat maneuvers and a +4 bonus to Acrobatics checks when using the escape task."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Quick-Release Sheath",
    "Level": "1",
    "Price": "325",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This articulated compartment can hold a one-handed weapon of no more than light bulk. You can activate this upgrade as a swift action to put the item in your hand as though you’d drawn it."
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Agility Enhancer, Mk 1",
    "Level": "1",
    "Price": "375",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of replacing the hard corners of armor with more expensive flexible materials carefully angled and reinforced to increase mobility without sacrificing protective values. Agility enhancers reduce the armor check penalty of your armor, to a minimum of 0. Some agility enhancers apply only to Acrobatics, while others apply to any skill affected by armor check penalties. The amount depends on the agility enhancer type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 1)\u003c/b\u003e: Reduce the penalty by 1 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 5)\u003c/b\u003e: Reduce the penalty by 1 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 9)\u003c/b\u003e: Reduce the penalty by 2 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 13)\u003c/b\u003e: Reduce the penalty by 2 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 17)\u003c/b\u003e: Reduce the penalty by 3 for Acrobatics.\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in light or heavy armor.\n"
  },
  {
    "source": "Starfinder Armory pg. 85",
    "Name": "Stabilizer Springs",
    "Level": "1",
    "Price": "400",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "These carefully calibrated, high-quality springs installed around the ankles and knees of the armor make your stance more balanced. You gain a +2 circumstance bonus to Acrobatics checks to balance on narrow surfaces, a +2 circumstance bonus to AC against trip combat maneuvers, and a +2 circumstance bonus to Reflex saves against effects that knock you prone (such as the grease spell or the knee shot operative exploit)."
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Descent Thrusters",
    "Level": "1",
    "Price": "800",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "Developed by kasathan engineers long ago to help them navigate the steep cliffs of their native Kasath, descent thrusters are miniature jets that slow your fall. You fall at a rate of only 60 feet per round, and you take no damage upon landing. You can trigger decent thrusters as part of an action when jumping down, or as a reaction if you fall."
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Snarl Barbs",
    "Level": "1",
    "Price": "1,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of chains and barbs that cover your armor. Frequently used by Kuthite warriors to enhance their fearsome appearance, this upgrade also snarls near misses in close combat. When an opponent attacks you with a melee weapon and misses, you gain a +2 circumstance bonus to attack rolls when attempting to disarm your opponent of the melee weapon used for that attack until the end of your next turn."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Automated Loader",
    "Level": "2",
    "Price": "750",
    "Slots": "1",
    "Armor Type": "Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "This device attaches to powered armor and consists of a small robotic arm and a storage compartment that holds up to 2 bulk of ammunition and batteries. You can activate the automated loader as a move action to reload or recharge a weapon that’s mounted to the powered armor (but not to replace the batteries of the powered armor itself). Abilities that let you reload faster than a move action don’t apply to an automated loader."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Sustenance System, Mk 1",
    "Level": "2",
    "Price": "800",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "A sustenance system provides a way for you to consume sustenance without removing your armor or shutting down environmental protections. The basic version of this system holds 1 Bulk of actual food and drink, whether field rations, R2Es, or other cuisine. Higher model numbers function as miniaturized culinary synthesizers of the same model number, allowing the armor to produce food and drink from UPBs on verbal or text command. These nonbasic systems can also store up to 1 Bulk of UPBs.\n"
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Auto-CPR Unit",
    "Level": "2",
    "Price": "850",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This device monitors your blood pressure, heart rate, respiration, and temperature. When one or more of these vital signs falls below an acceptable level, the device administers aid, injecting you with stimulants and resuscitating you with a defibrillator as necessary. If you have 0 Hit Points and are dying, at the end of your next turn the auto-CPR unit attempts to stabilize you, attempting a Medicine check to administer first aid to stabilize you with a +5 total skill bonus. If you have a computer interface, you can have the computer control activate the auto-CPR unit to attempt first aid when you have the bleed condition, and you add the tier of the computer in the interface to the auto-CPR unit’s total Medicine bonus."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Jump Jets",
    "Level": "2",
    "Price": "1,000",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "20",
    "Usage": "2/action",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate jump jets as part of a move action in order to fly during your movement. You can fly up to 30 feet (average maneuverability) with a maximum height of 10 feet, or you can fly up to 20 feet straight up. You must land at the end of your move action. Jump jets can’t lift you if you’re encumbered."
  },
  {
    "source": "Near Space pg. 153",
    "Name": "Omnidirectional Camera",
    "Level": "2",
    "Price": "1,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This camera and holographic-display unit covers areas you can’t normally see. Activating the camera is a move action, and while the camera is active, you gain the unflankable universal creature rule."
  },
  {
    "source": "Starfinder Armory pg. 85",
    "Name": "Thrower Arms",
    "Level": "2",
    "Price": "1,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of small motors and other machinery that enhance the motions of your arms from the shoulders to the wrists, allowing you to launch weapons with a greater velocity and precision. You treat the range increments of thrown weapons as 10 feet greater than normal."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Juggernaut Boosters",
    "Level": "3",
    "Price": "1,200",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "Your armor greatly increases your momentum when you rush forward. When you move at least 20 feet toward the target before attempting a bull rush combat maneuver, you gain a +2 circumstance bonus to the check, and if the attack hits, you can move the target an additional 5 feet. Your armor also grants you a +4 bonus to Strength checks to break down doors and other barriers if you move at least 10 feet toward the barrier before attempting the check."
  },
  {
    "source": "Starfinder Armory pg. 85",
    "Name": "Quicksuit (Hybrid)",
    "Level": "3",
    "Price": "1,300",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This device forms a magical link between the different parts of your armor and adjusts the pieces so that you can dive right into or out of the armor. Donning or removing the armor requires only a standard action."
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Glamer Projector (Magic)",
    "Level": "3",
    "Price": "1,350",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of several magical metal rings that project holographic images onto your armor, completely hiding its real appearance. As a standard action, you can change the appearance of your armor to any set of normal clothes or another type of light or heavy armor. This functions as disguise self, but it is only capable of changing the appearance of your armor, not yourself or the rest of your equipment."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Voice-Command Module, Mk 2",
    "Level": "3",
    "Price": "1,350",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This microphone-linked control module allows you to activate one of your armor’s systems, such as environmental protections, with a verbal signal; no action is required. The function must require no more than a standard action for you to activate normally. Higher-end models can be linked to a number of different systems equal to the model number; different vocal commands activate each of these systems. At mk 2 and higher, this upgrade comes with an enviro-sensor built in.\n When combined with a computer interface, this upgrade has a voice command module that functions as a number of extra control modules equal to its model number. This feature allows you to program the computer interface to automate each system linked to the voice-command module in the same way the computer interface can automate one system on its own.\n"
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Hydrojet",
    "Level": "3",
    "Price": "1,400",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "20",
    "Usage": "2/hour",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "When you activate this set of impellers as a move action, you gain a swim speed equal to half your land speed. If you already have a swim speed, this upgrade instead grants a +10-foot enhancement bonus to your swim speed."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 46",
    "Name": "Hibernation System",
    "Level": "3",
    "Price": "1,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "With your verbal command and confirmation (a process that requires a standard action), a hibernation system puts you to sleep inside your armor with environmental protections active. The system can be set to awaken you after a certain amount of time or to maintain hibernation until environmental protections fail. While you hibernate, you need no extra food or water, and your environmental protections from the armor with this system installed last four times as long. Someone can awaken you from hibernation from outside your armor only by taking the time and effort to remove your armor."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Mobility Enhancer, Mk 1",
    "Level": "3",
    "Price": "1,500",
    "Slots": "1",
    "Armor Type": "Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This system of elastic braces and joint support structures reduces the stress heavy armor exerts on your body, allowing you to move faster despite the armor’s bulk. A mobility enhancer reduces the armor’s speed adjustment by an amount determined by the upgrade’s type, as listed below. The speed adjustment of the armor can’t increase above 0 feet. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 3)\u003c/b\u003e: Reduce the armor’s speed adjustment by 5 feet. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 8)\u003c/b\u003e: Reduce the armor’s speed adjustment by 10 feet.\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in heavy armor.\n"
  },
  {
    "source": "Near Space pg. 153",
    "Name": "Reactive Polarization",
    "Level": "3",
    "Price": "1,600",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "5",
    "Usage": "1",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate this upgrade as a reaction to gain a +4 circumstance bonus to a saving throw against a visual effect that would cause you to become dazzled or blinded. If you fail that save against an effect that would cause you to become blinded, you become dazzled instead."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Brown",
    "Level": "3",
    "Price": "1,600",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Exit Pod",
    "Level": "4",
    "Price": "1,750",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This body harness fits into a suit of powered armor or is built into the frame of heavy armor, allowing you to exit the armor as a move action instead of as a full action. Entering the armor is no faster with an exit pod."
  },
  {
    "source": "Near Space pg. 153",
    "Name": "Remote-Link Module",
    "Level": "4",
    "Price": "1,750",
    "Slots": "1",
    "Armor Type": "Powered",
    "Capacity": "20",
    "Usage": "1/hour",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "This upgrade comes with a control computer module that can be used to pilot a suit of linked powered armor while no creature is wearing it. You can pilot the suit of powered armor that has the upgrade, activating the upgrade as a move action to move the linked armor up to its land speed. You can instead take a full action to activate the linked armor and have it automatically follow the remote at a selected distance from 5 to 500 feet. The linked powered armor can otherwise take no actions or carry any objects or creatures. If the linked armor is ever more than 500 feet from the remote, it immediately stops in place and must be reactivated to be used again."
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Hover Field",
    "Level": "4",
    "Price": "1,800",
    "Slots": "1",
    "Armor Type": "Light",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This system of minor gravity generators creates an invisible but supportive gravitational bubble underneath you, supporting your weight from below by anchoring to a stable surface within an inch or so of your feet, without placing downward pressure on that surface. You hover an inch above the ground, and you don’t leave tracks or trigger any mechanical traps that use a floor-based location trigger. The gravitational bubble needs a strong, stable surface to remain stable—you can move briefly across delicate flooring that won’t support your weight and across water or other liquid surfaces, but you must end your move on a surface that can support you normally or this upgrade ceases to function until you are once more on a stable surface for a full round."
  },
  {
    "source": "Near Space pg. 152",
    "Name": "Climate Control Unit",
    "Level": "4",
    "Price": "1,950",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade is used primarily on long expeditions into hostile environments. You treat your armor as 3 levels higher for the purposes of determining the duration of its environmental protections and resisting radiation."
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Flashblinders, MK 1",
    "Level": "4",
    "Price": "2,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "The crystals used at the core of this upgrade are harvested from a slow-moving, geode-like beast that hunts the dark side of Verces and stuns its prey with flashes of light. You can activate this upgrade as a move action to emit a strobe-like burst of radiance. All creatures other than you within 20 feet must succeed at a Reflex saving throw (DC \u003d 10 + half the upgrade’s item level + your Dexterity modifier) or become blind for 1 round. A set of flashblinders recharges automatically after 1 minute.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Backup Generator",
    "Level": "4",
    "Price": "2,100",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "You can connect charged electric items such as batteries to this miniature generator to recharge them. The electricity comes from the kinetic energy of your movement, which generates 1 charge every 10 minutes of movement. No more than one item can be plugged in at a time, and the generator doesn’t produce charges when you’re resting or otherwise stationary."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Longstrider Module",
    "Level": "4",
    "Price": "2,200",
    "Slots": "1",
    "Armor Type": "Light",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This actuator system mimics the action of leg muscles and tendons when you run, providing assistance and support at the ankles, knees, and hips. This grants you a +10-foot enhancement bonus to your land speed."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Sustenance System, Mk 2",
    "Level": "4",
    "Price": "2,200",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "A sustenance system provides a way for you to consume sustenance without removing your armor or shutting down environmental protections. The basic version of this system holds 1 Bulk of actual food and drink, whether field rations, R2Es, or other cuisine. Higher model numbers function as miniaturized culinary synthesizers of the same model number, allowing the armor to produce food and drink from UPBs on verbal or text command. These nonbasic systems can also store up to 1 Bulk of UPBs.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Targeting Computer",
    "Level": "4",
    "Price": "2,250",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This targeting computer helps you compensate for poor visibility conditions. Ignore concealment on attacks you make. This doesn’t have any effect against targets with total concealment."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Load Lifter",
    "Level": "5",
    "Price": "2,250",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This set of artificial muscles increases the amount of bulk you can carry while wearing your armor by 3."
  },
  {
    "source": "Near Space pg. 153",
    "Name": "Telepathic Dampener (Magic)",
    "Level": "5",
    "Price": "2,700",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You gain a +2 circumstance bonus to saves against mind-affecting effects, but you can’t use or receive telepathic communication."
  },
  {
    "source": "Alien Archive 4 pg. 133",
    "Name": "Molting Coat Module, Mk 1",
    "Level": "5",
    "Price": "2,700",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "A molting coat module replicates the quick-molting skin of a vasporan. You can activate the module as a reaction when you are hit by an attack targeting your KAC while in an atmosphere. You reduce the attack’s damage by an amount equal to 5 × the upgrade’s mark number. This reduction applies only to the triggering attack and stacks with one other source of damage reduction or resistance. The module requires 1 hour to secrete a new coat before it can be used again.\n"
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Voice-Command Module, Mk 3",
    "Level": "5",
    "Price": "2,700",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This microphone-linked control module allows you to activate one of your armor’s systems, such as environmental protections, with a verbal signal; no action is required. The function must require no more than a standard action for you to activate normally. Higher-end models can be linked to a number of different systems equal to the model number; different vocal commands activate each of these systems. At mk 2 and higher, this upgrade comes with an enviro-sensor built in.\n When combined with a computer interface, this upgrade has a voice command module that functions as a number of extra control modules equal to its model number. This feature allows you to program the computer interface to automate each system linked to the voice-command module in the same way the computer interface can automate one system on its own.\n"
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Rampart Plates",
    "Level": "5",
    "Price": "2,850",
    "Slots": "1",
    "Armor Type": "Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "These extra-thick armor plates don’t increase your defense in general, but add a little extra protection when you specifically try to defend yourself. When you have the cowering condition or take the total defense or withdraw action, you gain a +2 bonus to AC."
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Ghost Armor (Magic)",
    "Level": "5",
    "Price": "2,900",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "A ghost armor upgrade consists of ornate silver bands, which create an incorporeal double of your armor and make the armor look gray and insubstantial. The armor grants you a +2 bonus to your EAC against attacks from incorporeal creatures."
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Agility Enhancer, Mk 2",
    "Level": "5",
    "Price": "3,000",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of replacing the hard corners of armor with more expensive flexible materials carefully angled and reinforced to increase mobility without sacrificing protective values. Agility enhancers reduce the armor check penalty of your armor, to a minimum of 0. Some agility enhancers apply only to Acrobatics, while others apply to any skill affected by armor check penalties. The amount depends on the agility enhancer type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 1)\u003c/b\u003e: Reduce the penalty by 1 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 5)\u003c/b\u003e: Reduce the penalty by 1 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 9)\u003c/b\u003e: Reduce the penalty by 2 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 13)\u003c/b\u003e: Reduce the penalty by 2 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 17)\u003c/b\u003e: Reduce the penalty by 3 for Acrobatics.\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in light or heavy armor.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Electrostatic Field, MK 1",
    "Level": "5",
    "Price": "3,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This field over your armor grants you electricity resistance, and any creature that touches you or deals damage to you with a melee weapon takes electricity damage. The resistance granted and damage dealt depend on this upgrade’s type, as noted below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1\u003c/b\u003e: Resistance 5 and 1d6 electricity damage.\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2\u003c/b\u003e: Resistance 10 and 2d6 electricity damage.\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3\u003c/b\u003e: Resistance 15 and 3d6 electricity damage.\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Jetpack",
    "Level": "5",
    "Price": "3,100",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "40",
    "Usage": "2/round",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "You gain a fly speed of 30 feet (average maneuverability). You can use this for “cruising flight” at a usage of only 1 charge per minute, but you are flat-footed and off-target while doing so. Changing from normal flight to cruising flight or vice versa is a standard action. A jetpack can’t lift you if you’re encumbered."
  },
  {
    "source": "Alien Archive 4 pg. 11",
    "Name": "Reverberation Amplifier",
    "Level": "5",
    "Price": "3,300",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "Adding specially modified arabuk antlers to your armor allows you to harness their amplifying properties for your own sonic attacks. The armor upgrade makes a soft clicking sound reminiscent of an arabuk’s hunting clicks. This sound and the antler’s amplifying properties impose a –8 penalty on your Stealth checks while wearing this armor. When you use a weapon to deal sonic damage to a single target, you deal additional damage equal to half the weapon’s item level. In addition, once per day as a reaction when you would take sonic damage, you can overcharge the amplifier to reduce that damage by half."
  },
  {
    "source": "Alien Archive 4 pg. 83",
    "Name": "Plasma Pain (Hybrid)",
    "Level": "5",
    "Price": "3,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "Your armor’s painted patterns channel incoming energy, either dissipating it entirely or directing it into your weapons. You gain electricity resistance 5. When you take 5 or more electricity damage from a single attack or effect (before applying your resistance), you glow in a 10-foot radius (increasing the light level by one step, up to normal light) until the end of your next turn. During this time, any electricity damage you deal with non-analog weapons before the end of your next turn increases by 1d6."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Thermal Capacitor, MK 1",
    "Level": "5",
    "Price": "3,600",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade regulates heat, protecting you from extreme temperatures. You can exist comfortably in conditions between –50° and 170° F without needing to attempt Fortitude saves. In addition, the armor grants cold resistance and fire resistance. The amount depends on the capacitor’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1\u003c/b\u003e: Resistance 5\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2\u003c/b\u003e: Resistance 10\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3\u003c/b\u003e: Resistance 15\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Brightlight Projector (Hybrid)",
    "Level": "6",
    "Price": "3,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "20",
    "Usage": "1/hour",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This set of magical illumination functions as a light projector, except its magical light can penetrate even magical darkness. While this upgrade is active, your melee attacks gain the bright weapon special property."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Phase Shield",
    "Level": "6",
    "Price": "4,325",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "40",
    "Usage": "2",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "You can activate this upgrade to generate a glowing, translucent blue shield on one of your arms that helps you block incoming attacks. Activating or deactivating the shield takes a move action. While the shield is active, you gain a +1 enhancement bonus to EAC. The phase shield interferes with your ability to use the arm it’s installed on, so while the phase shield is active, you can hold an item in that hand but not use it or make attacks with it."
  },
  {
    "source": "Starfinder Armory pg. 85",
    "Name": "Tactical Scaffold",
    "Level": "6",
    "Price": "4,450",
    "Slots": "2",
    "Armor Type": "Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "As a full action, you can attach a small armor, longarm, heavy weapon, or sniper weapon to this counterweighted mechanical weapon support. Removing a weapon from it is also a full action. As a move action, you can activate the scaffold, bringing the weapon to your hand or hands. You can activate the scaffold as part of a move action to move, but Quick Draw and other abilities that allow you to draw weapons faster than normal don’t affect the time required to activate it. You can’t wield a weapon mounted to the scaffold without it being activated. When activated, the scaffold tracks your motions and provides support for the weapon attached to it, allowing you to wield two-handed weapons using only one hand. If you wield a heavy weapon with two hands while using the scaffold, treat your Strength score as 2 higher for the purpose of meeting the minimum Strength score for using heavy weapons. If you wield a sniper weapon with two hands while using the scaffold you can use its aimed range increment without taking a move action to aim. If you drop the weapon (or it is successfully disarmed), the scaffold automatically folds away and stows the weapon for later use."
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Endurance Module (Hybrid)",
    "Level": "6",
    "Price": "4,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "Using advanced technology and powerful restorative magic, this upgrade continuously stimulates your blood circulation, brain, and muscles. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. While you are wearing the armor and this upgrade has a charge, you ignore the effects of the fatigued condition. When an effect would cause you to gain the exhausted condition, as a reaction you can expend the device’s charge to be fatigued instead. The device’s charge replenishes each day."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Sustenance System, Mk 3",
    "Level": "6",
    "Price": "4,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "A sustenance system provides a way for you to consume sustenance without removing your armor or shutting down environmental protections. The basic version of this system holds 1 Bulk of actual food and drink, whether field rations, R2Es, or other cuisine. Higher model numbers function as miniaturized culinary synthesizers of the same model number, allowing the armor to produce food and drink from UPBs on verbal or text command. These nonbasic systems can also store up to 1 Bulk of UPBs.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Purple",
    "Level": "6",
    "Price": "4,550",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Filtered Rebreather",
    "Level": "6",
    "Price": "4,600",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "This upgraded rebreather supplements your armor’s ability to provide fresh air and filters out common toxins and poisonous vapors. Armor with this upgrade can provide fresh air for a number of weeks equal to its level. You also gain acid resistance 5 and a +2 bonus to saving throws against poison and disease."
  },
  {
    "source": "Alien Archive 2 pg. 65",
    "Name": "Lightwrap Inlay",
    "Level": "6",
    "Price": "5,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "L",
    "type": "armor_upgrades"
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 47",
    "Name": "Voice-Command Module, Mk 4",
    "Level": "7",
    "Price": "5,400",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This microphone-linked control module allows you to activate one of your armor’s systems, such as environmental protections, with a verbal signal; no action is required. The function must require no more than a standard action for you to activate normally. Higher-end models can be linked to a number of different systems equal to the model number; different vocal commands activate each of these systems. At mk 2 and higher, this upgrade comes with an enviro-sensor built in.\n When combined with a computer interface, this upgrade has a voice command module that functions as a number of extra control modules equal to its model number. This feature allows you to program the computer interface to automate each system linked to the voice-command module in the same way the computer interface can automate one system on its own.\n"
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Computer Interface",
    "Level": "7",
    "Price": "6,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "Your armor is wired to allow an integrated onboard computer to monitor your condition and operate some functions of your armor. An armor interface comes with a tier 1 computer with an artificial personality and a single control module linked to your armor. You can access this computer without exposing it or yourself to the environment outside of your armor, and you receive information from it through heads-up displays and broadcasts via your armor’s integrated comm unit."
  },
  {
    "source": "Near Space pg. 152",
    "Name": "Glider Foils",
    "Level": "7",
    "Price": "6,000",
    "Slots": "2",
    "Armor Type": "Light",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "As a swift action, you can deploy or undeploy these foils to increase your flight maneuverability from clumsy to average or from average to perfect. Additionally, you can deploy these gliders while falling to slow your descent to 60 feet per round and move horizontally at a rate of 5 feet for every 1 foot you fall. While the glider foils are deployed, your maximum Dexterity bonus to AC is reduced by 2 (to a minimum of 0). The glider foils have no power of their own and don’t allow you to gain altitude."
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Absorption Shield (Hybrid)",
    "Level": "7",
    "Price": "6,500",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "40",
    "Usage": "10",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "These electrically charged absorption plates can draw the force of an explosion toward you, dampening the effect for everyone else. When you are within the area of an explosion (such as that of a weapon with the explode special property or an area effect that deals damage and allows a Reflex save for half or no damage), you can activate the absorption shield as a reaction. If the explosion deals damage, you take 1-1/2 times as much damage (150%) and can’t attempt a saving throw against the explosion (or use evasion or improved evasion). Other creatures (and objects, if applicable) within the area take only half damage from the explosion (and can attempt to reduce the damage with a saving throw as normal)."
  },
  {
    "source": "Alien Archive 3 pg. 35",
    "Name": "Ferrofluid Suspension",
    "Level": "7",
    "Price": "6,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "Your armor dampens vibrations, reducing bludgeoning damage you take by 5 (to a minimum of 0) and reducing your armor check penalty to Stealth checks by 2 (to a minimum of 0). In addition, the DC of Perception checks against you is increased by 5 for creatures using blindsight (vibration) or blindsense (vibration)."
  },
  {
    "source": "Alien Archive 2 pg. 7",
    "Name": "Adaptive Defense, Mk 1 (Hybrid)",
    "Level": "7",
    "Price": "6,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "An adaptive defense module emulates the ever-shifting defense of the tekhoinos. When you take acid, cold, electricity, fire, or sonic damage from an attack, you gain resistance to that energy type equal to 5 × the upgrade’s mark number; this resistance does not apply to the triggering attack, and it lasts for 10 minutes or until you take energy damage of another of those types, triggering a new resistance.\n"
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Microspur Spray (Hybrid)",
    "Level": "7",
    "Price": "6,700",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "3",
    "Usage": "1",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "Eoxian corporations excel at technologies that use unliving materials, and the needle-sized self-replicating bone spurs in this upgrade are no exception. You can activate this upgrade as a standard action to launch microspurs in a 20-foot spread around you. All creatures in this area are affected by harrying fire. A microspur spray’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Auto-Injector",
    "Level": "7",
    "Price": "7,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This armor upgrade has a compartment the size of a small vial. As a full action, you can place a single serum or spell ampule within the compartment. As a move action, you can activate the upgrade to inject the serum into your body, where it affects you as though you had drunk it."
  },
  {
    "source": "Alien Archive 4 pg. 9",
    "Name": "Quartz Refractor (Hybrid)",
    "Level": "7",
    "Price": "7,100",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "Animated quartz swarm creators sometimes make this armor upgrade from leftover or defective quartz crystals. A series of hexagonal quartz crystals inscribed with runes are placed at regular intervals over the armor, catching light and making it refract at odd angles due to birefringence. A quartz refractor grants resistance 10 against damage dealt by laser weapons (this doesn’t stack with any other resistance that would reduce similar damage, such as fire resistance)."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Sonic Dampener",
    "Level": "7",
    "Price": "7,150",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This device muffles the incidental sounds you make, and sonic attacks lose power in your vicinity. You gain sonic resistance 5 and reduce your armor check penalty by 1 when making Stealth checks."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Deflective Reinforcement",
    "Level": "7",
    "Price": "7,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "This upgrade gives your armor a uniquely slippery texture. Your armor grants you DR 5/—. In addition, your armor check penalty is reduced by 2 when you attempt an Acrobatics check to escape."
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Explosive Defense Unit",
    "Level": "8",
    "Price": "9,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "These additional armor plates offer protection against explosions and shrapnel, granting you a +2 enhancement bonus to Reflex saves against weapons with the explode special property. As a full action, you can place a grenade inside a reinforced, eggshaped compartment in the armor upgrade. As a standard action, you can detonate the grenade. This explosion is centered on you, but the upgrade creates a temporary containment field that shields you from the explosion. In all other ways, the grenade functions normally."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Haste Circuit (Magic)",
    "Level": "8",
    "Price": "9,250",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate the haste circuit as a swift action to gain the benefits of a haste spell until you spend another swift action to deactivate it or it runs out of charges. A haste circuit’s charges replenish each day."
  },
  {
    "source": "Near Space pg. 153",
    "Name": "Mindlink Servos, Mk 1 (Hybrid)",
    "Level": "8",
    "Price": "9,500",
    "Slots": "2",
    "Armor Type": "Light, Heavy",
    "Capacity": "5",
    "Usage": "1/round",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "\u003ci\u003eMindlink servos\u003c/i\u003e allow you to move using purely mental actions. With the base model, you can move only up to a quarter your land speed in a straight line. You can’t move over difficult terrain or simple obstacles, and you can’t take a guarded step. With the more advanced mk 2 \u003ci\u003emindlink servos\u003c/i\u003e, you can move up to half your speed using purely mental actions, changing direction and moving over difficult terrain as normal.\n"
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Mobility Enhancer, Mk 2",
    "Level": "8",
    "Price": "9,500",
    "Slots": "1",
    "Armor Type": "Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This system of elastic braces and joint support structures reduces the stress heavy armor exerts on your body, allowing you to move faster despite the armor’s bulk. A mobility enhancer reduces the armor’s speed adjustment by an amount determined by the upgrade’s type, as listed below. The speed adjustment of the armor can’t increase above 0 feet. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 3)\u003c/b\u003e: Reduce the armor’s speed adjustment by 5 feet. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 8)\u003c/b\u003e: Reduce the armor’s speed adjustment by 10 feet.\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in heavy armor.\n"
  },
  {
    "source": "Alien Archive 4 pg. 75",
    "Name": "Silicon Armor Casing",
    "Level": "8",
    "Price": "10,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "A thick silicon coating infused with magitech photocells coats your armor. A silicon armor casing can store up to 10 charges, but it can’t be charged via conventional recharging methods; instead, for every 8 hours spent in an area of normal or bright light illuminated by a star, the silicon armor casing gains 1 charge. As a move action, you can expend 1 charge either to recharge 1 day of the armor’s environmental protections, or to restore 1 charge to one of the armor’s other armor upgrades. As a swift action, you can expend 2 of the armor casing’s charges to empower a melee or ranged attack, causing that attack to deal 2d6 additional fire damage if it hits (or 1d6 fire damage if the attack affects multiple creatures). As a swift action, you can expend 4 charges to increase the DC of one spell you cast before the end of your turn by 1."
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Flashblinders, MK 2",
    "Level": "8",
    "Price": "10,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "The crystals used at the core of this upgrade are harvested from a slow-moving, geode-like beast that hunts the dark side of Verces and stuns its prey with flashes of light. You can activate this upgrade as a move action to emit a strobe-like burst of radiance. All creatures other than you within 20 feet must succeed at a Reflex saving throw (DC \u003d 10 + half the upgrade’s item level + your Dexterity modifier) or become blind for 1 round. A set of flashblinders recharges automatically after 1 minute.\n"
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Grandchild\u0027s Cloak, Normal (Hybrid)",
    "Level": "8",
    "Price": "10,000",
    "Slots": "1",
    "Armor Type": "Light",
    "Capacity": "10",
    "Usage": "3/round",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This upgrade is imprinted upon the interior of the armor in the shape of a curled rat. A \u003ci\u003egrandchild’s cloak\u003c/i\u003e uses a combination of holographic fields and illusion magic to render you invisible for a short period of time. You can activate a \u003ci\u003egrandchild’s cloak\u003c/i\u003e as a move action, and its benefits last until you spend another move action to deactivate it, it runs out of charges, or if you make any kind of attack (as described in the \u003ci\u003einvisibility\u003c/i\u003e spell), whichever comes first.\n\n The much rarer \u003ci\u003egreater grandchild’s cloak\u003c/i\u003e—which followers of Grandmother Rat stridently insist does not exist—functions as a standard \u003ci\u003egrandchild’s cloak\u003c/i\u003e, but it uses only 2 charges per round and its benefits do not end if you attack.\n\n A \u003ci\u003egrandchild’s cloak’s\u003c/i\u003e charges replenish each day. This upgrade can be installed only in light armor.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Black",
    "Level": "8",
    "Price": "10,500",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Battery Unit",
    "Level": "9",
    "Price": "12,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade, usually installed on the chest or back of the armor, has a compartment capable of storing any one battery. Power cables run from the battery slot to the palms of your hands. As a full action, you can install a battery in the compartment or remove a battery from it. When you attack with a powered weapon or use a technological item you are holding in your hand, you can expend charges from the battery stored in the upgrade rather than the weapon or item’s own battery, provided that the item is capable of using a battery of that capacity."
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Haze Field (Hybrid)",
    "Level": "9",
    "Price": "13,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "Haze fields were developed on Akiton to mimic the thick haze that forms from the dust of the dry seabeds of that world. You can activate a haze field as a move action, and its benefits last until you spend another move action to deactivate it or it runs out of charges. While active, the field creates a visual haze centered on you. This has no impact on visibility at short range, but you take a –2 penalty to all attack rolls and Perception checks against targets 30 or more feet away, and creatures 30 or more feet away take the same penalties to attacks and Perception checks against you. A haze field’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Agility Enhancer, Mk 3",
    "Level": "9",
    "Price": "13,000",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of replacing the hard corners of armor with more expensive flexible materials carefully angled and reinforced to increase mobility without sacrificing protective values. Agility enhancers reduce the armor check penalty of your armor, to a minimum of 0. Some agility enhancers apply only to Acrobatics, while others apply to any skill affected by armor check penalties. The amount depends on the agility enhancer type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 1)\u003c/b\u003e: Reduce the penalty by 1 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 5)\u003c/b\u003e: Reduce the penalty by 1 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 9)\u003c/b\u003e: Reduce the penalty by 2 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 13)\u003c/b\u003e: Reduce the penalty by 2 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 17)\u003c/b\u003e: Reduce the penalty by 3 for Acrobatics.\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in light or heavy armor.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Electrostatic Field, MK 2",
    "Level": "9",
    "Price": "13,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This field over your armor grants you electricity resistance, and any creature that touches you or deals damage to you with a melee weapon takes electricity damage. The resistance granted and damage dealt depend on this upgrade’s type, as noted below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1\u003c/b\u003e: Resistance 5 and 1d6 electricity damage.\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2\u003c/b\u003e: Resistance 10 and 2d6 electricity damage.\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3\u003c/b\u003e: Resistance 15 and 3d6 electricity damage.\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Forcepack (Hybrid)",
    "Level": "9",
    "Price": "13,100",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "100",
    "Usage": "2/round",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "A forcepack grants you a fly speed of 60 feet (average maneuverability). You can use this for “cruising flight” at a usage of 1 charge per minute, but you are flat-footed and off-target while doing so. Changing from normal flight to cruising flight, or back, is a standard action. A forcepack can’t lift you if you’re encumbered."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Reaction Accelerator (Hybrid)",
    "Level": "9",
    "Price": "13,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade magically analyzes stress hormones in your bloodstream and, when you are in a threatening situation, stimulates your glands to release hormones that allow you to react quickly. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. When you roll initiative, after seeing the result of your initiative check, you can immediately spend 1 Resolve Point to reroll your initiative with an additional +4 bonus and take the better of your original result or your new result."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Medical Interface, Mk 1 (Hybrid)",
    "Level": "9",
    "Price": "14,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This medical upgrade stimulates your metabolism and natural healing capabilities with nanites. When you take a 10-minute rest to regain Stamina Points, you also recover some Hit Points. The amount of healing depends on the type of the medical interface, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 9)\u003c/b\u003e: 5 Hit Points \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 15)\u003c/b\u003e: 10 Hit Points \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 19)\u003c/b\u003e: 15 Hit Points\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Invisibility Detector (Hybrid)",
    "Level": "10",
    "Price": "17,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "5",
    "Usage": "1/minute",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "As a move action, you can activate this set of optical lenses and magitech circuitry. This upgrade must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. While the upgrade is activated, you can see invisible creatures within 120 feet as translucent shapes, per see invisibility. An invisibility detector’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Adaptive Energy Shield",
    "Level": "10",
    "Price": "17,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This intelligent polymer weave covers the entire armor. When in an unattuned state, the first time you take energy damage (acid, cold, electricity, fire, or sonic), the adaptive mesh transforms to better withstand attacks of the same type; your armor thereafter grants you energy resistance 5 against that energy type. The energy resistance does not apply to the initial attack. The armor remains attuned to that energy type (even if you take other forms of energy damage) until it has taken no damage of the attuned type for 5 minutes. It then becomes unattuned."
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Holodouble Module (Hybrid)",
    "Level": "10",
    "Price": "18,000",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This magitech device scans your body so accurately that it can project a holographic double. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. As a move action, you can create a double (as mirror image) that lasts until you spend another move action to deactivate the device or it runs out of charges. No more than one double can be active at the same time. A holodouble module’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Courage Module (Hybrid)",
    "Level": "10",
    "Price": "18,300",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "Using fear-suppressing chemicals and magic, this upgrade bolsters your Resolve. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. While you are wearing the armor and this upgrade has a charge, you ignore the effects of the shaken condition. When an effect would cause you to gain the frightened or panicked condition, as a reaction you can expend the device’s charge to be shaken for the same amount of time instead. The device’s charge replenishes each day."
  },
  {
    "source": "Alien Archive 3 pg. 57",
    "Name": "Echolocation Detection Unit",
    "Level": "10",
    "Price": "19,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "10",
    "Usage": "1/minute",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This package of delicate sensors and transmitters provides a heads-up display of the location of nearby sounds, granting you blindsense (sound) with a range of 30 feet."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, White",
    "Level": "10",
    "Price": "20,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Alien Archive 4 pg. 133",
    "Name": "Molting Coat Module, Mk 2",
    "Level": "11",
    "Price": "23,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "A molting coat module replicates the quick-molting skin of a vasporan. You can activate the module as a reaction when you are hit by an attack targeting your KAC while in an atmosphere. You reduce the attack’s damage by an amount equal to 5 × the upgrade’s mark number. This reduction applies only to the triggering attack and stacks with one other source of damage reduction or resistance. The module requires 1 hour to secrete a new coat before it can be used again.\n"
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Magic Resistor, Mk 1 (Magic)",
    "Level": "11",
    "Price": "23,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "These platinum armor plates have protective arcane sigils etched into them. They must be installed in a suit of armor for 24 hours before they function, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. The upgrade draws on your own life force and experience to grant you spell resistance. The amount depends on your level, key ability score, and the upgrade’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 11)\u003c/b\u003e: Spell resistance \u003d your key ability score modifier (maximum +4) + your character level \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 14)\u003c/b\u003e: Spell resistance \u003d your key ability score modifier (maximum +5) + your character level + 1 \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 17)\u003c/b\u003e: Spell resistance \u003d your key ability score modifier (maximum +6) + your character level + 2 \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 20)\u003c/b\u003e: Spell resistance \u003d your key ability score modifier (maximum +7) + your character level + 3\u003c/li\u003e\n\u003c/ul\u003e The mk 3 and mk 4 models can be installed only in heavy or powered armor.\n"
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Attractor Field (Hybrid)",
    "Level": "11",
    "Price": "24,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "5",
    "Usage": "1",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This module employs a combination of magnetic fields and magical energies that cause melee weapons that strike you to get stuck. It must be installed in a suit of armor for 24-hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for a 24-hour cool-down period. When an enemy hits you with a melee weapon, as a reaction you can activate this upgrade, which grants you a +4 circumstance bonus to disarm combat maneuvers to disarm the enemy of that weapon before the beginning of the enemy’s next turn. An attractor field’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Bodyguard Module (Magic)",
    "Level": "11",
    "Price": "24,400",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This shield-shaped armor plate pulses with magical energy when another upgrade of the same type is nearby. When an ally within 30 feet who is also wearing a bodyguard module takes damage, you can spend 1 Resolve Point as a reaction to cause the target to take only half the damage, and you take the amount of damage not taken by the target. The damage you take can’t be negated, reduced, or redirected in any way. Forms of harm that do not involve Hit Points or Stamina Points, such as ability drain, charm effects, death effects, permanent negative levels, and temporary ability damage, are not affected."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Lingual Scrambler (Hybrid)",
    "Level": "12",
    "Price": "32,800",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This system of miniature microphones, speakers, and advanced circuitry covers your ears. You can activate or deactivate the scrambler as a move action. While activated, you can hear most sounds normally, but the device scrambles all speech into incomprehensible nonsense, and you are treated as though you didn’t understand any languages. This makes you immune to all language-dependent abilities, regardless of whether they are being used by allies or enemies. Telepathic abilities and other forms of communication that don’t rely on intelligible speech affect you normally. For example, an envoy using the universal expression envoy improvisation can affect you with envoy improvisations that are normally language-dependent."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Electrostatic Field, MK 3",
    "Level": "12",
    "Price": "35,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This field over your armor grants you electricity resistance, and any creature that touches you or deals damage to you with a melee weapon takes electricity damage. The resistance granted and damage dealt depend on this upgrade’s type, as noted below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1\u003c/b\u003e: Resistance 5 and 1d6 electricity damage.\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2\u003c/b\u003e: Resistance 10 and 2d6 electricity damage.\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3\u003c/b\u003e: Resistance 15 and 3d6 electricity damage.\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Privacy Shield (Magic)",
    "Level": "12",
    "Price": "35,500",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "These talismans embedded into armor plates constantly shield against divination magic and surveillance technology, per nondetection. This upgrade must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for a 24-hour cool-down period."
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Thermal Capacitor, MK 2",
    "Level": "12",
    "Price": "36,250",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade regulates heat, protecting you from extreme temperatures. You can exist comfortably in conditions between –50° and 170° F without needing to attempt Fortitude saves. In addition, the armor grants cold resistance and fire resistance. The amount depends on the capacitor’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1\u003c/b\u003e: Resistance 5\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2\u003c/b\u003e: Resistance 10\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3\u003c/b\u003e: Resistance 15\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Alien Archive 3 pg. 43",
    "Name": "Neutronium Shell (Hybrid)",
    "Level": "12",
    "Price": "37,500",
    "Slots": "2",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "A suit of heavy or powered armor can be sprayed with a thin coat of magically stabilized neutronium. It takes an hour to apply a neutronium shell, and 8 hours of work to remove one. The armor grants electricity resistance 10 and resistance 15 against damage done by laser weapons or other light-based attacks (this doesn’t stack with any other resistances that would reduce similar damage, such as fire resistance)."
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Flashblinders, MK 3",
    "Level": "12",
    "Price": "38,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "The crystals used at the core of this upgrade are harvested from a slow-moving, geode-like beast that hunts the dark side of Verces and stuns its prey with flashes of light. You can activate this upgrade as a move action to emit a strobe-like burst of radiance. All creatures other than you within 20 feet must succeed at a Reflex saving throw (DC \u003d 10 + half the upgrade’s item level + your Dexterity modifier) or become blind for 1 round. A set of flashblinders recharges automatically after 1 minute.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Gray",
    "Level": "12",
    "Price": "40,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Agility Enhancer, Mk 4",
    "Level": "13",
    "Price": "46,000",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of replacing the hard corners of armor with more expensive flexible materials carefully angled and reinforced to increase mobility without sacrificing protective values. Agility enhancers reduce the armor check penalty of your armor, to a minimum of 0. Some agility enhancers apply only to Acrobatics, while others apply to any skill affected by armor check penalties. The amount depends on the agility enhancer type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 1)\u003c/b\u003e: Reduce the penalty by 1 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 5)\u003c/b\u003e: Reduce the penalty by 1 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 9)\u003c/b\u003e: Reduce the penalty by 2 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 13)\u003c/b\u003e: Reduce the penalty by 2 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 17)\u003c/b\u003e: Reduce the penalty by 3 for Acrobatics.\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in light or heavy armor.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Spell Reflector, MK 1 (Magic)",
    "Level": "13",
    "Price": "47,950",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "You can activate a \u003ci\u003espell reflector\u003c/i\u003e as a reaction when you’re targeted by a spell. This does not affect spells that include an area you are in or affect you in other ways; it affects only those that target you specifically. The spell is reflected on its caster, as if the caster had been the target. The type of \u003ci\u003espell reflector\u003c/i\u003e determines the highest level of spell it can reflect. A \u003ci\u003espell reflector’s\u003c/i\u003e charge replenishes each day.\n\n This upgrade can be installed only in light or heavy armor. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1\u003c/b\u003e: You can reflect a spell of 4th level or lower.\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2\u003c/b\u003e: You can reflect a spell of 6th level or lower.\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Indomitability Module (Hybrid)",
    "Level": "13",
    "Price": "50,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1/day",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "Using a combination of stimulating combat drugs and mobility-enhancing magic, this upgrade renders you nearly unstoppable. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. While you are wearing the armor and this upgrade has a charge, you ignore the effects of the staggered condition. When an effect would cause you to gain the dazed, paralyzed, or stunned condition, as a reaction you can expend the device’s charge to be staggered for the same amount of time instead. The device’s charge replenishes each day."
  },
  {
    "source": "Starfinder Armory pg. 85",
    "Name": "Teleportation Unit (Hybrid)",
    "Level": "13",
    "Price": "52,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "2",
    "Usage": "1",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "This upgrade combines an advanced, real-time locating system with a magical teleportation device. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. As a standard action, you can teleport (per dimension door), vanishing and reappearing in a burst of what looks like holographic pixels. A teleportation unit’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 84",
    "Name": "Life Shield (Magic)",
    "Level": "14",
    "Price": "64,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "10",
    "Usage": "1/minute",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This set of golden armor plating bears runes symbolizing death, life, and protection. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. As a move action, you can gain protection against certain necromantic attacks, per death ward, until you spend another move action to deactivate the upgrade or it runs out of charges. A life shield’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Fortified Plates, Mk 1",
    "Level": "14",
    "Price": "65,500",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This upgrade reinforces critical areas of your armor with extra defensive plates, granting you a fortification ability, which functions as a force field’s fortification except the ability is always active. The fortification granted by fortified plates doesn’t stack with a force field’s fortification or other similar abilities. The percentage depends on the upgrade’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 14)\u003c/b\u003e: 20% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 15)\u003c/b\u003e: 40% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 16)\u003c/b\u003e: 60% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 17)\u003c/b\u003e: 80% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 19)\u003c/b\u003e: 100% chance\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in heavy or powered armor.\n"
  },
  {
    "source": "Magic Resistor, Mk 2 (Magic)",
    "Name": "14",
    "Level": "70,000",
    "Price": "2",
    "Slots": "Any",
    "Armor Type": "—",
    "Capacity": "—",
    "Usage": "2",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Mindlink Servos, Mk 2 (Hybrid)",
    "Name": "14",
    "Level": "71,000",
    "Price": "2",
    "Slots": "Light, Heavy",
    "Armor Type": "5",
    "Capacity": "1/round",
    "Usage": "2",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Titan Shield",
    "Level": "14",
    "Price": "75,000",
    "Slots": "1",
    "Armor Type": "Powered",
    "Capacity": "40",
    "Usage": "10",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This emitter generates a wide, unidirectional energy shield that protects against incoming attacks. You can activate or deactivate the shield as a move action. When you activate it, choose one edge of your space. The shield extends along three continuous edges in a straight line centered on the chosen edge. The shield provides cover against attacks coming from the far side of the shield but not against attacks originating from the side you’re on."
  },
  {
    "source": "Adaptive Defense, Mk 2 (Hybrid)",
    "Name": "14",
    "Level": "75,000",
    "Price": "1",
    "Slots": "Any",
    "Armor Type": "—",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Green",
    "Level": "14",
    "Price": "80,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Medical Interface, Mk 2 (Hybrid)",
    "Name": "15",
    "Level": "100,000",
    "Price": "1",
    "Slots": "Any",
    "Armor Type": "—",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Fortified Plates, Mk 2",
    "Level": "15",
    "Price": "104,000",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This upgrade reinforces critical areas of your armor with extra defensive plates, granting you a fortification ability, which functions as a force field’s fortification except the ability is always active. The fortification granted by fortified plates doesn’t stack with a force field’s fortification or other similar abilities. The percentage depends on the upgrade’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 14)\u003c/b\u003e: 20% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 15)\u003c/b\u003e: 40% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 16)\u003c/b\u003e: 60% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 17)\u003c/b\u003e: 80% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 19)\u003c/b\u003e: 100% chance\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in heavy or powered armor.\n"
  },
  {
    "source": "Starfinder Armory pg. 82",
    "Name": "Displacement Field (Hybrid)",
    "Level": "15",
    "Price": "120,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "This optical device bends light around you. It must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours. You can activate the displacement field as a move action to gain the benefits of a displacement spell until you spend another move action to deactivate it or it runs out of charges. A displacement field’s charges replenish each day."
  },
  {
    "source": "Grandchild\u0027s Cloak, Greater (Hybrid)",
    "Name": "15",
    "Level": "120,000",
    "Price": "1",
    "Slots": "Light",
    "Armor Type": "10",
    "Capacity": "3/round",
    "Usage": "L",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Thermal Capacitor, MK 3",
    "Level": "15",
    "Price": "120,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade regulates heat, protecting you from extreme temperatures. You can exist comfortably in conditions between –50° and 170° F without needing to attempt Fortitude saves. In addition, the armor grants cold resistance and fire resistance. The amount depends on the capacitor’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1\u003c/b\u003e: Resistance 5\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2\u003c/b\u003e: Resistance 10\u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3\u003c/b\u003e: Resistance 15\u003c/li\u003e\n\u003c/ul\u003e\n"
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 50",
    "Name": "Tandem Translocator",
    "Level": "16",
    "Price": "151,000",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "40",
    "Usage": "Variable",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This armor upgrade is purchased as a set of two, each of which is installed in a different suit of armor. A creature wearing armor equipped with a tandem translocator can touch another creature also wearing such armor and take a standard action to attune the two creatures to each other. A tandem translocator can be attuned to only one other tandem translocator at a time. Once attuned, the two creatures become quantum entangled and can swap places with each other over vast distances. Twice per day, a creature wearing armor with this upgrade can take a standard action to activate the translocator and attempt to swap positions with the another creature to whom they are attuned; this other creature must take a reaction to allow this swap to occur. If the swap does occur, the two creatures exchange places. Tandem translocators work across any distance, but if the attuned creatures don’t have line of sight with each other, the creature who activated the translocator must spend a Resolve Point. Tandem translocators don’t work across planes, including the Drift; attempts to translocate across planar barriers simply fail."
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Fortified Plates, Mk 3",
    "Level": "16",
    "Price": "151,000",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This upgrade reinforces critical areas of your armor with extra defensive plates, granting you a fortification ability, which functions as a force field’s fortification except the ability is always active. The fortification granted by fortified plates doesn’t stack with a force field’s fortification or other similar abilities. The percentage depends on the upgrade’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 14)\u003c/b\u003e: 20% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 15)\u003c/b\u003e: 40% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 16)\u003c/b\u003e: 60% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 17)\u003c/b\u003e: 80% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 19)\u003c/b\u003e: 100% chance\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in heavy or powered armor.\n"
  },
  {
    "source": "Near Space pg. 152",
    "Name": "Emergency Defense Sphere (Hybrid)",
    "Level": "16",
    "Price": "162,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "3",
    "Usage": "1/round",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "An emergency defense sphere system monitors your vital signs and automatically triggers a resilient sphere centered on you if you suffer from the dying, helpless, paralyzed, or stunned conditions. The sphere functions as the spell, except its diameter extends only to the space you occupy, and the sphere remains until the unit runs out of charges. If dispelled while there are charges remaining, the sphere reactivates at the beginning of your next turn if you still have any of the triggering conditions. The upgrade must be installed in a suit of armor for 24 hours before it functions, and when the upgrade is removed from the armor, no other upgrade can use its vacated slot for 24 hours."
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Flashblinders, MK 4",
    "Level": "16",
    "Price": "180,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "The crystals used at the core of this upgrade are harvested from a slow-moving, geode-like beast that hunts the dark side of Verces and stuns its prey with flashes of light. You can activate this upgrade as a move action to emit a strobe-like burst of radiance. All creatures other than you within 20 feet must succeed at a Reflex saving throw (DC \u003d 10 + half the upgrade’s item level + your Dexterity modifier) or become blind for 1 round. A set of flashblinders recharges automatically after 1 minute.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Red",
    "Level": "16",
    "Price": "180,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 50",
    "Name": "Tandem Vitality",
    "Level": "17",
    "Price": "216,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This armor upgrade is purchased as a set of two, each of which is installed in a different suit of armor. A creature wearing armor equipped with tandem vitality can touch another creature also wearing armor with the same upgrade and take a standard action to attune the two creatures to each other. A tandem vitality upgrade can be attuned to only one other tandem vitality upgrade at a time. Once attuned, the two creatures become quantum entangled and can exchange their life force over vast distances. Once per day, a creature wearing armor with this upgrade can take a standard action to activate it, choose to take any amount of damage that doesn’t reduce the creature to 0 Hit Points, and then become staggered for 1 round. The creature to which they are attuned gains temporary Hit Points equal to half the damage taken."
  },
  {
    "source": "Starfinder Armory pg. 80",
    "Name": "Agility Enhancer, Mk 5",
    "Level": "17",
    "Price": "216,000",
    "Slots": "1",
    "Armor Type": "Light, Heavy",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "—",
    "type": "armor_upgrades",
    "desc": "This upgrade consists of replacing the hard corners of armor with more expensive flexible materials carefully angled and reinforced to increase mobility without sacrificing protective values. Agility enhancers reduce the armor check penalty of your armor, to a minimum of 0. Some agility enhancers apply only to Acrobatics, while others apply to any skill affected by armor check penalties. The amount depends on the agility enhancer type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 1)\u003c/b\u003e: Reduce the penalty by 1 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 5)\u003c/b\u003e: Reduce the penalty by 1 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 9)\u003c/b\u003e: Reduce the penalty by 2 for Acrobatics. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 13)\u003c/b\u003e: Reduce the penalty by 2 for all skills. \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 17)\u003c/b\u003e: Reduce the penalty by 3 for Acrobatics.\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in light or heavy armor.\n"
  },
  {
    "source": "Alien Archive 4 pg. 133",
    "Name": "Molting Coat Module, Mk 3",
    "Level": "17",
    "Price": "225,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "A molting coat module replicates the quick-molting skin of a vasporan. You can activate the module as a reaction when you are hit by an attack targeting your KAC while in an atmosphere. You reduce the attack’s damage by an amount equal to 5 × the upgrade’s mark number. This reduction applies only to the triggering attack and stacks with one other source of damage reduction or resistance. The module requires 1 hour to secrete a new coat before it can be used again.\n"
  },
  {
    "source": "Magic Resistor, Mk 3 (Magic)",
    "Name": "17",
    "Level": "240,000",
    "Price": "2",
    "Slots": "Heavy, Powered",
    "Armor Type": "—",
    "Capacity": "—",
    "Usage": "2",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Adaptive Defense, Mk 3 (Hybrid)",
    "Name": "17",
    "Level": "250,000",
    "Price": "1",
    "Slots": "Any",
    "Armor Type": "—",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Fortified Plates, Mk 4",
    "Level": "17",
    "Price": "262,000",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This upgrade reinforces critical areas of your armor with extra defensive plates, granting you a fortification ability, which functions as a force field’s fortification except the ability is always active. The fortification granted by fortified plates doesn’t stack with a force field’s fortification or other similar abilities. The percentage depends on the upgrade’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 14)\u003c/b\u003e: 20% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 15)\u003c/b\u003e: 40% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 16)\u003c/b\u003e: 60% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 17)\u003c/b\u003e: 80% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 19)\u003c/b\u003e: 100% chance\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in heavy or powered armor.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Blue",
    "Level": "17",
    "Price": "280,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 50",
    "Name": "Quantum Phasing",
    "Level": "18",
    "Price": "360,000",
    "Slots": "1",
    "Armor Type": "Light",
    "Capacity": "10",
    "Usage": "1/round",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "This armor upgrade allows you to rapidly and randomly transition in and out of rel-state. You can activate the upgrade as a swift action; when it is activated, attacks against you have a 50% miss chance. During this time, you are flickering in and out of existence, so the Blind-Fight feat, blindsense ability, and true seeing spell don’t help opponents locate you. While this upgrade is active, you can step through (but not see through) solid objects. If you end your turn inside a solid object, you are shunted to the nearest open space and take 1d6 bludgeoning damage per 5 feet traveled. These benefits last until you take another swift action to deactivate the upgrade or it runs out of charges. A quantum phasing upgrade’s charges replenish each day."
  },
  {
    "source": "Starfinder Armory pg. 85",
    "Name": "Vibration Sensors",
    "Level": "18",
    "Price": "360,000",
    "Slots": "1",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "These special armor plates are equipped with piezoelectric sensors connected to a computer that analyzes vibrations in the ground and the air around you, and presents the information as visual and audible input. Your armor grants you blindsight (vibration) with a range of 30 feet"
  },
  {
    "source": "Spell Reflector, MK 2 (Magic)",
    "Name": "18",
    "Level": "360,000",
    "Price": "1",
    "Slots": "Light, Heavy",
    "Armor Type": "1",
    "Capacity": "1",
    "Usage": "1",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Orange",
    "Level": "18",
    "Price": "400,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  },
  {
    "source": "Starfinder Armory pg. 83",
    "Name": "Fortified Plates, Mk 5",
    "Level": "19",
    "Price": "550,000",
    "Slots": "1",
    "Armor Type": "Heavy, Powered",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This upgrade reinforces critical areas of your armor with extra defensive plates, granting you a fortification ability, which functions as a force field’s fortification except the ability is always active. The fortification granted by fortified plates doesn’t stack with a force field’s fortification or other similar abilities. The percentage depends on the upgrade’s type, as listed below. \u003cul\u003e\n \u003cli\u003e\u003cb\u003eMk 1 (Level 14)\u003c/b\u003e: 20% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 2 (Level 15)\u003c/b\u003e: 40% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 3 (Level 16)\u003c/b\u003e: 60% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 4 (Level 17)\u003c/b\u003e: 80% chance \u003c/li\u003e\n \u003cli\u003e\u003cb\u003eMk 5 (Level 19)\u003c/b\u003e: 100% chance\u003c/li\u003e\n\u003c/ul\u003e This upgrade can be installed only in heavy or powered armor.\n"
  },
  {
    "source": "Pact Worlds pg. 197",
    "Name": "Ghostmarch Unit (Magic)",
    "Level": "19",
    "Price": "590,000",
    "Slots": "1",
    "Armor Type": "Light",
    "Capacity": "5",
    "Usage": "1/round",
    "Bulk": "1",
    "type": "armor_upgrades",
    "desc": "You can activate a ghostmarch unit as a swift action to gain the benefits of the ethereal jaunt spell until you spend another swift action to deactivate it or it runs out of charges. A ghostmarch unit’s charges replenish each day."
  },
  {
    "source": "Medical Interface, Mk 3 (Hybrid)",
    "Name": "19",
    "Level": "600,000",
    "Price": "1",
    "Slots": "Any",
    "Armor Type": "—",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 50",
    "Name": "Rel-State Contingency",
    "Level": "20",
    "Price": "800,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "2",
    "type": "armor_upgrades",
    "desc": "This upgrade monitors your environment and status, instantly placing you in rel-state whenever your life is threatened. The first time each day you would take Hit Point damage, and again the first time each day you would take damage that reduces you to 0 Hit Points, you can use this armor upgrade as a reaction. You don’t take the triggering damage, and you cease to exist until the beginning of your next turn, when you return to existence in the spot you were in when the armor upgrade activated; if this space is occupied by a physical object, you appear in the nearest unoccupied space."
  },
  {
    "source": "Magic Resistor, Mk 4 (Magic)",
    "Name": "20",
    "Level": "800,000",
    "Price": "2",
    "Slots": "Heavy, Powered",
    "Armor Type": "—",
    "Capacity": "—",
    "Usage": "2",
    "Bulk": "armor_upgrades"
  },
  {
    "source": "Starfinder Core Rulebook pg. 205",
    "Name": "Force Field, Prismatic",
    "Level": "20",
    "Price": "1,000,000",
    "Slots": "2",
    "Armor Type": "Any",
    "Capacity": "—",
    "Usage": "—",
    "Bulk": "L",
    "type": "armor_upgrades",
    "desc": "You can activate or deactivate your armor’s force field as a standard action. Once active, the device generates an invisible force field around you (a force effect), including all your worn and carried items. The force field blocks solids and liquids but not gases or light (including laser beams). You can breathe while the field is active, but you can’t eat or drink.\n\n While a force field is active, it provides you with a number of temporary Hit Points depending on the force field’s power. A force field has fast healing, meaning that it regains temporary Hit Points at a fixed rate each round at the end of your turn, up to its normal maximum. If the force field’s temporary Hit Points are reduced to 0, it is inactive until the end of your next turn, when its fast healing restores some of its Hit Points. The charge capacity, amount of temporary Hit Points granted, and rate of fast healing vary according to the force field’s color code. A force field has a usage of 1 charge per round.\n\n More powerful force fields also have a fortification ability, which gives a percentage chance that a critical hit is treated as a normal attack, dealing normal damage and not applying any critical effect. You roll your fortification percentage chance before the critical hit’s damage is rolled. If a force field is inactive, its fortification ability does not function. A suit of armor cannot support more than one force field upgrade. \n\n \u003ctable class\u003d\"inner\"\u003e \n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003eColor\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eCapacity\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eTemp HP\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFast Healing\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003eFortification\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBrown\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e1\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePurple\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e2\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlack\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e3\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eWhite\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e15\u003c/td\u003e\n   \u003ctd\u003e4\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGray\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e5\u003c/td\u003e\n   \u003ctd\u003e0%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eGreen\u003c/td\u003e\n   \u003ctd\u003e20\u003c/td\u003e\n   \u003ctd\u003e25\u003c/td\u003e\n   \u003ctd\u003e6\u003c/td\u003e\n   \u003ctd\u003e20%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eRed\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e30\u003c/td\u003e\n   \u003ctd\u003e7\u003c/td\u003e\n   \u003ctd\u003e40%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eBlue\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e35\u003c/td\u003e\n   \u003ctd\u003e8\u003c/td\u003e\n   \u003ctd\u003e60%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003eOrange\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e40\u003c/td\u003e\n   \u003ctd\u003e9\u003c/td\u003e\n   \u003ctd\u003e80%\u003c/td\u003e\n  \u003c/tr\u003e \n  \u003ctr\u003e\n   \u003ctd\u003ePrismatic\u003c/td\u003e\n   \u003ctd\u003e100\u003c/td\u003e\n   \u003ctd\u003e50\u003c/td\u003e\n   \u003ctd\u003e10\u003c/td\u003e\n   \u003ctd\u003e100%\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e\n"
  }
]