[
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Unarmed Strike",
    "Category": "—",
    "Level": "—",
    "Price": "—",
    "Damage": "1d3 B",
    "Critical": "—",
    "Bulk": "—",
    "Special": "archaic, nonlethal",
    "type": "One-Handed Weapons",
    "desc": "An unarmed strike can be dealt with any limb or appendage. Unarmed strikes deal nonlethal damage, and the damage from an unarmed strike is considered weapon damage for the purposes of effects that give you a bonus to weapon damage rolls."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Club",
    "Category": "—",
    "Level": "0",
    "Price": "—",
    "Damage": "1d6 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, archaic, thrown (10 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A club is any sort of blunt, oblong instrument with a haft suitable for gripping. Clubs can be made of stone, wood, or similar materials. Metal clubs exist as well, and they are usually hollow to keep them from being too heavy. Some Free Captains refer to clubs as belaying pins, though those archaic items are not required on starships."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Baton, Tactical",
    "Category": "—",
    "Level": "1",
    "Price": "90",
    "Damage": "1d4 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A baton is a thin, solid metal shaft, usually with a textured rubber grip. A tactical baton can be used to inflict precise bludgeoning blows. An advanced baton, used by elite mercenary and security companies, often has an additional shaft, as well as a weighted end that can be powered to connect with substantially more force than a tactical baton."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Battleglove, Cestus",
    "Category": "—",
    "Level": "1",
    "Price": "100",
    "Damage": "1d4 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Battlegloves are popular, economical choices for mercenaries and guards. These durable nylon-web or para-aramid gloves hold a weighted plate over the wearer’s knuckles. You can hold other objects or weapons in a hand wearing a glove, but you can’t use the glove to make attacks while doing so."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Handaxe, Basic",
    "Category": "—",
    "Level": "1",
    "Price": "90",
    "Damage": "1d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A balanced, wedge-shaped blade affixed to a lightweight haft, a handaxe can be wielded in melee or thrown. The flexibility of handaxes makes them a favorite of explorers of all types, and the basic handaxe is a common tool that can be used as a weapon. A tactical handaxe is made of a stronger, lightweight alloy, while the sintered handaxe uses a denser ceramic material for added heft and a much keener edge. An ultrathin handaxe has a blade so thin it can’t be seen clearly, while the molecular rift handaxe has a blade narrow enough to slice between molecules. Most handaxes have blade covers to prevent accidental injury to the wielder."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Knife, Survival",
    "Category": "—",
    "Level": "1",
    "Price": "95",
    "Damage": "1d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "These light blades can be used for both mundane tasks and combat. A typical survival knife has a fixed, single-edged, carbonsteel or ceramic blade and is treated against corrosion. Tactical knives have large, double-edged blades, often with a section of serrated blade near the haft, and they come in both fixed- and folding-blade designs; users may prefer one style or the other, but the two are identical in terms of price, weight, and damage dealt."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Sword Cane, Tactical",
    "Category": "—",
    "Level": "1",
    "Price": "250",
    "Damage": "1d4 P",
    "Critical": "bleed 1d3",
    "Bulk": "L",
    "Special": "analog, operative",
    "type": "One-Handed Weapons",
    "desc": "This thin blade comes with a scabbard that makes it resemble a stylish cane. Sword canes are popular on Absalom Station, where similar nonweapon items have some popularity as fashionable affectations. A sword cane can incorporate one of the following at the standard price for that item: 20 feet of retractable cable line, a personal comm unit, or a spotlight. A successful Perception check (DC \u003d 15 + the weapon’s item level) is required to identify a sword cane as a weapon when it is sheathed."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Stick, Standard",
    "Category": "—",
    "Level": "1",
    "Price": "125",
    "Damage": "1d3 P",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Conceal, injection, operative",
    "type": "One-Handed Weapons",
    "desc": "This weapon is a lightweight, handheld auto-injector device designed to quickly inject drugs, poison, and similar substance into a creature when pressed against its body. A syringe stick’s patented spring-loaded design features a sturdy needle able to punch through the toughest armor, chitin, and hide. Despite its deadliness, it is difficult to discern a syringe stick from a medicinal auto-injector."
  },
  {
    "source": "SFS Scenario #1-04: Cries From the Drift pg. 12",
    "Name": "Idaran Force Training Baton",
    "Category": "—",
    "Level": "2",
    "Price": "400",
    "Damage": "1d4 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "operative, powered (capacity 20, usage 1)",
    "type": "One-Handed Weapons",
    "desc": "This looks like a normal tactical baton, except it is much thinner and lighter. The baton has passive nanoengineering such that swinging it hard enough through any atmosphere creates an electromagnetic force."
  },
  {
    "source": "Alien Archive pg. 31",
    "Name": "Bone Cestus, Austere",
    "Category": "—",
    "Level": "2",
    "Price": "600",
    "Damage": "1d6 P",
    "Critical": "bleed 1d4",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Centuries ago, some kasathas crafted simple weapons out of crest-eaters’ bony protrusions; these formidable gauntlets were badges of honor for the mightiest kasathan warriors, and modern artisans have recreated that aesthetic in the form of bone cestuses, though now they are usually formed of state-of-the-art resin instead of crest-eater bone. Due to the flecks of minerals embedded within, bone cestuses are often warm to the touch, especially after they have been exposed to natural sunlight. These basic one-handed melee weapons are capable of punching through a foe’s defenses, sometimes puncturing vital organs in the process."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dueling Sword, Tactical",
    "Category": "—",
    "Level": "2",
    "Price": "475",
    "Damage": "1d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "While dueling swords are crafted to be aesthetically pleasing and are often seen as a mark of rank or tradition, many warriors still train with them to deadly effect. The powered blades of both buzzblade and ripper dueling swords bring this danger into the modern era, while the molecular rift sword—though unpowered— uses a field of disrupted molecules along its blade to slice through nearly anything, and must be stored in a magnetic sheath that never actually touches the blade."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 44",
    "Name": "Electric Prod, Jolt",
    "Category": "—",
    "Level": "2",
    "Price": "900",
    "Damage": "1d4 E",
    "Critical": "Stunned",
    "Bulk": "1",
    "Special": "Nonlethal, powered (capacity 20, usage 1), professional (farmer)",
    "type": "One-Handed Weapons",
    "desc": "Company personnel must occasionally transport animals from one world to another. Large herd animals, such as ruthigs, can be notoriously stubborn, and sometimes a beast proves more dangerous than anticipated. In these situations, crews appreciate this stout electric prod capable of delivering a nonlethal shock that can stun or incapacitate even a surly wolliped. Electric prods see civilian use on Castrovel, Triaxus, and other worlds, where ranchers and farmers utilize them to keep large animals under control without causing permanent harm."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Sap, Light",
    "Category": "—",
    "Level": "2",
    "Price": "450",
    "Damage": "1d4 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, nonlethal, operative",
    "type": "One-Handed Weapons",
    "desc": "A weapon dating back to antiquity, a sap is shaped like a large, flat spoon with a heavily weighted end. Archaeological digs have verified that almost every society develops an analog to the sap. Modern versions are constructed from high-tech fiber and dense alloys. Although sap models are referred to as light, medium, and heavy by users, it’s the rare materials used in various models, and not their actual weight, that make them progressively better at bludgeoning victims into unconsciousness."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Sledge",
    "Category": "—",
    "Level": "3",
    "Price": "1,050",
    "Damage": "1d8 B",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, unwieldy",
    "type": "One-Handed Weapons",
    "desc": "Similar to the assault hammer, the sledge has an exceptionally dense weighted head and a strong haft. This unbalanced design makes the hammer more difficult to swing, but its strikes pack a punch."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Switchblade, Tactical",
    "Category": "—",
    "Level": "3",
    "Price": "1,300",
    "Damage": "1d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, conceal, operative",
    "type": "One-Handed Weapons",
    "desc": "This blade looks much like a single-edged survival knife when opened, but the blade can be folded or collapsed to fit within the grip, making it easier to conceal. A switch on the knife means the blade can be folded or extended as a swift action, or as part of making an attack or full attack. Most weapon manufacturers that offer daggers also produce switchblades, which are made in the same models: tactical, ultrathin, zero-edge, and molecular rift."
  },
  {
    "source": "Starfinder #2: Temple of the Twelve pg. 12",
    "Name": "Inferno Knife",
    "Category": "—",
    "Level": "4",
    "Price": "2,100",
    "Damage": "1d4 S",
    "Critical": "burn 1d6",
    "Bulk": "L",
    "Special": "analog, operative",
    "type": "One-Handed Weapons",
    "desc": "Not all developments in military technology are successful. Originally designed to be a perfect survival tool, the inferno knife combines the cutting prowess of a survival knife with the virtues of a lighter and road flare. By squeezing one trigger, the user can inject a small stream of fuel from the hilt’s reservoir onto the blade’s tip, and a secondary trigger can ignite it, creating a small torch to signal others or light campfires. The product’s launch was disastrous, and users logged hundreds of complaints about the knives’ needless complexity. As a result, inferno knives have flooded the market and become showy weapons for criminals and performers, though timing the blade’s ignition in combat remains an unpredictable art."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Tailblade",
    "Category": "—",
    "Level": "4",
    "Price": "2,300",
    "Damage": "1d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, operative, tail",
    "type": "One-Handed Weapons",
    "desc": "Developed by ysoki on Akiton, this slender, lightweight blade has a series of bands that attach the blade to a tail or similar anatomy. Although using a tailblade doesn’t allow you to make additional attacks, it can free up your hands without leaving you unarmed."
  },
  {
    "source": "Alien Archive 2 pg. 23",
    "Name": "Dueling Sword (Corpse Fleet), Converted",
    "Category": "—",
    "Level": "4",
    "Price": "2,100",
    "Damage": "1d8 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Members of the Corpse Fleet earn their dueling swords through tallied kill counts, while officers receive their blades as part of the transition to the rank of commander. Corpse Fleet admirals’ blades are some of the keenest weapons in the known galaxy. Although the weapons are mainly used by the Corpse Fleet, the undead navy leaks some versions into the markets on Eox."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Handaxe, Tactical",
    "Category": "—",
    "Level": "4",
    "Price": "1,825",
    "Damage": "1d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A balanced, wedge-shaped blade affixed to a lightweight haft, a handaxe can be wielded in melee or thrown. The flexibility of handaxes makes them a favorite of explorers of all types, and the basic handaxe is a common tool that can be used as a weapon. A tactical handaxe is made of a stronger, lightweight alloy, while the sintered handaxe uses a denser ceramic material for added heft and a much keener edge. An ultrathin handaxe has a blade so thin it can’t be seen clearly, while the molecular rift handaxe has a blade narrow enough to slice between molecules. Most handaxes have blade covers to prevent accidental injury to the wielder."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Sword Cane, Advanced",
    "Category": "—",
    "Level": "4",
    "Price": "2,100",
    "Damage": "1d4 P",
    "Critical": "bleed 1d4",
    "Bulk": "L",
    "Special": "analog, operative",
    "type": "One-Handed Weapons",
    "desc": "This thin blade comes with a scabbard that makes it resemble a stylish cane. Sword canes are popular on Absalom Station, where similar nonweapon items have some popularity as fashionable affectations. A sword cane can incorporate one of the following at the standard price for that item: 20 feet of retractable cable line, a personal comm unit, or a spotlight. A successful Perception check (DC \u003d 15 + the weapon’s item level) is required to identify a sword cane as a weapon when it is sheathed."
  },
  {
    "source": "Alien Archive 4 pg. 51",
    "Name": "Ignurso Knuckles, Ember",
    "Category": "—",
    "Level": "5",
    "Price": "3,100",
    "Damage": "1d6 F \u0026 S",
    "Critical": "Wound",
    "Bulk": "L",
    "Special": "Analog, penetrating",
    "type": "One-Handed Weapons",
    "desc": "Ignursos wield enough strength to punch through rock, and even after death, their claws ignite with momentary heat when struck against another surface. Weaponsmiths can stabilize the claws’ supernatural ignition and incorporate them into bladed gauntlets known as ignurso knuckles. These gauntlets’ ignurso-hide coverings protect the wielder from the claws’ heat, and high-end models allow the claws to retract into wrist sheathes."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Retractable Spike, Tactical",
    "Category": "—",
    "Level": "5",
    "Price": "3,150",
    "Damage": "1d4 P",
    "Critical": "—",
    "Bulk": "L",
    "Special": "conceal, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "These keen-edged spikes are installed in an armor upgrade slot rather than held, stored in a surface slot in armor or an android’s body until extended. You can extend the spike as a move action and retract the spike as a swift action. Such a spike usually extends from the elbow, foot, knee, or wrist, but a spike can be fitted into a helmet or an android’s head for use in headbutting or goring foes. Retractable spikes are widely available throughout the Pact Worlds, with the various models—tactical, advanced, elite, and paragon—having individual rarity based on the credit outlay to acquire a given model."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Spined Blade, Basic",
    "Category": "—",
    "Level": "5",
    "Price": "2,600",
    "Damage": "1d6 P",
    "Critical": "injection DC +2",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Kasathas on their home world wielded spined blades to better poison foes. Replicas of these ancient weapons can be found in the Museum of Ancestral Technology on the Idari. Modern warriors use refined versions of the weapon that are effective at delivering poisons and similar substances through contemporary armor. You apply such substances to the blade per rules found on page 232 of the Core Rulebook. While the basic version of the spined blade is generally analog, more advanced buzzblade, ripper, gravity, and rivener models are powered weapons."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Stick, Sharp-pointed",
    "Category": "—",
    "Level": "5",
    "Price": "2,650",
    "Damage": "1d4 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, operative",
    "type": "One-Handed Weapons",
    "desc": "This weapon is a lightweight, handheld auto-injector device designed to quickly inject drugs, poison, and similar substance into a creature when pressed against its body. A syringe stick’s patented spring-loaded design features a sturdy needle able to punch through the toughest armor, chitin, and hide. Despite its deadliness, it is difficult to discern a syringe stick from a medicinal auto-injector."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 44",
    "Name": "Electric Prod, Impulse",
    "Category": "—",
    "Level": "6",
    "Price": "4,500",
    "Damage": "1d6 E",
    "Critical": "Stunned",
    "Bulk": "1",
    "Special": "Nonlethal, powered (capacity 20, usage 1), professional (farmer)",
    "type": "One-Handed Weapons",
    "desc": "Company personnel must occasionally transport animals from one world to another. Large herd animals, such as ruthigs, can be notoriously stubborn, and sometimes a beast proves more dangerous than anticipated. In these situations, crews appreciate this stout electric prod capable of delivering a nonlethal shock that can stun or incapacitate even a surly wolliped. Electric prods see civilian use on Castrovel, Triaxus, and other worlds, where ranchers and farmers utilize them to keep large animals under control without causing permanent harm."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 44",
    "Name": "Polyclub, Tactical",
    "Category": "—",
    "Level": "6",
    "Price": "4,200",
    "Damage": "1d6 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, polymorphic",
    "type": "One-Handed Weapons",
    "desc": "Weaponized polyfluid applications are just beginning to be explored. Polyfluid’s plasticity has already been applied to some melee weapons, resulting in the polymorphic weapon special property."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 48",
    "Name": "Retractable Stinger, Tactical",
    "Category": "—",
    "Level": "6",
    "Price": "4,300",
    "Damage": "1d4 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "This hollow stinger is installed in an armor upgrade slot. It is typically stored in a limb of the armor (though some androids use it to augment their headbutts). The stinger must be extended to be used as a weapon or to refill its injection reservoir. Extending or retracting the stinger is a move action."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Sap, Medium",
    "Category": "—",
    "Level": "6",
    "Price": "3,900",
    "Damage": "1d6 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, nonlethal, operative",
    "type": "One-Handed Weapons",
    "desc": "A weapon dating back to antiquity, a sap is shaped like a large, flat spoon with a heavily weighted end. Archaeological digs have verified that almost every society develops an analog to the sap. Modern versions are constructed from high-tech fiber and dense alloys. Although sap models are referred to as light, medium, and heavy by users, it’s the rare materials used in various models, and not their actual weight, that make them progressively better at bludgeoning victims into unconsciousness."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Shell Knuckles, Tactical",
    "Category": "—",
    "Level": "6",
    "Price": "4,050",
    "Damage": "3d4 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, shells (1; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "This bulky glove fits over the user’s hand, with reinforced plates covering the knuckles. When the weapon connects with a target, the kinetic force fires scattergun shells into the target and deal impressive bludgeoning damage. Mercenaries favor these weapons for fighting at close quarters, and pirates sometimes use them to make their punches all the more dramatic. Shell knuckles are available in tactical, advanced, elite, and paragon models."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Hook Knife",
    "Category": "—",
    "Level": "7",
    "Price": "6,300",
    "Damage": "1d8 S",
    "Critical": "bleed 1d6",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Slightly longer than a survival knife, a hook knife features a wicked barb along the blade’s back edge and deals vicious wounds to enemies when wielded effectively. The drow invented the hook knife, but the weapon is a favorite among cruel mercenaries and other unsavory types."
  },
  {
    "source": "Alien Archive pg. 31",
    "Name": "Bone Cestus, Measured",
    "Category": "—",
    "Level": "7",
    "Price": "5,500",
    "Damage": "2d6 P",
    "Critical": "bleed 1d6",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Centuries ago, some kasathas crafted simple weapons out of crest-eaters’ bony protrusions; these formidable gauntlets were badges of honor for the mightiest kasathan warriors, and modern artisans have recreated that aesthetic in the form of bone cestuses, though now they are usually formed of state-of-the-art resin instead of crest-eater bone. Due to the flecks of minerals embedded within, bone cestuses are often warm to the touch, especially after they have been exposed to natural sunlight. These basic one-handed melee weapons are capable of punching through a foe’s defenses, sometimes puncturing vital organs in the process."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Knife, Tactical",
    "Category": "—",
    "Level": "7",
    "Price": "6,000",
    "Damage": "2d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "These light blades can be used for both mundane tasks and combat. A typical survival knife has a fixed, single-edged, carbonsteel or ceramic blade and is treated against corrosion. Tactical knives have large, double-edged blades, often with a section of serrated blade near the haft, and they come in both fixed- and folding-blade designs; users may prefer one style or the other, but the two are identical in terms of price, weight, and damage dealt."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Sword Cane, Ultrathin",
    "Category": "—",
    "Level": "7",
    "Price": "7,000",
    "Damage": "2d4 P",
    "Critical": "bleed 1d4",
    "Bulk": "L",
    "Special": "analog, operative",
    "type": "One-Handed Weapons",
    "desc": "This thin blade comes with a scabbard that makes it resemble a stylish cane. Sword canes are popular on Absalom Station, where similar nonweapon items have some popularity as fashionable affectations. A sword cane can incorporate one of the following at the standard price for that item: 20 feet of retractable cable line, a personal comm unit, or a spotlight. A successful Perception check (DC \u003d 15 + the weapon’s item level) is required to identify a sword cane as a weapon when it is sheathed."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dueling Sword, Buzzblade",
    "Category": "—",
    "Level": "8",
    "Price": "9,500",
    "Damage": "2d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "powered (capacity 20; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "While dueling swords are crafted to be aesthetically pleasing and are often seen as a mark of rank or tradition, many warriors still train with them to deadly effect. The powered blades of both buzzblade and ripper dueling swords bring this danger into the modern era, while the molecular rift sword—though unpowered— uses a field of disrupted molecules along its blade to slice through nearly anything, and must be stored in a magnetic sheath that never actually touches the blade."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Spined Blade, Buzzblade",
    "Category": "—",
    "Level": "8",
    "Price": "9,400",
    "Damage": "1d10 P",
    "Critical": "injection DC +2",
    "Bulk": "L",
    "Special": "powered (capacity 20; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "Kasathas on their home world wielded spined blades to better poison foes. Replicas of these ancient weapons can be found in the Museum of Ancestral Technology on the Idari. Modern warriors use refined versions of the weapon that are effective at delivering poisons and similar substances through contemporary armor. You apply such substances to the blade per rules found on page 232 of the Core Rulebook. While the basic version of the spined blade is generally analog, more advanced buzzblade, ripper, gravity, and rivener models are powered weapons."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Switchblade, Ultrathin",
    "Category": "—",
    "Level": "8",
    "Price": "9,100",
    "Damage": "2d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, conceal, operative",
    "type": "One-Handed Weapons",
    "desc": "This blade looks much like a single-edged survival knife when opened, but the blade can be folded or collapsed to fit within the grip, making it easier to conceal. A switch on the knife means the blade can be folded or extended as a swift action, or as part of making an attack or full attack. Most weapon manufacturers that offer daggers also produce switchblades, which are made in the same models: tactical, ultrathin, zero-edge, and molecular rift."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Incapacitator",
    "Category": "—",
    "Level": "9",
    "Price": "14,200",
    "Damage": "3d4 B",
    "Critical": "staggered",
    "Bulk": "L",
    "Special": "nonlethal, operative, powered (capacity 20; usage 2)",
    "type": "One-Handed Weapons",
    "desc": "When this nonreflective, dark-gray baton connects with a target, it discharges an electrical pulse that can stagger its victim."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Handaxe, Sintered",
    "Category": "—",
    "Level": "9",
    "Price": "12,500",
    "Damage": "2d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, thrown (30 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A balanced, wedge-shaped blade affixed to a lightweight haft, a handaxe can be wielded in melee or thrown. The flexibility of handaxes makes them a favorite of explorers of all types, and the basic handaxe is a common tool that can be used as a weapon. A tactical handaxe is made of a stronger, lightweight alloy, while the sintered handaxe uses a denser ceramic material for added heft and a much keener edge. An ultrathin handaxe has a blade so thin it can’t be seen clearly, while the molecular rift handaxe has a blade narrow enough to slice between molecules. Most handaxes have blade covers to prevent accidental injury to the wielder."
  },
  {
    "source": "Alien Archive 4 pg. 51",
    "Name": "Ignurso Knuckles, Blaze",
    "Category": "—",
    "Level": "9",
    "Price": "13,500",
    "Damage": "2d6 F \u0026 S",
    "Critical": "Wound",
    "Bulk": "L",
    "Special": "Analog, penetrating",
    "type": "One-Handed Weapons",
    "desc": "Ignursos wield enough strength to punch through rock, and even after death, their claws ignite with momentary heat when struck against another surface. Weaponsmiths can stabilize the claws’ supernatural ignition and incorporate them into bladed gauntlets known as ignurso knuckles. These gauntlets’ ignurso-hide coverings protect the wielder from the claws’ heat, and high-end models allow the claws to retract into wrist sheathes."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 48",
    "Name": "Retractable Stinger, Advanced",
    "Category": "—",
    "Level": "9",
    "Price": "13,900",
    "Damage": "1d10 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "This hollow stinger is installed in an armor upgrade slot. It is typically stored in a limb of the armor (though some androids use it to augment their headbutts). The stinger must be extended to be used as a weapon or to refill its injection reservoir. Extending or retracting the stinger is a move action."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Stick, Hyper-pointed",
    "Category": "—",
    "Level": "9",
    "Price": "12,000",
    "Damage": "2d4 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, operative",
    "type": "One-Handed Weapons",
    "desc": "This weapon is a lightweight, handheld auto-injector device designed to quickly inject drugs, poison, and similar substance into a creature when pressed against its body. A syringe stick’s patented spring-loaded design features a sturdy needle able to punch through the toughest armor, chitin, and hide. Despite its deadliness, it is difficult to discern a syringe stick from a medicinal auto-injector."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Battleglove, Power",
    "Category": "—",
    "Level": "10",
    "Price": "16,100",
    "Damage": "2d8 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "powered (capacity 20; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "Battlegloves are popular, economical choices for mercenaries and guards. These durable nylon-web or para-aramid gloves hold a weighted plate over the wearer’s knuckles. You can hold other objects or weapons in a hand wearing a glove, but you can’t use the glove to make attacks while doing so."
  },
  {
    "source": "Alien Archive 2 pg. 23",
    "Name": "Dueling Sword (Corpse Fleet), Officer",
    "Category": "—",
    "Level": "10",
    "Price": "18,795",
    "Damage": "3d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Members of the Corpse Fleet earn their dueling swords through tallied kill counts, while officers receive their blades as part of the transition to the rank of commander. Corpse Fleet admirals’ blades are some of the keenest weapons in the known galaxy. Although the weapons are mainly used by the Corpse Fleet, the undead navy leaks some versions into the markets on Eox."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 44",
    "Name": "Electric Prod, Storm",
    "Category": "—",
    "Level": "10",
    "Price": "19,000",
    "Damage": "2d6 E",
    "Critical": "Stunned",
    "Bulk": "1",
    "Special": "Nonlethal, powered (capacity 20, usage 2), professional (farmer)",
    "type": "One-Handed Weapons",
    "desc": "Company personnel must occasionally transport animals from one world to another. Large herd animals, such as ruthigs, can be notoriously stubborn, and sometimes a beast proves more dangerous than anticipated. In these situations, crews appreciate this stout electric prod capable of delivering a nonlethal shock that can stun or incapacitate even a surly wolliped. Electric prods see civilian use on Castrovel, Triaxus, and other worlds, where ranchers and farmers utilize them to keep large animals under control without causing permanent harm."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 44",
    "Name": "Polyclub, Advanced",
    "Category": "—",
    "Level": "10",
    "Price": "17,400",
    "Damage": "2d6 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, polymorphic",
    "type": "One-Handed Weapons",
    "desc": "Weaponized polyfluid applications are just beginning to be explored. Polyfluid’s plasticity has already been applied to some melee weapons, resulting in the polymorphic weapon special property."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Retractable Spike, Advanced",
    "Category": "—",
    "Level": "10",
    "Price": "18,400",
    "Damage": "3d4 P",
    "Critical": "—",
    "Bulk": "L",
    "Special": "conceal, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "These keen-edged spikes are installed in an armor upgrade slot rather than held, stored in a surface slot in armor or an android’s body until extended. You can extend the spike as a move action and retract the spike as a swift action. Such a spike usually extends from the elbow, foot, knee, or wrist, but a spike can be fitted into a helmet or an android’s head for use in headbutting or goring foes. Retractable spikes are widely available throughout the Pact Worlds, with the various models—tactical, advanced, elite, and paragon—having individual rarity based on the credit outlay to acquire a given model."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Sword Cane, Zero-Edge",
    "Category": "—",
    "Level": "10",
    "Price": "18,000",
    "Damage": "2d6 P",
    "Critical": "bleed 1d6",
    "Bulk": "L",
    "Special": "analog, operative",
    "type": "One-Handed Weapons",
    "desc": "This thin blade comes with a scabbard that makes it resemble a stylish cane. Sword canes are popular on Absalom Station, where similar nonweapon items have some popularity as fashionable affectations. A sword cane can incorporate one of the following at the standard price for that item: 20 feet of retractable cable line, a personal comm unit, or a spotlight. A successful Perception check (DC \u003d 15 + the weapon’s item level) is required to identify a sword cane as a weapon when it is sheathed."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dueling Sword, Ultrathin",
    "Category": "—",
    "Level": "11",
    "Price": "26,000",
    "Damage": "3d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "While dueling swords are crafted to be aesthetically pleasing and are often seen as a mark of rank or tradition, many warriors still train with them to deadly effect. The powered blades of both buzzblade and ripper dueling swords bring this danger into the modern era, while the molecular rift sword—though unpowered— uses a field of disrupted molecules along its blade to slice through nearly anything, and must be stored in a magnetic sheath that never actually touches the blade."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Sap, Heavy",
    "Category": "—",
    "Level": "11",
    "Price": "23,100",
    "Damage": "2d8 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, nonlethal, operative",
    "type": "One-Handed Weapons",
    "desc": "A weapon dating back to antiquity, a sap is shaped like a large, flat spoon with a heavily weighted end. Archaeological digs have verified that almost every society develops an analog to the sap. Modern versions are constructed from high-tech fiber and dense alloys. Although sap models are referred to as light, medium, and heavy by users, it’s the rare materials used in various models, and not their actual weight, that make them progressively better at bludgeoning victims into unconsciousness."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Spined Blade, Ripper",
    "Category": "—",
    "Level": "11",
    "Price": "24,500",
    "Damage": "2d10 P",
    "Critical": "injection DC +2",
    "Bulk": "L",
    "Special": "powered (capacity 20; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "Kasathas on their home world wielded spined blades to better poison foes. Replicas of these ancient weapons can be found in the Museum of Ancestral Technology on the Idari. Modern warriors use refined versions of the weapon that are effective at delivering poisons and similar substances through contemporary armor. You apply such substances to the blade per rules found on page 232 of the Core Rulebook. While the basic version of the spined blade is generally analog, more advanced buzzblade, ripper, gravity, and rivener models are powered weapons."
  },
  {
    "source": "Alien Archive pg. 31",
    "Name": "Bone Cestus, Imposing",
    "Category": "—",
    "Level": "12",
    "Price": "32,000",
    "Damage": "3d6 P",
    "Critical": "bleed 2d6",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Centuries ago, some kasathas crafted simple weapons out of crest-eaters’ bony protrusions; these formidable gauntlets were badges of honor for the mightiest kasathan warriors, and modern artisans have recreated that aesthetic in the form of bone cestuses, though now they are usually formed of state-of-the-art resin instead of crest-eater bone. Due to the flecks of minerals embedded within, bone cestuses are often warm to the touch, especially after they have been exposed to natural sunlight. These basic one-handed melee weapons are capable of punching through a foe’s defenses, sometimes puncturing vital organs in the process."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dagger, Ultrathin",
    "Category": "—",
    "Level": "12",
    "Price": "32,800",
    "Damage": "4d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "The thinness and lightness of daggers make them easy to carry or conceal. Ultrathin daggers have sharp, double-edged blades. Zero-edge daggers have blades—crafted with quantum technology—that are so fine, their edges blur. The blade of a molecular rift dagger looks translucent, as if it’s made of glass, and its vibrating particles allow the dagger to slice through almost any substance. Most daggers are available with fixed, folding, or retractable blades."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Shell Knuckles, Advanced",
    "Category": "—",
    "Level": "12",
    "Price": "32,500",
    "Damage": "4d8 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, shells (2; usage 2)",
    "type": "One-Handed Weapons",
    "desc": "This bulky glove fits over the user’s hand, with reinforced plates covering the knuckles. When the weapon connects with a target, the kinetic force fires scattergun shells into the target and deal impressive bludgeoning damage. Mercenaries favor these weapons for fighting at close quarters, and pirates sometimes use them to make their punches all the more dramatic. Shell knuckles are available in tactical, advanced, elite, and paragon models."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Battleglove, Nova",
    "Category": "—",
    "Level": "13",
    "Price": "52,500",
    "Damage": "3d10 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "powered (capacity 20; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "Battlegloves are popular, economical choices for mercenaries and guards. These durable nylon-web or para-aramid gloves hold a weighted plate over the wearer’s knuckles. You can hold other objects or weapons in a hand wearing a glove, but you can’t use the glove to make attacks while doing so."
  },
  {
    "source": "Alien Archive 4 pg. 51",
    "Name": "Ignurso Knuckles, Inferno",
    "Category": "—",
    "Level": "13",
    "Price": "50,250",
    "Damage": "4d6 F \u0026 S",
    "Critical": "Wound",
    "Bulk": "L",
    "Special": "Analog, penetrating",
    "type": "One-Handed Weapons",
    "desc": "Ignursos wield enough strength to punch through rock, and even after death, their claws ignite with momentary heat when struck against another surface. Weaponsmiths can stabilize the claws’ supernatural ignition and incorporate them into bladed gauntlets known as ignurso knuckles. These gauntlets’ ignurso-hide coverings protect the wielder from the claws’ heat, and high-end models allow the claws to retract into wrist sheathes."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 48",
    "Name": "Retractable Stinger, Elite",
    "Category": "—",
    "Level": "13",
    "Price": "51,000",
    "Damage": "2d10 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "This hollow stinger is installed in an armor upgrade slot. It is typically stored in a limb of the armor (though some androids use it to augment their headbutts). The stinger must be extended to be used as a weapon or to refill its injection reservoir. Extending or retracting the stinger is a move action."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Switchblade, Zero-Edge",
    "Category": "—",
    "Level": "13",
    "Price": "48,600",
    "Damage": "5d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, conceal, operative",
    "type": "One-Handed Weapons",
    "desc": "This blade looks much like a single-edged survival knife when opened, but the blade can be folded or collapsed to fit within the grip, making it easier to conceal. A switch on the knife means the blade can be folded or extended as a swift action, or as part of making an attack or full attack. Most weapon manufacturers that offer daggers also produce switchblades, which are made in the same models: tactical, ultrathin, zero-edge, and molecular rift."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Sword Cane, Molecular Rift",
    "Category": "—",
    "Level": "13",
    "Price": "50,900",
    "Damage": "3d8 P",
    "Critical": "bleed 1d8",
    "Bulk": "L",
    "Special": "analog, operative",
    "type": "One-Handed Weapons",
    "desc": "This thin blade comes with a scabbard that makes it resemble a stylish cane. Sword canes are popular on Absalom Station, where similar nonweapon items have some popularity as fashionable affectations. A sword cane can incorporate one of the following at the standard price for that item: 20 feet of retractable cable line, a personal comm unit, or a spotlight. A successful Perception check (DC \u003d 15 + the weapon’s item level) is required to identify a sword cane as a weapon when it is sheathed."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Stick, Ultra-pointed",
    "Category": "—",
    "Level": "13",
    "Price": "46,000",
    "Damage": "5d4 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, operative",
    "type": "One-Handed Weapons",
    "desc": "This weapon is a lightweight, handheld auto-injector device designed to quickly inject drugs, poison, and similar substance into a creature when pressed against its body. A syringe stick’s patented spring-loaded design features a sturdy needle able to punch through the toughest armor, chitin, and hide. Despite its deadliness, it is difficult to discern a syringe stick from a medicinal auto-injector."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dagger, Zero-Edge",
    "Category": "—",
    "Level": "14",
    "Price": "64,400",
    "Damage": "6d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "The thinness and lightness of daggers make them easy to carry or conceal. Ultrathin daggers have sharp, double-edged blades. Zero-edge daggers have blades—crafted with quantum technology—that are so fine, their edges blur. The blade of a molecular rift dagger looks translucent, as if it’s made of glass, and its vibrating particles allow the dagger to slice through almost any substance. Most daggers are available with fixed, folding, or retractable blades."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 44",
    "Name": "Electric Prod, Surge",
    "Category": "—",
    "Level": "14",
    "Price": "75,000",
    "Damage": "4d6 E",
    "Critical": "Stunned",
    "Bulk": "1",
    "Special": "Nonlethal, powered (capacity 100, usage 4), professional (farmer)",
    "type": "One-Handed Weapons",
    "desc": "Company personnel must occasionally transport animals from one world to another. Large herd animals, such as ruthigs, can be notoriously stubborn, and sometimes a beast proves more dangerous than anticipated. In these situations, crews appreciate this stout electric prod capable of delivering a nonlethal shock that can stun or incapacitate even a surly wolliped. Electric prods see civilian use on Castrovel, Triaxus, and other worlds, where ranchers and farmers utilize them to keep large animals under control without causing permanent harm."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Handaxe, Ultrathin",
    "Category": "—",
    "Level": "14",
    "Price": "66,800",
    "Damage": "6d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, thrown (30 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A balanced, wedge-shaped blade affixed to a lightweight haft, a handaxe can be wielded in melee or thrown. The flexibility of handaxes makes them a favorite of explorers of all types, and the basic handaxe is a common tool that can be used as a weapon. A tactical handaxe is made of a stronger, lightweight alloy, while the sintered handaxe uses a denser ceramic material for added heft and a much keener edge. An ultrathin handaxe has a blade so thin it can’t be seen clearly, while the molecular rift handaxe has a blade narrow enough to slice between molecules. Most handaxes have blade covers to prevent accidental injury to the wielder."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 44",
    "Name": "Polyclub, Elite",
    "Category": "—",
    "Level": "14",
    "Price": "65,000",
    "Damage": "4d6 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, polymorphic",
    "type": "One-Handed Weapons",
    "desc": "Weaponized polyfluid applications are just beginning to be explored. Polyfluid’s plasticity has already been applied to some melee weapons, resulting in the polymorphic weapon special property."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Spined Blade, Gravity",
    "Category": "—",
    "Level": "14",
    "Price": "62,400",
    "Damage": "4d10 P",
    "Critical": "injection DC +2",
    "Bulk": "L",
    "Special": "powered (capacity 40; usage 2)",
    "type": "One-Handed Weapons",
    "desc": "Kasathas on their home world wielded spined blades to better poison foes. Replicas of these ancient weapons can be found in the Museum of Ancestral Technology on the Idari. Modern warriors use refined versions of the weapon that are effective at delivering poisons and similar substances through contemporary armor. You apply such substances to the blade per rules found on page 232 of the Core Rulebook. While the basic version of the spined blade is generally analog, more advanced buzzblade, ripper, gravity, and rivener models are powered weapons."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dueling Sword, Ripper",
    "Category": "—",
    "Level": "15",
    "Price": "109,250",
    "Damage": "7d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "powered (capacity 20; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "While dueling swords are crafted to be aesthetically pleasing and are often seen as a mark of rank or tradition, many warriors still train with them to deadly effect. The powered blades of both buzzblade and ripper dueling swords bring this danger into the modern era, while the molecular rift sword—though unpowered— uses a field of disrupted molecules along its blade to slice through nearly anything, and must be stored in a magnetic sheath that never actually touches the blade."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Retractable Spike, Elite",
    "Category": "—",
    "Level": "15",
    "Price": "119,000",
    "Damage": "7d4 P",
    "Critical": "—",
    "Bulk": "L",
    "Special": "conceal, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "These keen-edged spikes are installed in an armor upgrade slot rather than held, stored in a surface slot in armor or an android’s body until extended. You can extend the spike as a move action and retract the spike as a swift action. Such a spike usually extends from the elbow, foot, knee, or wrist, but a spike can be fitted into a helmet or an android’s head for use in headbutting or goring foes. Retractable spikes are widely available throughout the Pact Worlds, with the various models—tactical, advanced, elite, and paragon—having individual rarity based on the credit outlay to acquire a given model."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Peacemaker",
    "Category": "—",
    "Level": "16",
    "Price": "185,300",
    "Damage": "6d6 B",
    "Critical": "knockdown",
    "Bulk": "L",
    "Special": "operative, powered (capacity 20; usage 2), stun",
    "type": "One-Handed Weapons",
    "desc": "This more advanced combat baton, known as a peacemaker, is a light metal rod that discharges a pulse that can be strong enough to knock a target to the ground."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Shell Knuckles, Elite",
    "Category": "—",
    "Level": "16",
    "Price": "151,000",
    "Damage": "10d8 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, shells (3; usage 3)",
    "type": "One-Handed Weapons",
    "desc": "This bulky glove fits over the user’s hand, with reinforced plates covering the knuckles. When the weapon connects with a target, the kinetic force fires scattergun shells into the target and deal impressive bludgeoning damage. Mercenaries favor these weapons for fighting at close quarters, and pirates sometimes use them to make their punches all the more dramatic. Shell knuckles are available in tactical, advanced, elite, and paragon models."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Sword Cane, Dimensional Slice",
    "Category": "—",
    "Level": "16",
    "Price": "160,000",
    "Damage": "5d8 P",
    "Critical": "bleed 2d6",
    "Bulk": "L",
    "Special": "analog, operative",
    "type": "One-Handed Weapons",
    "desc": "This thin blade comes with a scabbard that makes it resemble a stylish cane. Sword canes are popular on Absalom Station, where similar nonweapon items have some popularity as fashionable affectations. A sword cane can incorporate one of the following at the standard price for that item: 20 feet of retractable cable line, a personal comm unit, or a spotlight. A successful Perception check (DC \u003d 15 + the weapon’s item level) is required to identify a sword cane as a weapon when it is sheathed."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Battleglove, Gravity",
    "Category": "—",
    "Level": "17",
    "Price": "214,850",
    "Damage": "5d10 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "powered (capacity 20; usage 1)",
    "type": "One-Handed Weapons",
    "desc": "Battlegloves are popular, economical choices for mercenaries and guards. These durable nylon-web or para-aramid gloves hold a weighted plate over the wearer’s knuckles. You can hold other objects or weapons in a hand wearing a glove, but you can’t use the glove to make attacks while doing so."
  },
  {
    "source": "Alien Archive pg. 31",
    "Name": "Bone Cestus, Severe",
    "Category": "—",
    "Level": "17",
    "Price": "230,000",
    "Damage": "8d6 P",
    "Critical": "bleed 5d6",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Centuries ago, some kasathas crafted simple weapons out of crest-eaters’ bony protrusions; these formidable gauntlets were badges of honor for the mightiest kasathan warriors, and modern artisans have recreated that aesthetic in the form of bone cestuses, though now they are usually formed of state-of-the-art resin instead of crest-eater bone. Due to the flecks of minerals embedded within, bone cestuses are often warm to the touch, especially after they have been exposed to natural sunlight. These basic one-handed melee weapons are capable of punching through a foe’s defenses, sometimes puncturing vital organs in the process."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dagger, Molecular Rift",
    "Category": "—",
    "Level": "17",
    "Price": "275,000",
    "Damage": "10d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "The thinness and lightness of daggers make them easy to carry or conceal. Ultrathin daggers have sharp, double-edged blades. Zero-edge daggers have blades—crafted with quantum technology—that are so fine, their edges blur. The blade of a molecular rift dagger looks translucent, as if it’s made of glass, and its vibrating particles allow the dagger to slice through almost any substance. Most daggers are available with fixed, folding, or retractable blades."
  },
  {
    "source": "Alien Archive 2 pg. 23",
    "Name": "Dueling Sword (Corpse Fleet), Admiral",
    "Category": "—",
    "Level": "17",
    "Price": "255,150",
    "Damage": "8d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "Members of the Corpse Fleet earn their dueling swords through tallied kill counts, while officers receive their blades as part of the transition to the rank of commander. Corpse Fleet admirals’ blades are some of the keenest weapons in the known galaxy. Although the weapons are mainly used by the Corpse Fleet, the undead navy leaks some versions into the markets on Eox."
  },
  {
    "source": "Alien Archive 4 pg. 51",
    "Name": "Ignurso Knuckles, Solar Flare",
    "Category": "—",
    "Level": "17",
    "Price": "262,000",
    "Damage": "9d6 F \u0026 S",
    "Critical": "Severe wound",
    "Bulk": "L",
    "Special": "Analog, penetrating",
    "type": "One-Handed Weapons",
    "desc": "Ignursos wield enough strength to punch through rock, and even after death, their claws ignite with momentary heat when struck against another surface. Weaponsmiths can stabilize the claws’ supernatural ignition and incorporate them into bladed gauntlets known as ignurso knuckles. These gauntlets’ ignurso-hide coverings protect the wielder from the claws’ heat, and high-end models allow the claws to retract into wrist sheathes."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 48",
    "Name": "Retractable Stinger, Paragon",
    "Category": "—",
    "Level": "17",
    "Price": "268,000",
    "Damage": "4d10 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "This hollow stinger is installed in an armor upgrade slot. It is typically stored in a limb of the armor (though some androids use it to augment their headbutts). The stinger must be extended to be used as a weapon or to refill its injection reservoir. Extending or retracting the stinger is a move action."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Stick, Supreme-pointed",
    "Category": "—",
    "Level": "17",
    "Price": "225,000",
    "Damage": "10d4 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Conceal, injection, operative",
    "type": "One-Handed Weapons",
    "desc": "This weapon is a lightweight, handheld auto-injector device designed to quickly inject drugs, poison, and similar substance into a creature when pressed against its body. A syringe stick’s patented spring-loaded design features a sturdy needle able to punch through the toughest armor, chitin, and hide. Despite its deadliness, it is difficult to discern a syringe stick from a medicinal auto-injector."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Dueling Sword, Molecular Rift",
    "Category": "—",
    "Level": "18",
    "Price": "331,200",
    "Damage": "10d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog",
    "type": "One-Handed Weapons",
    "desc": "While dueling swords are crafted to be aesthetically pleasing and are often seen as a mark of rank or tradition, many warriors still train with them to deadly effect. The powered blades of both buzzblade and ripper dueling swords bring this danger into the modern era, while the molecular rift sword—though unpowered— uses a field of disrupted molecules along its blade to slice through nearly anything, and must be stored in a magnetic sheath that never actually touches the blade."
  },
  {
    "source": "Starfinder #34: We’re No Heroes pg. 44",
    "Name": "Electric Prod, Tempest",
    "Category": "—",
    "Level": "18",
    "Price": "385,000",
    "Damage": "8d6 E",
    "Critical": "Stunned",
    "Bulk": "1",
    "Special": "Nonlethal, powered (capacity 100, usage 4), professional (farmer)",
    "type": "One-Handed Weapons",
    "desc": "Company personnel must occasionally transport animals from one world to another. Large herd animals, such as ruthigs, can be notoriously stubborn, and sometimes a beast proves more dangerous than anticipated. In these situations, crews appreciate this stout electric prod capable of delivering a nonlethal shock that can stun or incapacitate even a surly wolliped. Electric prods see civilian use on Castrovel, Triaxus, and other worlds, where ranchers and farmers utilize them to keep large animals under control without causing permanent harm."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 44",
    "Name": "Polyclub, Paragon",
    "Category": "—",
    "Level": "18",
    "Price": "345,000",
    "Damage": "8d6 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Analog, operative, polymorphic",
    "type": "One-Handed Weapons",
    "desc": "Weaponized polyfluid applications are just beginning to be explored. Polyfluid’s plasticity has already been applied to some melee weapons, resulting in the polymorphic weapon special property."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Spined Blade, Rivener",
    "Category": "—",
    "Level": "18",
    "Price": "325,000",
    "Damage": "8d10 P",
    "Critical": "injection DC +2",
    "Bulk": "L",
    "Special": "powered (capacity 40; usage 2)",
    "type": "One-Handed Weapons",
    "desc": "Kasathas on their home world wielded spined blades to better poison foes. Replicas of these ancient weapons can be found in the Museum of Ancestral Technology on the Idari. Modern warriors use refined versions of the weapon that are effective at delivering poisons and similar substances through contemporary armor. You apply such substances to the blade per rules found on page 232 of the Core Rulebook. While the basic version of the spined blade is generally analog, more advanced buzzblade, ripper, gravity, and rivener models are powered weapons."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Switchblade, Molecular Rift",
    "Category": "—",
    "Level": "18",
    "Price": "354,000",
    "Damage": "11d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, conceal, operative",
    "type": "One-Handed Weapons",
    "desc": "This blade looks much like a single-edged survival knife when opened, but the blade can be folded or collapsed to fit within the grip, making it easier to conceal. A switch on the knife means the blade can be folded or extended as a swift action, or as part of making an attack or full attack. Most weapon manufacturers that offer daggers also produce switchblades, which are made in the same models: tactical, ultrathin, zero-edge, and molecular rift."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Baton, Advanced",
    "Category": "—",
    "Level": "19",
    "Price": "540,000",
    "Damage": "8d6 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "Operative, powered (capacity 20, usage 1), thrown (20 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A baton is a thin, solid metal shaft, usually with a textured rubber grip. A tactical baton can be used to inflict precise bludgeoning blows. An advanced baton, used by elite mercenary and security companies, often has an additional shaft, as well as a weighted end that can be powered to connect with substantially more force than a tactical baton."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Handaxe, Molecular Rift",
    "Category": "—",
    "Level": "19",
    "Price": "502,000",
    "Damage": "12d6 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, thrown (40 ft.)",
    "type": "One-Handed Weapons",
    "desc": "A balanced, wedge-shaped blade affixed to a lightweight haft, a handaxe can be wielded in melee or thrown. The flexibility of handaxes makes them a favorite of explorers of all types, and the basic handaxe is a common tool that can be used as a weapon. A tactical handaxe is made of a stronger, lightweight alloy, while the sintered handaxe uses a denser ceramic material for added heft and a much keener edge. An ultrathin handaxe has a blade so thin it can’t be seen clearly, while the molecular rift handaxe has a blade narrow enough to slice between molecules. Most handaxes have blade covers to prevent accidental injury to the wielder."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Retractable Spike, Paragon",
    "Category": "—",
    "Level": "20",
    "Price": "895,000",
    "Damage": "6d10 P",
    "Critical": "—",
    "Bulk": "L",
    "Special": "conceal, integrated (1 slot), operative",
    "type": "One-Handed Weapons",
    "desc": "These keen-edged spikes are installed in an armor upgrade slot rather than held, stored in a surface slot in armor or an android’s body until extended. You can extend the spike as a move action and retract the spike as a swift action. Such a spike usually extends from the elbow, foot, knee, or wrist, but a spike can be fitted into a helmet or an android’s head for use in headbutting or goring foes. Retractable spikes are widely available throughout the Pact Worlds, with the various models—tactical, advanced, elite, and paragon—having individual rarity based on the credit outlay to acquire a given model."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Shell Knuckles, Paragon",
    "Category": "—",
    "Level": "20",
    "Price": "525,000",
    "Damage": "14d8 B",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, shells (4; usage 4)",
    "type": "One-Handed Weapons",
    "desc": "This bulky glove fits over the user’s hand, with reinforced plates covering the knuckles. When the weapon connects with a target, the kinetic force fires scattergun shells into the target and deal impressive bludgeoning damage. Mercenaries favor these weapons for fighting at close quarters, and pirates sometimes use them to make their punches all the more dramatic. Shell knuckles are available in tactical, advanced, elite, and paragon models."
  },
  {
    "source": "SFS Scenario #1-09: Live Exploration Extreme! pg. 26",
    "Name": "Red Star Plasma Kukri",
    "Category": "Plasma",
    "Level": "4",
    "Price": "2,450",
    "Damage": "1d4 E \u0026 F",
    "Critical": "wound",
    "Bulk": "L",
    "Special": "operative, powered (capacity 20, usage 1)",
    "type": "One-Handed Weapons"
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Spear, Tactical",
    "Category": "—",
    "Level": "1",
    "Price": "375",
    "Damage": "1d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, block, thrown (20 ft.)",
    "type": "Two-Handed Weapons",
    "desc": "Spears come in many varieties. Buzzblade spears vibrate at high frequency. Zero-edge spears employ quantum manufacturing to hone an edge so fine that it seems indistinct. The gravity spear uses a tiny gravity field generator to accelerate the weapon at the moment of impact."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Staff, Battle",
    "Category": "—",
    "Level": "1",
    "Price": "80",
    "Damage": "1d4 B",
    "Critical": "knockdown",
    "Bulk": "1",
    "Special": "analog, block",
    "type": "Two-Handed Weapons",
    "desc": "Staves are long and flexible, weighted on the end to provide extra striking power. Most staves are made from aluminum or fiberglass, though some are still made from wood."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Spear, Tactical",
    "Category": "—",
    "Level": "1",
    "Price": "250",
    "Damage": "1d6 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Injection",
    "type": "Two-Handed Weapons",
    "desc": "At a glance, this weapon resembles a massive medicinal syringe that has been affixed to a pole roughly as long as the wielder’s body. A tank found at the butt of the spear allows substances to be poured into the weapon, and a spring-loaded mechanism automatically injects foes upon striking a successful blow. The exact origins of this dastardly weapon are unknown, though both the grays and a notorious race of subterranean creatures from Golarion are claimed to have designed this weapon for torturous experimentation."
  },
  {
    "source": "Starfinder Armory pg. 54",
    "Name": "Warclub",
    "Category": "—",
    "Level": "2",
    "Price": "450",
    "Damage": "1d10 B",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons"
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Garrote, Wire",
    "Category": "—",
    "Level": "2",
    "Price": "900",
    "Damage": "1d2 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, conceal, grapple, operative, throttle",
    "type": "Two-Handed Weapons",
    "desc": "A pair of slim handles connected by flexible cable made of a strong alloy, the garrote is a weapon strongly associated with assassination. That’s no accident, as the weapon’s primary use is to silently strangle creatures. However, a garrote can also be used to ensnare appendages. The wire garrote is the simplest version, while the nanofiber, microfilament, and monowire models use increasingly fine cables to deal substantially more damage. For instance, the monowire version has a cable as thin as a single complex molecule, which closes into the handles when the weapon isn’t in use. This construction results in a nearly invisible cable with an extreme edge."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Greataxe, Tactical",
    "Category": "—",
    "Level": "3",
    "Price": "1,100",
    "Damage": "1d12 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "No one can argue against the damage potential of a greataxe. Half-orcs who take an interest in fragmentary records from lost Golarion embrace the greataxe as a cultural symbol. Tactical greataxes are the most common, but sintered models are made of dense ceramic and designed to increase the axe’s effectiveness against modern gear. It’s hard to tell ultrathin greataxes from molecular rift models at a glance, but one’s edge is merely blurry while the other’s is actually translucent."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Lance, Tactical",
    "Category": "—",
    "Level": "3",
    "Price": "1,450",
    "Damage": "1d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, reach",
    "type": "Two-Handed Weapons",
    "desc": "A lance is a long, heavy spear designed for use while riding a mount. While mounted or riding a cycle, you can wield a lance with one hand. This weapon is common across the Pact Worlds. Traditionally used by shotalashu warriors riding saurian mounts in the jungles of Castrovel and bonded ryphorian and dragonkin partners of Triaxus, lances are also known to have been common weapons on lost Golarion. Modern wielders use lances while mounted or driving open vehicles, such as cycle-riding raiders like the Vercite Rustrunners. Tactical lances are straightforward and widely available, while advanced lances are made of strong composites and have fine points to deal more damage. Elite lances have superfine points, and each has a particularly dense core for a more powerful strike. Paragon lances have been entirely redesigned using dense, flexible materials and an ultrathin point to achieve incomparable performance."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Chitinblade, Tactical",
    "Category": "—",
    "Level": "4",
    "Price": "1,890",
    "Damage": "1d6 S",
    "Critical": "bleed 1d6",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "The serrated, sweeping blade of a chitinblade is based on technology recovered from encounters with the Swarm. The source material can come from a natural part of a creature’s body, but the final weapon is detached and wielded with two hands. A tactical chitinblade is modeled on an animal counterpart with little modification, but high-tech materials and manufacturing improve on nature in the microserrated, nanoserrated, and ultraserrated models."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Puzzleblade, Conviction",
    "Category": "—",
    "Level": "4",
    "Price": "2,100",
    "Damage": "1d6 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "breakdown",
    "type": "Two-Handed Weapons",
    "desc": "The kasathan puzzleblade is a two-handed sword that can be disassembled into pieces for ease of storage and transport, although reassembling the blade for use takes some time. Many who carry a puzzleblade see the assembly time as a reminder of virtues to uphold, so the various types of puzzleblades take their names from kasathan values of conviction, dedication, moderation, and tradition. Some ysoki, on the other hand, have taken a liking to the weapon due to the fact that the disassembled pieces can be stored in ysoki cheek pouches."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Living Staff, Tactical",
    "Category": "—",
    "Level": "5",
    "Price": "3,300",
    "Damage": "1d6 B",
    "Critical": "bind",
    "Bulk": "1",
    "Special": "block, living, powered (capacity 20; usage 1), reach",
    "type": "Two-Handed Weapons",
    "desc": "Xenodruids developed the living staff, a gnarled and vineswathed pole, to use as a weapon and a sign of their allegiance. The staff itself can extend, and the vines can wrap around and entangle a target. Xenodruids on sentinel duty favor the tactical and advanced models. The elite and paragon models are more common among highly skilled warrior-mystics undertaking assault missions."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Maul, Tactical",
    "Category": "—",
    "Level": "5",
    "Price": "2,750",
    "Damage": "1d8 B",
    "Critical": "knockdown",
    "Bulk": "1",
    "Special": "analog, unwieldy",
    "type": "Two-Handed Weapons",
    "desc": "Outsized hammers, mauls are valued for their intimidation factor and effectiveness in battle. A tactical maul is as much an instrument for hammering posts into the ground as a weapon. Advanced mauls include dense, heavy cores to deliver a more forceful blow. Elite mauls and paragon mauls are designed and manufactured more for war than labor, although the weapons can be used as tools."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Greataxe, Sintered",
    "Category": "—",
    "Level": "6",
    "Price": "4,150",
    "Damage": "3d6 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "No one can argue against the damage potential of a greataxe. Half-orcs who take an interest in fragmentary records from lost Golarion embrace the greataxe as a cultural symbol. Tactical greataxes are the most common, but sintered models are made of dense ceramic and designed to increase the axe’s effectiveness against modern gear. It’s hard to tell ultrathin greataxes from molecular rift models at a glance, but one’s edge is merely blurry while the other’s is actually translucent."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Scythe, Tactical",
    "Category": "—",
    "Level": "6",
    "Price": "3,900",
    "Damage": "1d8 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, trip",
    "type": "Two-Handed Weapons",
    "desc": "Few weapons send a more distinctive and imposing message than a scythe, given its longstanding and transcultural connotations of harvest and death. A far cry from the farming tools of ages past, scythes range from tactical to sintered to ultrathin models. Followers of Urgathoa make up a significant portion of the customer base for this weapon."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Spear, Advanced",
    "Category": "—",
    "Level": "6",
    "Price": "4,250",
    "Damage": "1d8 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Injection",
    "type": "Two-Handed Weapons",
    "desc": "At a glance, this weapon resembles a massive medicinal syringe that has been affixed to a pole roughly as long as the wielder’s body. A tank found at the butt of the spear allows substances to be poured into the weapon, and a spring-loaded mechanism automatically injects foes upon striking a successful blow. The exact origins of this dastardly weapon are unknown, though both the grays and a notorious race of subterranean creatures from Golarion are claimed to have designed this weapon for torturous experimentation."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Garrote, Nanofiber",
    "Category": "—",
    "Level": "7",
    "Price": "6,700",
    "Damage": "2d4 S",
    "Critical": "—",
    "Bulk": "L",
    "Special": "analog, conceal, grapple, operative, throttle",
    "type": "Two-Handed Weapons",
    "desc": "A pair of slim handles connected by flexible cable made of a strong alloy, the garrote is a weapon strongly associated with assassination. That’s no accident, as the weapon’s primary use is to silently strangle creatures. However, a garrote can also be used to ensnare appendages. The wire garrote is the simplest version, while the nanofiber, microfilament, and monowire models use increasingly fine cables to deal substantially more damage. For instance, the monowire version has a cable as thin as a single complex molecule, which closes into the handles when the weapon isn’t in use. This construction results in a nearly invisible cable with an extreme edge."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Staff, Carbon",
    "Category": "—",
    "Level": "7",
    "Price": "6,150",
    "Damage": "1d8 B",
    "Critical": "knockdown",
    "Bulk": "1",
    "Special": "analog, block",
    "type": "Two-Handed Weapons",
    "desc": "Staves are long and flexible, weighted on the end to provide extra striking power. Most staves are made from aluminum or fiberglass, though some are still made from wood."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Lance, Advanced",
    "Category": "—",
    "Level": "8",
    "Price": "9,400",
    "Damage": "2d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, reach",
    "type": "Two-Handed Weapons",
    "desc": "A lance is a long, heavy spear designed for use while riding a mount. While mounted or riding a cycle, you can wield a lance with one hand. This weapon is common across the Pact Worlds. Traditionally used by shotalashu warriors riding saurian mounts in the jungles of Castrovel and bonded ryphorian and dragonkin partners of Triaxus, lances are also known to have been common weapons on lost Golarion. Modern wielders use lances while mounted or driving open vehicles, such as cycle-riding raiders like the Vercite Rustrunners. Tactical lances are straightforward and widely available, while advanced lances are made of strong composites and have fine points to deal more damage. Elite lances have superfine points, and each has a particularly dense core for a more powerful strike. Paragon lances have been entirely redesigned using dense, flexible materials and an ultrathin point to achieve incomparable performance."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Spear, Sentinel",
    "Category": "—",
    "Level": "8",
    "Price": "10,000",
    "Damage": "2d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, block, thrown (20 ft.)",
    "type": "Two-Handed Weapons",
    "desc": "Spears come in many varieties. Buzzblade spears vibrate at high frequency. Zero-edge spears employ quantum manufacturing to hone an edge so fine that it seems indistinct. The gravity spear uses a tiny gravity field generator to accelerate the weapon at the moment of impact."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Chitinblade, Microserrated",
    "Category": "—",
    "Level": "9",
    "Price": "12,400",
    "Damage": "4d4 S",
    "Critical": "bleed 2d4",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "The serrated, sweeping blade of a chitinblade is based on technology recovered from encounters with the Swarm. The source material can come from a natural part of a creature’s body, but the final weapon is detached and wielded with two hands. A tactical chitinblade is modeled on an animal counterpart with little modification, but high-tech materials and manufacturing improve on nature in the microserrated, nanoserrated, and ultraserrated models."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Puzzleblade, Dedication",
    "Category": "—",
    "Level": "9",
    "Price": "13,700",
    "Damage": "3d6 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "breakdown",
    "type": "Two-Handed Weapons",
    "desc": "The kasathan puzzleblade is a two-handed sword that can be disassembled into pieces for ease of storage and transport, although reassembling the blade for use takes some time. Many who carry a puzzleblade see the assembly time as a reminder of virtues to uphold, so the various types of puzzleblades take their names from kasathan values of conviction, dedication, moderation, and tradition. Some ysoki, on the other hand, have taken a liking to the weapon due to the fact that the disassembled pieces can be stored in ysoki cheek pouches."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Greataxe, Ultrathin",
    "Category": "—",
    "Level": "10",
    "Price": "18,100",
    "Damage": "2d12 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "No one can argue against the damage potential of a greataxe. Half-orcs who take an interest in fragmentary records from lost Golarion embrace the greataxe as a cultural symbol. Tactical greataxes are the most common, but sintered models are made of dense ceramic and designed to increase the axe’s effectiveness against modern gear. It’s hard to tell ultrathin greataxes from molecular rift models at a glance, but one’s edge is merely blurry while the other’s is actually translucent."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Maul, Advanced",
    "Category": "—",
    "Level": "10",
    "Price": "17,200",
    "Damage": "3d8 B",
    "Critical": "knockdown",
    "Bulk": "1",
    "Special": "analog, unwieldy",
    "type": "Two-Handed Weapons",
    "desc": "Outsized hammers, mauls are valued for their intimidation factor and effectiveness in battle. A tactical maul is as much an instrument for hammering posts into the ground as a weapon. Advanced mauls include dense, heavy cores to deliver a more forceful blow. Elite mauls and paragon mauls are designed and manufactured more for war than labor, although the weapons can be used as tools."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Scythe, Sintered",
    "Category": "—",
    "Level": "11",
    "Price": "23,200",
    "Damage": "4d6 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, trip",
    "type": "Two-Handed Weapons",
    "desc": "Few weapons send a more distinctive and imposing message than a scythe, given its longstanding and transcultural connotations of harvest and death. A far cry from the farming tools of ages past, scythes range from tactical to sintered to ultrathin models. Followers of Urgathoa make up a significant portion of the customer base for this weapon."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Spear, Buzzblade",
    "Category": "—",
    "Level": "11",
    "Price": "22,650",
    "Damage": "3d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "block, powered (capacity 40; usage 2), thrown (20 ft.)",
    "type": "Two-Handed Weapons",
    "desc": "Spears come in many varieties. Buzzblade spears vibrate at high frequency. Zero-edge spears employ quantum manufacturing to hone an edge so fine that it seems indistinct. The gravity spear uses a tiny gravity field generator to accelerate the weapon at the moment of impact."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Spear, Elite",
    "Category": "—",
    "Level": "11",
    "Price": "25,000",
    "Damage": "3d10 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Injection",
    "type": "Two-Handed Weapons",
    "desc": "At a glance, this weapon resembles a massive medicinal syringe that has been affixed to a pole roughly as long as the wielder’s body. A tank found at the butt of the spear allows substances to be poured into the weapon, and a spring-loaded mechanism automatically injects foes upon striking a successful blow. The exact origins of this dastardly weapon are unknown, though both the grays and a notorious race of subterranean creatures from Golarion are claimed to have designed this weapon for torturous experimentation."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Garrote, Microfilament",
    "Category": "—",
    "Level": "12",
    "Price": "34,800",
    "Damage": "4d4 S",
    "Critical": "bleed 1d6",
    "Bulk": "L",
    "Special": "analog, conceal, grapple, operative, throttle",
    "type": "Two-Handed Weapons",
    "desc": "A pair of slim handles connected by flexible cable made of a strong alloy, the garrote is a weapon strongly associated with assassination. That’s no accident, as the weapon’s primary use is to silently strangle creatures. However, a garrote can also be used to ensnare appendages. The wire garrote is the simplest version, while the nanofiber, microfilament, and monowire models use increasingly fine cables to deal substantially more damage. For instance, the monowire version has a cable as thin as a single complex molecule, which closes into the handles when the weapon isn’t in use. This construction results in a nearly invisible cable with an extreme edge."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Living Staff, Advanced",
    "Category": "—",
    "Level": "12",
    "Price": "39,500",
    "Damage": "4d6 B",
    "Critical": "bind",
    "Bulk": "1",
    "Special": "block, living, powered (capacity 20; usage 1), reach",
    "type": "Two-Handed Weapons",
    "desc": "Xenodruids developed the living staff, a gnarled and vineswathed pole, to use as a weapon and a sign of their allegiance. The staff itself can extend, and the vines can wrap around and entangle a target. Xenodruids on sentinel duty favor the tactical and advanced models. The elite and paragon models are more common among highly skilled warrior-mystics undertaking assault missions."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Chitinblade, Nanoserrated",
    "Category": "—",
    "Level": "13",
    "Price": "46,400",
    "Damage": "4d8 S",
    "Critical": "bleed 2d8",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "The serrated, sweeping blade of a chitinblade is based on technology recovered from encounters with the Swarm. The source material can come from a natural part of a creature’s body, but the final weapon is detached and wielded with two hands. A tactical chitinblade is modeled on an animal counterpart with little modification, but high-tech materials and manufacturing improve on nature in the microserrated, nanoserrated, and ultraserrated models."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Lance, Elite",
    "Category": "—",
    "Level": "13",
    "Price": "50,800",
    "Damage": "5d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, reach",
    "type": "Two-Handed Weapons",
    "desc": "A lance is a long, heavy spear designed for use while riding a mount. While mounted or riding a cycle, you can wield a lance with one hand. This weapon is common across the Pact Worlds. Traditionally used by shotalashu warriors riding saurian mounts in the jungles of Castrovel and bonded ryphorian and dragonkin partners of Triaxus, lances are also known to have been common weapons on lost Golarion. Modern wielders use lances while mounted or driving open vehicles, such as cycle-riding raiders like the Vercite Rustrunners. Tactical lances are straightforward and widely available, while advanced lances are made of strong composites and have fine points to deal more damage. Elite lances have superfine points, and each has a particularly dense core for a more powerful strike. Paragon lances have been entirely redesigned using dense, flexible materials and an ultrathin point to achieve incomparable performance."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Greataxe, Molecular Rift",
    "Category": "—",
    "Level": "14",
    "Price": "69,800",
    "Damage": "4d12 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "No one can argue against the damage potential of a greataxe. Half-orcs who take an interest in fragmentary records from lost Golarion embrace the greataxe as a cultural symbol. Tactical greataxes are the most common, but sintered models are made of dense ceramic and designed to increase the axe’s effectiveness against modern gear. It’s hard to tell ultrathin greataxes from molecular rift models at a glance, but one’s edge is merely blurry while the other’s is actually translucent."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Puzzleblade, Moderation",
    "Category": "—",
    "Level": "14",
    "Price": "77,400",
    "Damage": "7d6 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "breakdown",
    "type": "Two-Handed Weapons",
    "desc": "The kasathan puzzleblade is a two-handed sword that can be disassembled into pieces for ease of storage and transport, although reassembling the blade for use takes some time. Many who carry a puzzleblade see the assembly time as a reminder of virtues to uphold, so the various types of puzzleblades take their names from kasathan values of conviction, dedication, moderation, and tradition. Some ysoki, on the other hand, have taken a liking to the weapon due to the fact that the disassembled pieces can be stored in ysoki cheek pouches."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Maul, Elite",
    "Category": "—",
    "Level": "15",
    "Price": "95,000",
    "Damage": "3d8 B",
    "Critical": "knockdown",
    "Bulk": "1",
    "Special": "analog, unwieldy",
    "type": "Two-Handed Weapons",
    "desc": "Outsized hammers, mauls are valued for their intimidation factor and effectiveness in battle. A tactical maul is as much an instrument for hammering posts into the ground as a weapon. Advanced mauls include dense, heavy cores to deliver a more forceful blow. Elite mauls and paragon mauls are designed and manufactured more for war than labor, although the weapons can be used as tools."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Spear, Zero-Edge",
    "Category": "—",
    "Level": "15",
    "Price": "107,350",
    "Damage": "7d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, block, thrown (20 ft.)",
    "type": "Two-Handed Weapons",
    "desc": "Spears come in many varieties. Buzzblade spears vibrate at high frequency. Zero-edge spears employ quantum manufacturing to hone an edge so fine that it seems indistinct. The gravity spear uses a tiny gravity field generator to accelerate the weapon at the moment of impact."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Living Staff, Elite",
    "Category": "—",
    "Level": "16",
    "Price": "181,000",
    "Damage": "12d6 B",
    "Critical": "bind",
    "Bulk": "1",
    "Special": "block, living, powered (capacity 20; usage 1), reach",
    "type": "Two-Handed Weapons",
    "desc": "Xenodruids developed the living staff, a gnarled and vineswathed pole, to use as a weapon and a sign of their allegiance. The staff itself can extend, and the vines can wrap around and entangle a target. Xenodruids on sentinel duty favor the tactical and advanced models. The elite and paragon models are more common among highly skilled warrior-mystics undertaking assault missions."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Scythe, Ultrathin",
    "Category": "—",
    "Level": "16",
    "Price": "160,000",
    "Damage": "7d8 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, trip",
    "type": "Two-Handed Weapons",
    "desc": "Few weapons send a more distinctive and imposing message than a scythe, given its longstanding and transcultural connotations of harvest and death. A far cry from the farming tools of ages past, scythes range from tactical to sintered to ultrathin models. Followers of Urgathoa make up a significant portion of the customer base for this weapon."
  },
  {
    "source": "Character Operations Manual pg. 122",
    "Name": "Syringe Spear, Paragon",
    "Category": "—",
    "Level": "16",
    "Price": "165,000",
    "Damage": "9d8 P",
    "Critical": "Injection DC +2",
    "Bulk": "L",
    "Special": "Injection",
    "type": "Two-Handed Weapons",
    "desc": "At a glance, this weapon resembles a massive medicinal syringe that has been affixed to a pole roughly as long as the wielder’s body. A tank found at the butt of the spear allows substances to be poured into the weapon, and a spring-loaded mechanism automatically injects foes upon striking a successful blow. The exact origins of this dastardly weapon are unknown, though both the grays and a notorious race of subterranean creatures from Golarion are claimed to have designed this weapon for torturous experimentation."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Chitinblade, Ultraserrated",
    "Category": "—",
    "Level": "17",
    "Price": "219,000",
    "Damage": "8d8 S",
    "Critical": "bleed 3d8",
    "Bulk": "1",
    "Special": "analog",
    "type": "Two-Handed Weapons",
    "desc": "The serrated, sweeping blade of a chitinblade is based on technology recovered from encounters with the Swarm. The source material can come from a natural part of a creature’s body, but the final weapon is detached and wielded with two hands. A tactical chitinblade is modeled on an animal counterpart with little modification, but high-tech materials and manufacturing improve on nature in the microserrated, nanoserrated, and ultraserrated models."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Garrote, Monowire",
    "Category": "—",
    "Level": "17",
    "Price": "225,000",
    "Damage": "5d8 S",
    "Critical": "bleed 2d6",
    "Bulk": "L",
    "Special": "analog, conceal, grapple, operative, throttle",
    "type": "Two-Handed Weapons",
    "desc": "A pair of slim handles connected by flexible cable made of a strong alloy, the garrote is a weapon strongly associated with assassination. That’s no accident, as the weapon’s primary use is to silently strangle creatures. However, a garrote can also be used to ensnare appendages. The wire garrote is the simplest version, while the nanofiber, microfilament, and monowire models use increasingly fine cables to deal substantially more damage. For instance, the monowire version has a cable as thin as a single complex molecule, which closes into the handles when the weapon isn’t in use. This construction results in a nearly invisible cable with an extreme edge."
  },
  {
    "source": "Starfinder Armory pg. 52",
    "Name": "Lance, Paragon",
    "Category": "—",
    "Level": "18",
    "Price": "365,000",
    "Damage": "11d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "analog, reach",
    "type": "Two-Handed Weapons",
    "desc": "A lance is a long, heavy spear designed for use while riding a mount. While mounted or riding a cycle, you can wield a lance with one hand. This weapon is common across the Pact Worlds. Traditionally used by shotalashu warriors riding saurian mounts in the jungles of Castrovel and bonded ryphorian and dragonkin partners of Triaxus, lances are also known to have been common weapons on lost Golarion. Modern wielders use lances while mounted or driving open vehicles, such as cycle-riding raiders like the Vercite Rustrunners. Tactical lances are straightforward and widely available, while advanced lances are made of strong composites and have fine points to deal more damage. Elite lances have superfine points, and each has a particularly dense core for a more powerful strike. Paragon lances have been entirely redesigned using dense, flexible materials and an ultrathin point to achieve incomparable performance."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Staff, Hardlight",
    "Category": "—",
    "Level": "18",
    "Price": "320,800",
    "Damage": "8d8 B",
    "Critical": "knockdown",
    "Bulk": "1",
    "Special": "analog, block",
    "type": "Two-Handed Weapons",
    "desc": "Staves are long and flexible, weighted on the end to provide extra striking power. Most staves are made from aluminum or fiberglass, though some are still made from wood."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Puzzleblade, Tradition",
    "Category": "—",
    "Level": "19",
    "Price": "605,000",
    "Damage": "14d6 S",
    "Critical": "—",
    "Bulk": "1",
    "Special": "breakdown",
    "type": "Two-Handed Weapons",
    "desc": "The kasathan puzzleblade is a two-handed sword that can be disassembled into pieces for ease of storage and transport, although reassembling the blade for use takes some time. Many who carry a puzzleblade see the assembly time as a reminder of virtues to uphold, so the various types of puzzleblades take their names from kasathan values of conviction, dedication, moderation, and tradition. Some ysoki, on the other hand, have taken a liking to the weapon due to the fact that the disassembled pieces can be stored in ysoki cheek pouches."
  },
  {
    "source": "Starfinder Core Rulebook pg. 171",
    "Name": "Spear, Gravity",
    "Category": "—",
    "Level": "19",
    "Price": "552,000",
    "Damage": "12d6 P",
    "Critical": "—",
    "Bulk": "1",
    "Special": "block, powered (capacity 40; usage 2), thrown (20 ft.)",
    "type": "Two-Handed Weapons",
    "desc": "Spears come in many varieties. Buzzblade spears vibrate at high frequency. Zero-edge spears employ quantum manufacturing to hone an edge so fine that it seems indistinct. The gravity spear uses a tiny gravity field generator to accelerate the weapon at the moment of impact."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Living Staff, Paragon",
    "Category": "—",
    "Level": "20",
    "Price": "919,000",
    "Damage": "14d6 B",
    "Critical": "bind",
    "Bulk": "1",
    "Special": "block, living, powered (capacity 20; usage 1), reach",
    "type": "Two-Handed Weapons",
    "desc": "Xenodruids developed the living staff, a gnarled and vineswathed pole, to use as a weapon and a sign of their allegiance. The staff itself can extend, and the vines can wrap around and entangle a target. Xenodruids on sentinel duty favor the tactical and advanced models. The elite and paragon models are more common among highly skilled warrior-mystics undertaking assault missions."
  },
  {
    "source": "Starfinder Armory pg. 53",
    "Name": "Maul, Paragon",
    "Category": "—",
    "Level": "20",
    "Price": "724,000",
    "Damage": "15d8 B",
    "Critical": "knockdown",
    "Bulk": "1",
    "Special": "analog, unwieldy",
    "type": "Two-Handed Weapons",
    "desc": "Outsized hammers, mauls are valued for their intimidation factor and effectiveness in battle. A tactical maul is as much an instrument for hammering posts into the ground as a weapon. Advanced mauls include dense, heavy cores to deliver a more forceful blow. Elite mauls and paragon mauls are designed and manufactured more for war than labor, although the weapons can be used as tools."
  }
]