[
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Spell Chip",
    "Price": "110% of component spell gem",
    "type": "Modules",
    "desc": "It is possible to create spell gems (see page 224) in the form of chips that can be slotted into a computer system. A user capable of utilizing an equivalent spell gem with access to the computer in which such spell chips are installed can cast the related spells whenever controlling the computer and gains a +2 circumstance bonus to any skill check involving these spells. Spell chips cost 110% of a spell gem (page 224) with the same spells. When a spell is expended from a spell chip, the chip itself is not destroyed, and the spells can be reloaded into the spell chip for 90% of the normal price of a new spell chip."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Control, Complex",
    "Price": "10% of controlled device",
    "type": "Modules",
    "desc": "The control module allows the computer to operate a complex device, to which it must be in some way connected. (Simpler devices can be controlled as part of a computer’s basic functions.)Some countermeasures might make use of a computer’s control modules when activated. Gaining control of a computer allows the user to activate the devices in any way allowed by the control module. The price of a control module depends on the complexity of the object being controlled. The control module for a more complex device, such as a spy drone, vehicle, or weapon turret, costs 10% of the device to be controlled.\n\n When controlling a basic device that essentially has an on/off switch, the computer simply gains access to that switch and can activate or deactivate the connected device as instructed. When in charge of a device that can already operate autonomously (such as a robot or another computer), the controlling computer can give orders to that device. When operating a device that requires a skill check or attack roll (such as a computer hooked to a med-bed or weapon), the controlling computer can either allow a creature with authorized access to attempt a skill check or attack roll, or attempt the skill check or attack roll itself. When making its own check, the computer is assumed to have an attack bonus equal to its tier, proficiency with any weapon it controls, and a total skill bonus equal to 2-1/2 × its tier. Such controlled objects are normally mounted to a specific location (such as a controlled longarm placed in a turret with line of sight to the computer’s terminal), in which case the mount and related components are included in the control unit price.\n\n A computer can also control another computer. In this case, hacking one computer allows you to attempt to hack any computer it controls, but this does not automatically give you access to those other computers. It’s common for a lower-tier computer to be set up to control a higher-tier computer, such as when a clerk’s desk computer is linked to a company mainframe. In these cases, the lower-tier computer can only send specific, authorized commands to the higher-tier computer, though it can still be used as an access point in an attempt to hack the higher-tier computer.\n"
  },
  {
    "source": "Starfinder #21: Huskworld pg. 45",
    "Feature": "Rakmodoi Computers, Skill",
    "Price": "10% of computer’s base price",
    "type": "Modules",
    "desc": "A rakmodoi skill module allows a computer to analyze information and make rapid correlations, so the computer can perform the aid another action for one user with the skill the module provides. The computer has a bonus to the aid another check equal to its tier –2 (minimum +1). A skill module can have one of the following skills (with tasks the computer can aid noted in parentheses): Computers (craft computer, create or detect forgery), Culture (decipher writing, recall knowledge), Life Science (craft drug, poison, or medicinal; craft food or drink; identify creature; recall knowledge), Mysticism (craft item, identify creature, identify technology, repair item), Physical Science (craft drug, poison, or medicinal; recall knowledge), and a variety of Profession skills (recall knowledge). Similar technological modules allow Engineering (assess stability, craft device, identify creature, identify magic item, repair item)."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Secure Data, Average",
    "Price": "10 credits",
    "type": "Modules",
    "desc": "This module contains secured data relative to a specific topic, and is almost never available without root access or an action by someone with root access to grant another user the ability to access the secure data module. Since a secure data module serves to store information too important or sensitive to let fall into the hands of your average hacker, it is frequently also kept behind a firewall.\n\n Secure data might consist of a few simple documents or a vast library of technical specifications. The only requirement is that the data be limited to one general topic (such as a ship’s design, correspondence among members of a group, local maps and charts, etc.); additional topics require additional data modules. The price of the module depends on the topic’s size. A data module suitable for a specific small topic (such as a video log, a financial ledger, or a building schematic) costs 1 credit. A data module for an average topic (such as engineering specifications for a gun, a company’s employee database, or a large array of maps) costs 10 credits. Modules for large topics (such as the plans for a starship, a space station’s operations log, or a company’s master records) cost at least 100 credits and might cost as much as 1,000 credits. In addition to storing data that might be valuable on its own (such as plans for a military invasion), a data module allows a character with access to it to take 20 when attempting a skill check to recall knowledge on a topic related to the data module’s contents.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Secure Data, Large",
    "Price": "Varies",
    "type": "Modules",
    "desc": "This module contains secured data relative to a specific topic, and is almost never available without root access or an action by someone with root access to grant another user the ability to access the secure data module. Since a secure data module serves to store information too important or sensitive to let fall into the hands of your average hacker, it is frequently also kept behind a firewall.\n\n Secure data might consist of a few simple documents or a vast library of technical specifications. The only requirement is that the data be limited to one general topic (such as a ship’s design, correspondence among members of a group, local maps and charts, etc.); additional topics require additional data modules. The price of the module depends on the topic’s size. A data module suitable for a specific small topic (such as a video log, a financial ledger, or a building schematic) costs 1 credit. A data module for an average topic (such as engineering specifications for a gun, a company’s employee database, or a large array of maps) costs 10 credits. Modules for large topics (such as the plans for a starship, a space station’s operations log, or a company’s master records) cost at least 100 credits and might cost as much as 1,000 credits. In addition to storing data that might be valuable on its own (such as plans for a military invasion), a data module allows a character with access to it to take 20 when attempting a skill check to recall knowledge on a topic related to the data module’s contents.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Secure Data, Specific",
    "Price": "1 credit",
    "type": "Modules",
    "desc": "This module contains secured data relative to a specific topic, and is almost never available without root access or an action by someone with root access to grant another user the ability to access the secure data module. Since a secure data module serves to store information too important or sensitive to let fall into the hands of your average hacker, it is frequently also kept behind a firewall.\n\n Secure data might consist of a few simple documents or a vast library of technical specifications. The only requirement is that the data be limited to one general topic (such as a ship’s design, correspondence among members of a group, local maps and charts, etc.); additional topics require additional data modules. The price of the module depends on the topic’s size. A data module suitable for a specific small topic (such as a video log, a financial ledger, or a building schematic) costs 1 credit. A data module for an average topic (such as engineering specifications for a gun, a company’s employee database, or a large array of maps) costs 10 credits. Modules for large topics (such as the plans for a starship, a space station’s operations log, or a company’s master records) cost at least 100 credits and might cost as much as 1,000 credits. In addition to storing data that might be valuable on its own (such as plans for a military invasion), a data module allows a character with access to it to take 20 when attempting a skill check to recall knowledge on a topic related to the data module’s contents.\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Artificial Personality",
    "Price": "10% of computer\u0027s base price",
    "type": "Upgrades",
    "desc": "An artificial personality is a program designed to allow a computer to hold conversations in plain language with both users and creatures that lack access. Such computers are often given a name and are capable of parsing expressions, slang, social cues, tone of voice, and similar elements beyond a literal understanding of spoken or written words. They can respond appropriately through algorithms and lists of billions of known phrases and expressions, developed by programmers over centuries to allow for extremely naturalsounding conversations. Such computers can even display what appear to be emotions and insights. However, unlike androids, computers with artificial personalities have not attained true consciousness. The ability of an artificial personality to hold a conversation, learn names and habits, and even give advice is based purely on its complex code and extensive lexicons."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Hardened",
    "Price": "50% of computer\u0027s base price",
    "type": "Upgrades",
    "desc": "The computer and its systems are encased in armored and energy-resistant shells. The computer’s hardness increases by 10, and it gains a +8 bonus to saving throws against energy attacks and effects that specifically target computers or electronic systems. This upgrade costs 50% of the base price of the computer."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Miniaturization",
    "Price": "10% of computer\u0027s base price",
    "type": "Upgrades",
    "desc": "Treat your computer as 1 tier lower when calculating its bulk, to a minimum of tier –1. A tier-0 computer has light bulk, and a computer of tier –1 has negligible bulk. You can buy this upgrade multiple times. Each time it costs 10% of the base price of the computer."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Security",
    "Price": "Varies",
    "type": "Upgrades",
    "desc": "This bolsters the overall security of the computer, increasing the DC of the Computers check to hack the computer and gain access to its modules. This upgrade comes in multiple ranks, each stronger and more secure than the last. Refer to the below table to determine the DC increase and the price (in percentage of the base price of the computer). A computer cannot benefit from more than one security upgrade. "
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Self-Charging",
    "Price": "10% of computer\u0027s base price",
    "type": "Upgrades",
    "desc": "While most computers can operate for up to 24 hours on internal batteries, this upgrade makes it so that the computer can function for up to 1 week on its internal power alone. Multiple purchases of this upgrade each extend the time by 1 additional week. This upgrade costs 10% of the base price of the computer."
  },
  {
    "source": "Alien Archive 2 pg. 27",
    "Feature": "Telepathic User Interface",
    "Price": "10% of computer\u0027s base price",
    "type": "Upgrades",
    "desc": "This upgrade allows a creature with limited telepathy or telepathy to access a computer via a telepathic user interface without having physical access, as long as the computer is within the creature’s telepathic range."
  },
  {
    "source": "Starfinder #21: Huskworld pg. 44",
    "Feature": "Rakmodoi Computers, Arms",
    "Price": "500",
    "type": "Upgrades",
    "desc": "This upgrade adds arms to a rakmodoi computer. These limbs can perform most simple functions that humanoid arms and hands perform, such as opening doors and manipulating objects. However, the arms can’t use skills or make attacks."
  },
  {
    "source": "Starfinder #21: Huskworld pg. 44",
    "Feature": "Rakmodoi Computers, Mobility Unit, Claws",
    "Price": "100 x computer’s bulk",
    "type": "Upgrades",
    "desc": "A typical rakmodoi computer is a stationary object, but the rakmodois invented mobility units to grant some machines the ability to move alongside a user. A tail attachment gives the rakmodoi computer a land speed of 10 feet and a swim speed of 30 feet. Insectile legs mobility units grant the computer a land speed of 30 feet and a climb speed of 30 feet. A claw unit grants the machine a land speed of 20 feet and a burrow speed (through soil and ice) of 20 feet. A rakmodoi computer of up to 20 bulk can be fitted with these units, so high-tier computers must be miniaturized to use them. Multiple attachments grant the highest speed in each movement type. A rakmodoi computer with a mobility unit has Athletics as a good skill as if it were a creature of a CR equal to twice its tier."
  },
  {
    "source": "Starfinder #21: Huskworld pg. 44",
    "Feature": "Rakmodoi Computers, Mobility Unit, Legs",
    "Price": "100 x computer’s bulk",
    "type": "Upgrades",
    "desc": "A typical rakmodoi computer is a stationary object, but the rakmodois invented mobility units to grant some machines the ability to move alongside a user. A tail attachment gives the rakmodoi computer a land speed of 10 feet and a swim speed of 30 feet. Insectile legs mobility units grant the computer a land speed of 30 feet and a climb speed of 30 feet. A claw unit grants the machine a land speed of 20 feet and a burrow speed (through soil and ice) of 20 feet. A rakmodoi computer of up to 20 bulk can be fitted with these units, so high-tier computers must be miniaturized to use them. Multiple attachments grant the highest speed in each movement type. A rakmodoi computer with a mobility unit has Athletics as a good skill as if it were a creature of a CR equal to twice its tier."
  },
  {
    "source": "Starfinder #21: Huskworld pg. 44",
    "Feature": "Rakmodoi Computers, Mobility Unit, Tail",
    "Price": "100 x computer’s bulk",
    "type": "Upgrades",
    "desc": "A typical rakmodoi computer is a stationary object, but the rakmodois invented mobility units to grant some machines the ability to move alongside a user. A tail attachment gives the rakmodoi computer a land speed of 10 feet and a swim speed of 30 feet. Insectile legs mobility units grant the computer a land speed of 30 feet and a climb speed of 30 feet. A claw unit grants the machine a land speed of 20 feet and a burrow speed (through soil and ice) of 20 feet. A rakmodoi computer of up to 20 bulk can be fitted with these units, so high-tier computers must be miniaturized to use them. Multiple attachments grant the highest speed in each movement type. A rakmodoi computer with a mobility unit has Athletics as a good skill as if it were a creature of a CR equal to twice its tier."
  },
  {
    "source": "Starfinder #21: Huskworld pg. 45",
    "Feature": "Rakmodoi Computers, Mystic Comm",
    "Price": "4000",
    "type": "Upgrades",
    "desc": "This comm upgrade imparts a mystical modification to the computer that allows it to telepathically communicate using the Astral Plane in a radius of several thousand miles. The upgrade allows the rakmodoi computer to function as a comm unit with a planetary range, but it can connect only with other computers that have this upgrade. A rakmodoi computer that has this upgrade on Rakmos can access other systems on that planet, forming an infosphere the rakmodois once used."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Range, I (100 feet)",
    "Price": "5 credits",
    "type": "Upgrades",
    "desc": "While most computers have access to remote systems and local infospheres, this connection does not necessarily extend to other devices. A computer that controls a comm unit can use that comm unit to send and receive messages but cannot use it to control devices. The range upgrade provides a secure, remote connection to a device which allows it to be controlled from a distance. Without this upgrade, a computer must be physically connected to the devices it controls with its control modules. Range I allows the computer to control a device wirelessly within 100 feet, and costs 5 credits (this includes the adjustments to both the computer and the connected device). Extending this range to 1 mile (Range I) costs 50 credits, while increasing it to planetwide (Range III) costs 100 credits (requiring an infosphere connection for both the computer and device).\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Range, II (1 mile)",
    "Price": "50 credits",
    "type": "Upgrades",
    "desc": "While most computers have access to remote systems and local infospheres, this connection does not necessarily extend to other devices. A computer that controls a comm unit can use that comm unit to send and receive messages but cannot use it to control devices. The range upgrade provides a secure, remote connection to a device which allows it to be controlled from a distance. Without this upgrade, a computer must be physically connected to the devices it controls with its control modules. Range I allows the computer to control a device wirelessly within 100 feet, and costs 5 credits (this includes the adjustments to both the computer and the connected device). Extending this range to 1 mile (Range I) costs 50 credits, while increasing it to planetwide (Range III) costs 100 credits (requiring an infosphere connection for both the computer and device).\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Range, III (planetwide)",
    "Price": "100 credits",
    "type": "Upgrades",
    "desc": "While most computers have access to remote systems and local infospheres, this connection does not necessarily extend to other devices. A computer that controls a comm unit can use that comm unit to send and receive messages but cannot use it to control devices. The range upgrade provides a secure, remote connection to a device which allows it to be controlled from a distance. Without this upgrade, a computer must be physically connected to the devices it controls with its control modules. Range I allows the computer to control a device wirelessly within 100 feet, and costs 5 credits (this includes the adjustments to both the computer and the connected device). Extending this range to 1 mile (Range I) costs 50 credits, while increasing it to planetwide (Range III) costs 100 credits (requiring an infosphere connection for both the computer and device).\n"
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Alarm",
    "Price": "10 credits",
    "type": "Countermeasures",
    "desc": "One of simplest countermeasures, this program sends an alert to a specific individual or station if someone attempts to breach the system. If the computer has a control module connected to an actual alarm, this countermeasure can trigger that alarm. If the computer controls a robot, trap, or weapon, an alarm can also activate them. The alarm countermeasure costs 10 credits."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Fake Shell",
    "Price": "50% of computer\u0027s base price + 10% of price of control and data modules",
    "type": "Countermeasures",
    "desc": "This particularly cunning countermeasure creates an entirely fake network and system directory for anyone accessing the system that fails to bypass this countermeasure. The phony network has cloned control modules and data modules to make it appear to be the actual system, but the control modules do not actually work and the data modules contain garbage files. A character can uncover this ruse with a successful Computers check with a DC equal to the system’s DC + 5. See Detect Fake Shell on page 138 for more information. The fake shell countermeasure costs 50% of the base price of the computer plus 10% of the price of its control and data modules."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Feedback",
    "Price": "500 credits",
    "type": "Countermeasures",
    "desc": "This countermeasure unleashes insidious virus software into any system that tries to hack it, causing damage to that system and its programming. If you fail a check to hack the computer by 5 or more, any device used in the attempt to break into the system is infected and becomes unreliable, resulting in a –5 penalty to all skill checks involving the infected equipment. You can remove a virus from an infected system if you succeed at a Computers check with the same DC as hacking the computer that has the feedback countermeasure. At the GM’s discretion, feedback viruses can have other effects instead, such as granting a +5 circumstance bonus to anyone attempting to hack the infected system. A feedback countermeasure costs 500 credits."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Firewall",
    "Price": "20% of computer\u0027s base price",
    "type": "Countermeasures",
    "desc": "This countermeasure does nothing to the intruder but instead partitions off modules behind an additional layer of security. Accessing the hidden modules requires another successful Computers check, usually with a DC equal to the original DC + 2. A computer can have multiple firewalls to block off multiple modules, but no one module can be protected by more than a single firewall. A firewall costs 20% of the base price of the computer."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Lockout",
    "Price": "100 credits",
    "type": "Countermeasures",
    "desc": "A lockout countermeasure freezes a system if a user repeatedly fails attempts to access it, causing it to become entirely inaccessible. Generally, this does not mean that the system is powered down, and other modules and countermeasures can still take automated actions. Lockouts last a specified period of time, typically 10 minutes, 1 hour, or 1 day, but any time frame can be specified. A lockout cannot be disabled, even by a user with the correct passwords and credentials. It is possible to bypass a lockout by accessing physical components of the computer, requiring a successful Engineering check with the same DC as the check to hack the computer."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Shock Grid",
    "Price": "Varies",
    "type": "Countermeasures",
    "desc": "The computer and its surrounding environment are protected by a grid of conductive material that transmits a shock to anyone who fails to access the system. This has two settings: one meant to stun and one meant to kill. Normally, the stun setting happens first, with a warning about lethal force should the intruder make another attempt. The stun setting forces all creatures within 10 feet of the terminal to succeed at a Fortitude saving throw or be stunned for 1 round. The lethal setting affects nearby creatures like the stun setting but also deals electricity damage to all creatures within 10 feet of the computer, allowing a Reflex save for half damage. The save DC, damage dealt, and price all depend upon the rank of the shock grid, as indicated on the below table. Each rank added counts as one countermeasure when determining the total number of countermeasures a system can have. Only computers fixed permanently to a floor or similar surface can have shock grids."
  },
  {
    "source": "Starfinder Core Rulebook pg. 215",
    "Feature": "Wipe",
    "Price": "10 credits",
    "type": "Countermeasures",
    "desc": "The system deletes specified data when an unauthorized breach is detected. This usually causes a number of data modules to be deleted from the system. Unless the owner is incredibly paranoid, this countermeasure is usually set to trigger only after two or more failed attempts to enter the system (so as to prevent accidental deletion due to a failed password attempt). Wipes don’t definitively remove data, however, unless the physical module containing the data is destroyed. Information deleted through a wipe can be recovered with 8 hours of work and a successful Computers check (DC \u003d 10 + the DC to hack the computer). A wipe countermeasure costs 10 credits."
  }
]