[
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 53",
    "Name": "Allergy Pod",
    "Category": "",
    "Level": "1",
    "Price": "20",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "An allergy pod is a small organic consumable that can be inserted into your nose or another breathing orifice with a standard action, where it slightly inflates to fill your breathing cavity. Creatures with multiple nostrils must break the pod apart and insert a piece in each nostril. The pod suppresses your allergic responses to inhaled substances, such as fungus, mold, or pollen. You gain a +2 circumstance bonus to saving throws against inhaled afflictions for 12 hours, after which the pods shrivel up and drop out of your nose. The listed price is for a box of 10 allergy pods."
  },
  {
    "source": "Starfinder #38: Crash and Burn pg. 55",
    "Name": "Safety Helmet",
    "Category": "",
    "Level": "1",
    "Price": "65",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "A safety helmet protects its wearer, granting DR 5/— that applies only to damage from falling objects. After a safety helmet protects its wearer from any damage, it breaks. If the wearer still takes damage after applying the damage reduction from the safety helmet, the safety helmet is destroyed instead."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 53",
    "Name": "Stomach Tabs",
    "Category": "",
    "Level": "1",
    "Price": "75",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "You can swallow a stomach tab as a standard action. It releases helpful microbes that maintain health, relieve excess acidity, and kill germs. Your breath becomes fresh and pleasant-smelling for 1 hour, and you gain a +2 circumstance bonus to saves against ingested afflictions and the nauseated and sickened conditions. The listed price is for a box of 10 stomach tabs."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 53",
    "Name": "Stylemander",
    "Category": "",
    "Level": "1",
    "Price": "50",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Stylemanders are fluffy, finger-sized, eight-legged grooming insects. Although nearly mindless, they’re considered by some to be cute and useful. They are always spotlessly clean, are natural cleaners of other creatures, and even clean the glass jars in which they are kept. Their instinct to groom hair has made them popular among nuar, skittermanders, ysoki, and other shoppers with fur or furry pets, but occasionally even humans and lashunta use one in lieu of conventional combing routines. To use a stylemander, let it out of its jar and let it comb through your hair or fur for 5 minutes. It removes and eats bugs, parasites, dirt, and stray hairs. Some designer breeds are marketed for their tendency to comb fur into particular styles or patterns. A stylemander lives for about 3 months."
  },
  {
    "source": "Starfinder #37: The White Glove Affair pg. 53",
    "Name": "Clothing, Kalistocratic",
    "Category": "",
    "Level": "1",
    "Price": "5",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Created from the finest silks, these clothes are durable and light. They cover as much of the wearer’s body as desired, protecting them from unwanted contact while still providing complete mobility and comfort. Wearing such attire provides a +1 circumstance bonus to Bluff, Diplomacy, and Profession checks when doing business with non-adherents, but a Kalistocrat not wearing proper attire while dealing with other Kalistocrats takes a –4 penalty to those same checks."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 53",
    "Name": "Grooming Moss",
    "Category": "",
    "Level": "2",
    "Price": "50",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Grooming moss is a consumable, palm-sized organic patch you can apply to your skin as a standard action. When you do, it consumes dirt and byproducts from your skin, slowly working its way over your entire body to make your skin clean and healthy. You can use a move action to tear off a patch of grooming moss, but it falls off naturally after 12 hours. As long as it is attached to your bare skin, you gain a +2 circumstance bonus to saving throws against contact afflictions. Each breed of moss is meant to be used by a single group of physiologically similar species, such as lashunta and humans; when used on a different group of similar species, the moss still attaches to the skin for 12 hours, slowly working its way across the body, but the only result is itching and discomfort."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 53",
    "Name": "Spidersatchel",
    "Category": "",
    "Level": "3",
    "Price": "1,200",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "This surprisingly strong spidersilk backpack has simple knots at all its structural joints. A spidersatchel is a living organism that spins additional silk to seal tears in its fabric, accommodate oversize loads, and otherwise manage the pack’s contents. If worn properly, the bulk of a spidersatchel does not count against your bulk carried, but the bulk of any item within it does. A spidersatchel can hold up to 3 bulk of items. While wearing it, treat your Strength score as 3 higher for the purpose of determining your carrying capacity. This does not stack with the effect of any other backpack."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Backpack, Consumer",
    "Category": "Backpack",
    "Level": "1",
    "Price": "3",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "When wearing a properly fitted consumer backpack, you treat your Strength score as 1 higher for the purpose of determining your carrying capacity."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Backpack, Industrial",
    "Category": "Backpack",
    "Level": "1",
    "Price": "25",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "When wearing a properly fitted industrial backpack, you treat your Strength score as 2 higher for the purpose of determining your carrying capacity. This does not stack with the effect of a consumer backpack."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Clothing, Athletic",
    "Category": "Clothing",
    "Level": "1",
    "Price": "5",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Athletic wear is usually designed for a specific athletic activity, such as a sport or other physical pursuit. Wearing athletic clothing grants you a +1 circumstance bonus to Athletics checks to perform the activity that the clothes are designed for."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Clothing, Ceremonial",
    "Category": "Clothing",
    "Level": "1",
    "Price": "5",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Ceremonial clothes are worn for both religious and nonreligious ceremonies. Religious ceremonial clothing includes vestments worn by priests while performing their ecclesiastical duties and garments for laypeople involved in religious rites. These vestments are usually decorated with colors and embellishments corresponding to a specific faith or religion and are often worn with a religious symbol (see page 131). Nonreligious groups, such as the adata of the Idari’s Sholar Adat, wear ceremonial clothing for their rituals, with their own unique looks and ornamentations."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Clothing, Environmental",
    "Category": "Clothing",
    "Level": "1",
    "Price": "10",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Each environmental outfit is designed with a specific climate in mind, and wearing such an outfit in an extreme environmental condition it is tailored for grants a benefit as follows: cold climates (+2 circumstance bonus to Fortitude saves against environmental cold dangers), dust storms (reduce damage from dust storms with windstorm-magnitude winds by 1), extreme gravity (reduce damage from extreme gravity environments by 1), heat climates (+2 circumstance bonus to Fortitude saves against environmental heat dangers), radiation (+1 circumstance bonus to saving throws against radiation effects), and zero gravity (+2 circumstance bonus to Acrobatics or Athletics checks to stop movement or climb along handholds in zero-g). See Chapter 11 for more information on environmental dangers."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Clothing, Everyday",
    "Category": "Clothing",
    "Level": "1",
    "Price": "1",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Clothes designed for everyday wear come in a dazzling array of colors and styles, many of which are tailored to specific cultures or planets. Most characters choose their everyday wear based on their personal preferences."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Clothing, Formal",
    "Category": "Clothing",
    "Level": "1",
    "Price": "5",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "Formal wear is designed for a specific social function, such as a wedding or funeral, and commonly differs from planet to planet and even from culture to culture. Lacking the proper formal wear at a social event can cause you to take a penalty of up to –4 to Bluff, Diplomacy, and Disguise checks at the function, as determined by the GM."
  },
  {
    "source": "Starfinder Armory pg. 129",
    "Name": "Clothing, Party",
    "Category": "Clothing",
    "Level": "1",
    "Price": "5",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Party clothes are usually designed for occasions where everyday or professional wear won’t do but where formal wear is too fancy. Usually, party wear takes the form of special costumes or unusual dress that one must wear to avoid looking out of place at the engagement. Lacking the proper party wear at a social event can cause you to take a penalty of up to –4 to Bluff, Diplomacy, and Disguise checks at the function, as determined by the GM."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Clothing, Professional",
    "Category": "Clothing",
    "Level": "1",
    "Price": "5",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Each set of professional wear is tailored to the tasks of a specific Profession skill and accommodates the needs of its wearer while also conveying an air of expertise and professionalism. You gain a +1 circumstance bonus to Profession checks to earn a living while wearing an appropriate professional outfit."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Clothing, Travel",
    "Category": "Clothing",
    "Level": "1",
    "Price": "10",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "A travel outfit offers additional comfort and support during overland travel. You add 2 miles per 8-hour day of overland movement while wearing a traveling outfit. You also gain a +1 circumstance bonus to Constitution checks to avoid taking nonlethal damage resulting from a forced march. See Overland Movement on page 258 for more details."
  },
  {
    "source": "Starfinder Armory pg. 129",
    "Name": "Clothing, Uniform",
    "Category": "Clothing",
    "Level": "1",
    "Price": "5",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Uniforms are clothes worn by members of a specific group. They come in a wide variety of styles, each unique to the group or organization that uses them. Examples include uniforms for corporate employees, emergency-service workers, health-care practitioners, maintenance workers, military or security personnel, prisoners, public-transit employees, students, and more. Wearing the proper uniform grants you a +1 circumstance bonus to Disguise checks to appear as a member of the group that the uniform represents. Some uniforms, especially for government-funded organizations such as the military or security forces, are tightly controlled and may not be available for purchase by non-members (or cost considerably more on the black market)."
  },
  {
    "source": "Starfinder Armory pg. 129",
    "Name": "Clothing, Reconfigurable",
    "Category": "Clothing",
    "Level": "2",
    "Price": "100 + cost of component outfits",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Reconfigurable clothing is constructed of specialized nanofibers that allow the clothing to shift between one or more outfits at your signal, such as clicking your heels together, speaking a command word, or twirling in place. As a move action, you can change your clothing from its current configuration to another outfit incorporated into the clothes. When you purchase reconfigurable clothing, choose one or more outfits to incorporate into your clothes. A single outfit of reconfigurable clothing can hold up to five other outfits of clothing. The cost for an outfit of reconfigurable clothing is 100 credits plus the cost of all outfits incorporated into the clothing."
  },
  {
    "source": "Starfinder Armory pg. 129",
    "Name": "Culinary Synthesizer, Mk 1",
    "Category": "Culinary Synthesizer",
    "Level": "1",
    "Price": "400",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "You can create only poor-quality meals."
  },
  {
    "source": "Starfinder Armory pg. 129",
    "Name": "Culinary Synthesizer, Mk 2",
    "Category": "Culinary Synthesizer",
    "Level": "1",
    "Price": "1,200",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "You can create up to common-quality meals, minor intoxicants, and any other food or drink with a price of 3 credits or less."
  },
  {
    "source": "Starfinder Armory pg. 129",
    "Name": "Culinary Synthesizer, Mk 3",
    "Category": "Culinary Synthesizer",
    "Level": "1",
    "Price": "2,500",
    "Bulk": "2",
    "type": "Personal Items",
    "desc": "You can create up to good-quality meals, superior intoxicants, and any other food or drink with a price of 10 credits or less."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Glass Cutter, Mk 1",
    "Category": "Glass Cutter",
    "Level": "1",
    "Price": "100",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "You can cut through glass or any material with a hardness of 1 or less."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Glass Cutter, Mk 2",
    "Category": "Glass Cutter",
    "Level": "1",
    "Price": "400",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "You can cut through transparent aluminum or any material with a hardness of 10 or less."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Ladder, Collapsible (10 feet)",
    "Category": "Ladder",
    "Level": "1",
    "Price": "75",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Ladder, Collapsible (20 feet)",
    "Category": "Ladder",
    "Level": "1",
    "Price": "150",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Ladder, Collapsible (40 feet)",
    "Category": "Ladder",
    "Level": "1",
    "Price": "300",
    "Bulk": "2",
    "type": "Personal Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Map, Navigational",
    "Category": "Map",
    "Level": "1",
    "Price": "80",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Navigational maps are based on detailed explorations. They are extremely accurate and have in-depth detail on the detailed region’s features."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Map, Survey",
    "Category": "Map",
    "Level": "1",
    "Price": "20",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Survey maps are usually made when an area is first discovered and surveyed. They describe the general shape and features of the region but lack detail and precision. "
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Aerosol Spray",
    "Category": "Other",
    "Level": "1",
    "Price": "80",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Aerosol spray is an opaque liquid stored at high pressure with compressed gas in a spray canister. As a standard action, you can depress the canister’s trigger to spray the aerosol in a 5-foot burst, which fills a single square adjacent to your space. You can see any hidden or invisible laser beams in the aerosolfilled square, and you immediately become aware of the location of any invisible creature in that square. In addition, invisible creatures have only concealment (rather than total concealment) as long as they remain in an aerosol-filled square. The aerosol remains in its square for 1d4+1 rounds before dissipating. Each canister of aerosol spray contains enough aerosol for 10 uses."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Alter, Portable",
    "Category": "Other",
    "Level": "1",
    "Price": "250",
    "Bulk": "2",
    "type": "Personal Items",
    "desc": "Portable altars are designed for use by traveling or adventuring priests when access to a church or temple is not available. Portable altars can be made of durable plastic, ceramic, or even wood, and they are usually ornately decorated and embellished with the religious iconography of a particular deity or faith. One side of the altar is a hinged lid, allowing you to store items such as holy texts, religious symbols, and other religious accoutrements inside."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Bedroll",
    "Category": "Other",
    "Level": "1",
    "Price": "15",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "A bedroll is pad of memory foam 2 to 3 inches thick that provides padding while you sleep, conforming to the shape of your body. It can be compressed and rolled up with attached straps for storage or transport. Most people use a blanket or sleeping bag in conjunction with a bedroll."
  },
  {
    "source": "Pact Worlds pg. 199",
    "Name": "Binoculars",
    "Category": "Other",
    "Level": "1",
    "Price": "50",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Often used by Starfinders and other explorers or scouts, this advanced optical device allows you to view distant objects. While using binoculars, you gain a +1 circumstance bonus to vision-based Perception checks against objects 30 feet or farther from you. In order to gain this benefit, you must continually adjust the binoculars’ magnification settings, which requires using two hands and a move action each round."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Blanket",
    "Category": "Other",
    "Level": "1",
    "Price": "3",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Blankets come in a variety of materials and styles. Traditional blankets are usually woven textiles, natural wool or fur from a variety of creatures, or synthetic fibers engineered for maximum comfort and warmth. Emergency or survival blankets are thin sheets of reflective polymer that both help you retain body heat and make you more visible to rescuers. Many people combine a blanket with a bedroll for greater comfort. Adventurers and explorers rely on the plethora of armor, weapons, and equipment available for sale and use in the galaxy. However, there are also a wide variety of personal items that are not strictly necessary but are nevertheless desired, for either their utility or their luxury. The following personal items are readily available in most places that sell gear. They are not considered technological or magical unless specified otherwise."
  },
  {
    "source": "Starfinder Core Rulebook pg. 230",
    "Name": "Bonding Epoxy",
    "Category": "Other",
    "Level": "1",
    "Price": "400",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Bonding epoxy is a two-part adhesive plastic kept in a handheld dispenser that automatically mixes the components as they are dispensed. A single dispenser can be used five times. The dispensers cannot be reloaded, and a new dispenser must be purchased if additional epoxy is desired."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Canteen",
    "Category": "Other",
    "Level": "1",
    "Price": "1",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "This hollow plastic or metal container can hold up to a half gallon of liquid."
  },
  {
    "source": "Starfinder Armory pg. 129",
    "Name": "Cot",
    "Category": "Other",
    "Level": "1",
    "Price": "25",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "A cot is a portable bed consisting of sturdy fabric stretched over a collapsible aluminum or composite frame. Assembling or collapsing a cot is a full action. A cot has 1 bulk when collapsed, and increases to 3 bulk when assembled."
  },
  {
    "source": "Starfinder Core Rulebook pg. 231",
    "Name": "Gear Clamp",
    "Category": "Other",
    "Level": "1",
    "Price": "100",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "A gear clamp is designed to place a piece of equipment into an easily accessible position. This is often on a belt or the exterior of a suit of armor, but it can also place equipment in convenient locations when you are lurking in a tree or working in a zero-g environment. Affixing a gear clamp in place is a full action, but any object easily and conveniently held in one hand can be added to or removed from a gear clamp as easily as drawing or sheathing a weapon. Gear clamps are designed to have a trick release, with thousands of models each using a unique combination of clicks, spins, tugs, and twists to release attached gear. If you are not familiar with a specific clamps trick (by reading the instructions when you buy the clamp, having it demonstrated, or owning it and periodically testing its function), adding or removing equipment takes a full action. A successful DC 25 Strength check is required to separate material attached by a clamp."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Gear Maintenance Kit",
    "Category": "Other",
    "Level": "1",
    "Price": "5",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "This kit contains tools to maintain most common equipment. It includes a canister of lubricating oil, several small drivers and wrenches, armor polish, an armor cleansing agent with a citrus aroma, and a UPB pen that can repair small cracks, dents, scuffs, and other signs of wear and tear in most types of gear. A UPB pen can hold 1 UPB, which is enough to repair cosmetic damage on any one item."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Hammock",
    "Category": "Other",
    "Level": "1",
    "Price": "20",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "A hammock is a portable bed made of netting that is suspended between two opposite points so that you can sleep above the ground. Metallic disks at either end of the hammock are magnetized and coated with a reusable adhesive, allowing them to be stuck on nearly any surface. Attaching or detaching the disks is a move action."
  },
  {
    "source": "Starfinder Core Rulebook pg. 231",
    "Name": "Hygiene Kit",
    "Category": "Other",
    "Level": "1",
    "Price": "3",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "This kit contains all of the tools and products needed to practice good grooming and hygiene. Kits designed for specific races include supplies (such as scale-care products for vesk or antennae grooming for lashuntas or shirrens) that are of less use to other creatures."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Lighter",
    "Category": "Other",
    "Level": "1",
    "Price": "1",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "A lighter is a small canister containing a pressurized flammable liquid gas. When the lighter is activated, an electric arc ignites the gas, creating a tiny flame. You can light a small flame (such as a candle) as a swift action. Lighting a full fire is at least a full action or more, depending on the size and fuel of the fire."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Magnetic Jack",
    "Category": "Other",
    "Level": "1",
    "Price": "450",
    "Bulk": "2",
    "type": "Personal Items",
    "desc": "This handy tool consists of three circular plates roughly 1 foot in diameter. The top and bottom plates are powerful magnets with identical polarities, while the middle plate is a specially treated ferrous material that holds the entire assembly together as one piece through magnetic attraction but can also be easily pulled out from between the magnetic plates. Magnetic jacks are used to lift heavy objects off the ground. The jack is usually placed under a large or heavy object. As a move action, you can remove the middle plate, causing the top plate to immediately push away from the bottom plate, lifting the object 1 foot into the air above the bottom plate. A magnetic jack can support up to 200 bulk; if more than 200 bulk is placed on the top plate of a magnetic jack, the jack doesn’t move. A creature on the top plate of a magnetic jack while it is suspended in the air is flat-footed for as long as it remains on the jack. As a move action, you can reinsert the middle plate between the two magnetic plates, causing the jack to collapse and lower anything it is supporting to the ground."
  },
  {
    "source": "Starfinder Armory pg. 130",
    "Name": "Mess Kit",
    "Category": "Other",
    "Level": "1",
    "Price": "2",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "A mess kit contains personal cooking and utensils, usually made from plastic or cheap metal, in an easily portable package. A typical mess kit includes two plates of different sizes, a bowl, a cup, a small pot, a fork, a knife, a spoon, and chopsticks."
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 45",
    "Name": "Motion Trigger",
    "Category": "Other",
    "Level": "1",
    "Price": "80",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "This single-use device resembles a small cone and is attached to a specific package of explosives (explosives have the same price, effect, and weight as grenades). When the motion trigger is set (a process that takes 1 minute) and the package of explosives is placed in a 5-foot square, the motion trigger sets off the explosives the next time a creature enters that 5-foot square. A motion trigger can be disabled as a standard action by someone in an adjacent square with a successful Engineering check (the DC of this check is equal to 10 + 1-1/2 × the item level of the attached explosives); failure by 5 or more sets off the explosives."
  },
  {
    "source": "Pact Worlds pg. 199",
    "Name": "Oxygen Candle",
    "Category": "Other",
    "Level": "1",
    "Price": "20",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Included in almost every emergency kit scattered around Absalom Station’s corridors, oxygen candles are chemical oxygen generators that smolder when ignited. When used in an enclosed space measuring 10 cubic feet, an oxygen candle releases enough oxygen for a single Medium creature to breathe for 10 hours (as opposed to 6 hours) or a Small creature to breathe for 20 hours. The candle provides proportionally more or less oxygen in smaller or larger enclosed spaces respectively. Additional creatures proportionally reduce the time the oxygen lasts. An oxygen candle is consumed upon use."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Pot, Self-Heating",
    "Category": "Other",
    "Level": "1",
    "Price": "100",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "Used for cooking or warming up food, this large metal pot is equipped with four sealed nodes containing a variety of chemicals. When the pot is activated, these chemicals combine, creating a chemical reaction that heats the contents of the pot without needing additional power. A dial on the side of the pot enables you to adjust the pot’s temperature by controlling how much of the chemicals interact with one another. A self-heating pot is typically large enough to hold and heat a maximum of 10 gallons."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Religious Symbol",
    "Category": "Other",
    "Level": "1",
    "Price": "2",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "A religious symbol is a physical representation of a sacred image associated with a specific deity or religion, often worn as an amulet or badge. Each deity and religion has its own unique religious symbol. Religious symbols are usually mass-produced from cheap materials, such as plastic or thin metal, but they can be crafted out of other materials as well, with prices dependent on the material used. This item can also be used to represent badges or symbols of nonreligious organizations and groups."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Rope",
    "Category": "Other",
    "Level": "1",
    "Price": "1/50 ft.",
    "Bulk": "L/50 ft.",
    "type": "Personal Items",
    "desc": "Synthetic rope is exceptionally durable, elastic, and specifically designed to be easy to grip and climb. Although it lacks the strength and durability of cable lines, synthetic rope is significantly cheaper and lighter than those alternatives."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Scuba Gear",
    "Category": "Other",
    "Level": "1",
    "Price": "25",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "This ensemble includes a wet suit, fins for your feet, a transparent mask, a snorkel, and an integrated tank of compressed air. As long as you are not encumbered, while wearing scuba gear, you can move at your full land speed through water and similar fluids with a successful Athletics check to swim. In addition, the air tank allows you to breathe for up to 1 hour while submerged. Scuba gear does not provide any other environmental protections. It takes 4 rounds to don or remove scuba gear. You can’t wear scuba gear while wearing any type of armor."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Sleeping Bag",
    "Category": "Other",
    "Level": "1",
    "Price": "10",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "A sleeping bag is two padded blankets that form an enclosed pouch for sleeping, with a zipper or other fastener along one side to allow easy access. Like blankets, sleeping bags are usually made from woven synthetic fibers, but they provide greater warmth and comfort than blankets."
  },
  {
    "source": "Starfinder Core Rulebook pg. 231",
    "Name": "Space Suit",
    "Category": "Other",
    "Level": "1",
    "Price": "25",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "Although this high-tech suit offers little protection against attack, it does provide all the same environmental protections as a suit of armor (see page 196). Unlike armor, a space suit is not designed for the rigors of combat. Whenever you take damage while wearing a space suit, you must succeed at a Reflex saving throw (DC equal to the damage dealt) or the space suit’s life systems suffer catastrophic failure, gaining the broken condition and losing all environmental protections in 1d6 hours unless the suit is repaired. If you fail such a saving throw while the suit already has the broken condition, you lose all environmental protections in 1d6 minutes unless the suit is repaired. You can’t wear a space suit while also wearing any type of armor, even if that armor is broken."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Tool, Manual",
    "Category": "Other",
    "Level": "1",
    "Price": "25",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "Manual tools are extremely varied, but mass production has rendered the price and statistics of these items virtually identical. Sample manual tools include crowbars, hammers, mining picks, rakes, saws, shovels, sledgehammers, and similar implements. Using a manual tool for a job relevant to that tool grants you a +1 circumstance bonus to all ability checks and skill checks related to that job."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Book, Holy Text",
    "Category": "Other",
    "Level": "1",
    "Price": "2",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Holy texts are among the most commonly available books in the Pact Worlds. These are standardized books that detail the holy scriptures, rituals, mysteries, and religious parables of a specific deity or religion. Like standard books, most holy texts are stored in digital files to help spread the faith to the masses in a convenient format, but physical copies are also printed and sold for the same price as digital versions."
  },
  {
    "source": "Starfinder Armory pg. 128",
    "Name": "Book, Standard",
    "Category": "Other",
    "Level": "1",
    "Price": "5",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Standard books can be biographies, fiction, magical theory, scientific texts, technical manuals, and much more."
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Riding Saddle, Huge or larger",
    "Category": "Other",
    "Level": "1",
    "Price": "300",
    "Bulk": "5",
    "type": "Personal Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Riding Saddle, Large",
    "Category": "Other",
    "Level": "1",
    "Price": "75",
    "Bulk": "2",
    "type": "Personal Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Riding Saddle, Medium",
    "Category": "Other",
    "Level": "1",
    "Price": "25",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Riding Saddle, Small or smaller",
    "Category": "Other",
    "Level": "1",
    "Price": "10",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 45",
    "Name": "Wake-up Patch",
    "Category": "Other",
    "Level": "2",
    "Price": "100",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "This patch delivers a cocktail of stimulants when applied to an appendage or torso as a standard action. After 1 minute, the person who received the patch gains a +2 circumstance bonus to saving throws against effects that cause the asleep condition and to Fortitude saves from sleep deprivation for 24 hours. If you use three wake-up patches in a week, you immediately gain the exhausted condition when the effects of the third patch wear off."
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 45",
    "Name": "Warming Balm",
    "Category": "Other",
    "Level": "2",
    "Price": "150",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "It takes approximately 10 minutes to apply a tube of this clear gel to the inside of a suit of armor. For the next 8 hours, the balm’s chemical reactions warm the skin of the armor’s wearer. During that time, the wearer gains a +2 circumstance bonus to Fortitude saving throws to avoid taking damage from cold environments; this bonus stacks with that provided by cold weather environmental clothing. A tube of warming gel can also be applied directly to your exposed skin (or the epidermis of an adjacent creature) to stave off the negative effects of frostbite and hypothermia. This takes 10 minutes and heals 2d8 nonlethal cold damage dealt by a cold environment."
  },
  {
    "source": "Pact Worlds pg. 199",
    "Name": "Library Chip",
    "Category": "Other",
    "Level": "3",
    "Price": "250",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Widely used by the Arcanamirium, the Starfinder Society, and other scholarly organizations, library chips are portable storage devices that contain a digital library of information on a particular subject (Culture, Engineering, Life Science, Mysticism, or Physical Science). You gain a +4 circumstance bonus to skill checks to recall knowledge with that skill when using a library chip in conjunction with a tier-0 computer (such as a comm unit) or better. A library chip counts as a downloaded data set for the purposes of using the skill that the library chip pertains to. While using a library chip, you can attempt untrained skill checks to recall knowledge on that subject if the DC is 20 or less."
  },
  {
    "source": "Pact Worlds pg. 199",
    "Name": "Frictionless Gel",
    "Category": "Other",
    "Level": "5",
    "Price": "450",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "Sold in plastic tubes, this clear gel is a suspension of millions of microscopic spherical beads that reduce friction between objects. As a standard action, you can apply a dose of frictionless gel to your body to grant yourself a +4 circumstance bonus to Acrobatics checks to use the escape task. You must have at least one hand free to open the tube and apply the gel. A tube contains 5 uses of frictionless gel, and a single use lasts for 1 minute."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Perfume, Standard",
    "Category": "Perfume",
    "Level": "1",
    "Price": "50",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Standard aromas have a pleasant smell and can convey an air of hygiene, status, and wealth. "
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Perfume, Pheromonal",
    "Category": "Perfume",
    "Level": "5",
    "Price": "500",
    "Bulk": "—",
    "type": "Personal Items",
    "desc": "Pheromonal perfumes have been specially designed to influence members of a specific species; a pheromonal perfume grants you a +2 circumstance bonus to Charisma-based checks against members of that species. A creature with active environmental protections is immune to the effects of pheromonal perfume. The price listed for pheromonal perfume in Table 1–31 is for perfumes that can affect species commonly found in the Pact Worlds, such as humans, kasathas, vesk, etc. Perfumes engineered for more exotic species can cost anywhere from two to five times this price and could potentially be unavailable if contact with the species has only recently been established."
  },
  {
    "source": "Starfinder Core Rulebook pg. 231",
    "Name": "Tent, Mass Produced",
    "Category": "Tent",
    "Level": "1",
    "Price": "2",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "A mass-produced tent is insulated, sturdy, and capable of ventilating to prevent overheating or stuffiness without sacrificing protection. It allows characters within to treat extreme cold weather as severe cold weather, treat severe cold weather as typical cold weather, and ignore the effects of typical cold weather. It adjusts the severity of hot weather in a similar fashion. See page 400 for more information on cold dangers and page 402 for more information on heat dangers. A mass-produced tent does not protect against smoke, catching on fire, lava, radiation, or other environmental hazards."
  },
  {
    "source": "Starfinder Core Rulebook pg. 231",
    "Name": "Tent, Mobile Hotelier",
    "Category": "Tent",
    "Level": "1",
    "Price": "50",
    "Bulk": "1",
    "type": "Personal Items",
    "desc": "Tents known as mobile hoteliers are advanced and include systems that provide their occupants the same environmental protections as armor (see page 196) while active. A mobile hotelier requires a 20-charge battery to provide this protection, uses 1 charge every 8 hours, and is considered a technological item for effects and abilities that target or disable technology. Even if this protection is removed, the tent can still be used as a mass-produced tent."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Umbrella, Autoshade",
    "Category": "Umbrella",
    "Level": "1",
    "Price": "450",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "An autoshade umbrella is a folding, lightweight plastic panel that uses miniaturized antigrav thrusters to float approximately a foot above your head and remain in place as you move without requiring the use of any hands."
  },
  {
    "source": "Starfinder Armory pg. 131",
    "Name": "Umbrella, Standard",
    "Category": "Umbrella",
    "Level": "1",
    "Price": "2",
    "Bulk": "L",
    "type": "Personal Items",
    "desc": "A standard umbrella is made of plastic or synthetic fabric and requires one hand to use. "
  }
]