[
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Cable Line, Adamantine Alloy",
    "Category": "Cable Lines",
    "Level": "1",
    "Price": "500/10 ft.",
    "Hands": "—",
    "Bulk": "L/20 ft.",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Cable Line, Titanium Alloy",
    "Category": "Cable Lines",
    "Level": "1",
    "Price": "5/10 ft.",
    "Hands": "—",
    "Bulk": "L/10 ft.",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Comm Unit, Personal",
    "Category": "Comm Units",
    "Level": "1",
    "Price": "7",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "80",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Comm Unit, System-Wide",
    "Category": "Comm Units",
    "Level": "6",
    "Price": "4,000",
    "Hands": "—",
    "Bulk": "20",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Comm Unit, Unlimited",
    "Category": "Comm Units",
    "Level": "12",
    "Price": "32,000",
    "Hands": "—",
    "Bulk": "40",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Lock, Simple",
    "Category": "Locks",
    "Level": "1",
    "Price": "100",
    "Hands": "2",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Lock, Average",
    "Category": "Locks",
    "Level": "3",
    "Price": "1,000",
    "Hands": "2",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Lock, Good",
    "Category": "Locks",
    "Level": "6",
    "Price": "3,600",
    "Hands": "2",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Lock, Superior",
    "Category": "Locks",
    "Level": "14",
    "Price": "60,000",
    "Hands": "2",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Medpatch",
    "Category": "Medical Gear",
    "Level": "1",
    "Price": "50",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "1",
    "Usage": "1",
    "type": "Technological Items",
    "desc": "A medpatch is a simple, all-in-one, disposable medical device designed to be slapped onto a wound or area of concern (such as a clearly diseased or poisoned section of the body) with little skill required. A medpatch allows you to attempt a Medicine check untrained with a +10 circumstance bonus, but only for the first aid, long-term stability, treat disease, and treat drugs or poison tasks."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Medkit, Basic",
    "Category": "Medical Gear",
    "Level": "1",
    "Price": "100",
    "Hands": "2",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "The basic medkit has spray antiseptic, bandages, and handheld instruments designed to examine, explore, and treat common ailments. The basic medkit allows you to attempt DC 25 Medicine checks to treat deadly wounds."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Sprayflesh",
    "Category": "Medical Gear",
    "Level": "5",
    "Price": "440",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "1",
    "Usage": "1",
    "type": "Technological Items",
    "desc": "Sprayflesh is an advanced biotech medical device that sprays neutral biomass into a wound or area of concern (such as a clearly diseased or poisoned section of the body). If you have ranks in Medicine, a dose of sprayflesh allows you to attempt a check to treat deadly wounds on a creature that has already received its limit of treat deadly wound benefits for the day. If you succeed at a DC 25 Medicine check, the next time such a creature rests for 10 minutes and spends a Resolve Point to regain Stamina Points, it can instead gain the benefit of your Medicine check to treat deadly wounds. If you are not trained in Medicine, a dose of sprayflesh acts as a medpatch."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Medkit, Advanced",
    "Category": "Medical Gear",
    "Level": "5",
    "Price": "2,700",
    "Hands": "2",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "The advanced medkit adds more-advanced and specialized tools to diagnose and treat ailments. The advanced medkit can be used in the same way as a basic medkit, but the DC to treat deadly wounds is only 20, and you gain a +2 insight bonus to Medicine checks to treat drugs, diseases, and poisons. Additionally, you can use an advanced medkit to set up a temporary one-patient medical lab, though this requires 10 minutes. You can then provide long-term care to a single patient using the temporary medical lab, with a DC 30 Medicine check."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Medical Lab",
    "Category": "Medical Gear",
    "Level": "7",
    "Price": "7,000",
    "Hands": "2",
    "Bulk": "50",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A full medical lab contains beds, diagnostic equipment, sensors, and tools, and even a small surgical theater. A medical lab is not generally portable unless installed in a starship or vehicle of Huge or larger size. It allows you to treat up to three patients at once, and you can use the treat deadly wounds task of the Medicine skill twice per day on each patient. It otherwise functions as an advanced medical kit."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 52",
    "Name": "Crawling Cord",
    "Category": "Organic",
    "Level": "1",
    "Price": "100",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This rubbery, organic cord is 5 feet long and has a plug on each end that attaches to a computer, allowing you to interface with the computer from a distance. You can use a standard action to control the cord using a computer attached to one of these ends. The cord can stretch, contract, and bend around obstacles, moving up to 20 feet each time you direct it. Its maximum length is 50 feet. It can also grab onto and move a computer of light or negligible Bulk by plugging into it and pulling, but it disconnects if used to pull an object of more than light bulk. Moving a crawling cord past observers without being noticed requires a successful Sleight of Hand check, opposed by the Perception check of any observer. The cable draws power from any computers to which it is attached."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 53",
    "Name": "Message Slime",
    "Category": "Organic",
    "Level": "1",
    "Price": "50",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Message slime is a transparent, programmable ooze that comes in an egg-shaped container and is used to deliver clandestine or surprise messages. Any creature with a personal comm unit or other computer can use it to program a message slime with a message up to 5 minutes in length—including both audio and visual components—and requirements that activate the slime’s message. The criteria for activating the message must be simple and detectable with vision or hearing. For example, the slime might be programmed to activate as soon as a creature comes within 30 feet, or as soon as a shirren says the word “hello.” The slime is then spread on a surface, such as a wall, countertop, or door. As soon as the activating conditions are met, the slime’s surface displays its message. Message slime that has not yet been activated can be detected with a successful DC 20 Perception check. Once spread over a surface, message slime cannot be reprogrammed. It continues to play its message every time it is activated for 1 month or until removed. After this time, the slime dries into an inert, flaky substance."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 52",
    "Name": "Buoyant Harness",
    "Category": "Organic",
    "Level": "2",
    "Price": "500",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "2/hour",
    "type": "Technological Items",
    "desc": "This silky, palm-sized pouch is worn on the back and includes stretchy bands that can slip over all major limbs. Visitors to Bretheda don buoyant harnesses while within the upper levels of the planet’s atmosphere, but some planetary explorers also find them useful for arresting sudden falls. Putting on a buoyant harness is a full action. You can deploy a properly attached buoyant harness as a reaction by pulling sharply on any of the bands. Once deployed, the pouch uses organically heated helium to inflate into a balloon as large as you and filling the space directly above you, causing you to float; while floating, use the rules for moving in zero gravity. A buoyant harness does not function in heavy or extreme gravity. The balloon remains inflated and self-heated as long as it has charges remaining. You can deflate it as a move action, collapsing it by the start of your next turn. If you deflate a buoyancy harness while it is maintaining your altitude, you immediately descend 60 feet; if you reach the ground, you land safely. If not, you fall any remaining distance."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 53",
    "Name": "Wrist Leech",
    "Category": "Organic",
    "Level": "2",
    "Price": "125",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A wrist leech is a dark red, sluglike life-form about 3 inches long and 1/2 inch in thickness; one end of the creature ends in a circular sucker with tiny teeth. The leech can be applied to an individual’s skin, whereupon it attaches and begins sucking the individual’s bodily fluids. The wrist leech’s carefully designed physiology then filters the blood, removing toxins and other harmful chemicals from the bloodstream before returning it to the host’s body. An individual with an attached wrist leech gains a +4 circumstance bonus to saving throws against any injury affliction. A wrist leech requires no battery, but survives for only 4 hours once placed on the skin before it shrivels up and dies."
  },
  {
    "source": "Starfinder #29: The Cradle Infestation pg. 52",
    "Name": "Electrosensory Drum",
    "Category": "Organic",
    "Level": "8",
    "Price": "8400",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This handheld, organic drum-shaped device uses organs similar to those many aquatic and avian species use to detect electrical activity. Using an electrosensory drum is a move action. The drum operates by using blindsense (electricity) with a range of 20 feet. Targets are displayed on the drum’s softly glowing surface, along with their range and distance. An electrosensory drum generates its own energy that powers it for 60 minutes per day. Each use, no matter how short, consumes 1 minute of this time."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Signal Jammer",
    "Category": "Other",
    "Level": "Varies",
    "Price": "Level squared x 100",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "12",
    "Usage": "1/10 minute",
    "type": "Technological Items",
    "desc": "This handheld device, originally designed by the Stewards for military uses, is used by corporations and criminals alike. Signal jammers are available at any item level from 1 to 20 and can be purchased for a price equal to 100 credits × the square of the item level of the jammer. When activated, a signal jammer interrupts broadcast signals within 4 miles. If attached to a larger broadcasting station (such as those found aboard a starship), the range increases to 12 miles. A signal jammer blocks all communication devices from sending and receiving broadcasts. Each signal jammer is designed to affect one specific broadcasting medium (such as radio or wireless). You can attempt a Computers or Engineering check to bypass a signal jammer’s effects or to determine the location of the jammer. The DC to bypass or locate a signal jammer is 15 + the signal jammer’s level, and attempting this check takes 1 minute."
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 44",
    "Name": "Camouflage Membrane",
    "Category": "Other",
    "Level": "1",
    "Price": "100",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "This fine webbing is coated with reactive dyes that can be altered through minor electrical charges. It can be slipped over clothing or armor and adjusted to reflect the patterns of the local terrain to provide some camouflage, in a process that takes 10 minutes. When you wear a camouflage membrane, you gain a +2 circumstance bonus to Stealth checks while in the particular biome to which the membrane has been adjusted. You can take another 10 minutes to change the biome for which the item provides its bonus."
  },
  {
    "source": "Starfinder Armory pg. 100",
    "Name": "Chemalyzer",
    "Category": "Other",
    "Level": "1",
    "Price": "150",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "2/use",
    "type": "Technological Items",
    "desc": "This handheld unit includes an extendable wand tipped with a sampling nozzle, and can be easily operated with a single hand. It grants a +4 circumstance bonus to Engineering, Mysticism, and Physical Science checks to identify an unknown drug, medicinal, poison, or other chemical substance."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Detonator",
    "Category": "Other",
    "Level": "1",
    "Price": "150",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "5",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "This conical device primes and detonates explosives (including grenades) with a push of a button. Programming a detonator to a specific package of explosives takes 1 minute, after which the detonator can be triggered in one of several ways. The detonator can be set to ignite its payload with the simple press of a button (no action), a four-digit command code (a move action), or a complex input method, such as scanning your retina or thumbprint (a full action). You choose the triggering method when setting the detonator. A detonator detonates its payload only if it is within 500 feet, but some detonators can make use of signal-boosting technologies at the risk of becoming vulnerable to countermeasures like signal jammers and other effects. Explosives have the same price, effect, and weight as grenades (see page 183). If you successfully set an explosive on a stationary object with a detonator using the Engineering skill, the explosive’s damage ignores half of the object’s hardness."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Emergency Beacon",
    "Category": "Other",
    "Level": "1",
    "Price": "100",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "Varies",
    "type": "Technological Items",
    "desc": "When activated, this small, pod-shaped device emits a bright red flash from a dome on its top once every 6 seconds, using 1 charge per day. The emergency beacon also transmits its location. Any device capable of receiving signals of any sort can pick up an emergency beacon’s signal, which can then be tracked back to the source with a successful DC 15 Engineering or Survival check. An emergency beacon’s transmissions have a range of 100 miles over flat terrain, but this range is halved in forests or hills and quartered in mountainous terrain and underwater. Alternatively, an emergency beacon can be hooked up to a starship or vehicle’s communications system, in which case its usage increases to 1 charge per hour and its range matches that of the communications array of the vehicle or starship."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Fire Extinguisher",
    "Category": "Other",
    "Level": "1",
    "Price": "15",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/round",
    "type": "Technological Items",
    "desc": "As a standard action, you can deploy a fire extinguisher to end a burn effect on any one creature or object of Medium or smaller size. Extinguishing a Large creature or object takes 2 rounds, and the number of rounds required doubles with each size category beyond Large. A fire extinguisher can function for 20 rounds (which need not be consecutive) and can be recharged for 10% of the purchase price."
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 44",
    "Name": "Formation Boots",
    "Category": "Other",
    "Level": "1",
    "Price": "100",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Fairly standard issue to the Suskillon Defense Forces and sold to military organizations in other systems, these pressure-sensitive gel boots fit beneath normal armor and can also be worn separately. It takes 2 hours of walking in them before the wearer gains their benefit, but after that time, they conform to the wearer’s feet and provide a +2 bonus to Constitution saves to avoid taking damage from a forced march. "
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 52",
    "Name": "Geckopad Gloves",
    "Category": "Other",
    "Level": "1",
    "Price": "325",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "These subtle yet stylish black gloves have fingers tipped in a complex microscopic texture that mimics the setae of a gecko’s foot pads, allowing you to adhere to most small objects with ease. When you wear a pair of geckopad gloves, you gain a +2 circumstance bonus to Sleight of Hand checks to palm an object, and you reduce the DC of Sleight of Hand checks to pick pockets by 5."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Habitat Box",
    "Category": "Other",
    "Level": "1",
    "Price": "375",
    "Hands": "—",
    "Bulk": "4",
    "Capacity": "20",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "A habitat box is a powered container used to store small creatures or plant samples. Habitat boxes are typically used by explorers and naturalists to preserve samples, but couriers and smugglers also find them useful. The box has an adjustable temperature and humidity to keep the interior at a consistent environment, and food and water dispensers can sustain creatures stored within for as long as the box has power. The standard habitat box is a cube 2 feet square, although interior dividers allow you subdivide the box into several smaller compartments, each with their own isolated environment."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Holographic Sashimono",
    "Category": "Other",
    "Level": "1",
    "Price": "300",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This lightweight, shoulder-mounted hologram projector displays the image of a banner or crest in the air above and slightly behind you. Some use these to broadcast their beliefs, while others employ them as personal advertisements. Most holographic sashimonos display images up to 2 feet wide and 3 feet tall, and these images can be programmed to be static (such as a military insignia) or short looping animations (such as roaring flames). A holographic sashimono grants you a +2 insight bonus to Profession checks to earn a living."
  },
  {
    "source": "Starfinder #38: Crash and Burn pg. 55",
    "Name": "Holographic Strike Sign",
    "Category": "Other",
    "Level": "1",
    "Price": "275",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A holographic strike sign consists of a small projection unit attached to a dowel; it displays a holographic image or message programmed by the user. A holographic strike sign grants its holder a +2 circumstance bonus to Intimidate checks to bully individuals attempting to move past them. If used as an improvised weapon, a holographic strike sign deals an extra 1 point of electricity damage on a critical hit but then breaks."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Laser Drill",
    "Category": "Other",
    "Level": "1",
    "Price": "200",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "A laser drill is a handheld item that resembles a snub-nosed pistol. As a standard action, you can use the drill to create a hole 1 inch in diameter and 1 inch deep in stationary and unattended materials with a hardness of 15 or less, such as concrete, plastic, or wood. At the GM’s discretion, you might be able to use a laser drill on harder materials as a full action or longer. Detecting a laser drill at work requires a successful DC 15 Perception check. A laser drill isn’t generally useful in combat, but it can deal 1 fire damage with a successful melee attack as an improvised weapon."
  },
  {
    "source": "Pact Worlds pg. 198",
    "Name": "Radiation Badge",
    "Category": "Other",
    "Level": "1",
    "Price": "100",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "See text",
    "type": "Technological Items",
    "desc": "Because the invisible danger of radiation can lurk anywhere, dwarven mining consortiums often issue these small apparatuses to those exploring uncharted asteroids. When you are about to enter a square containing any level of radiation and you are wearing a radiation badge, the badge beeps audibly to warn you. A radiation badge is always on and functions for 7 days before it needs to be recharged (much like the environmental protections of a suit of armor with an item level of 1)."
  },
  {
    "source": "Starfinder #13: Fire Starters pg. 52",
    "Name": "Scorch Suture",
    "Category": "Other",
    "Level": "1",
    "Price": "200",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "2",
    "type": "Technological Items",
    "desc": "This small, handheld medical device looks similar to a soldering iron. You can use it to end the bleeding condition for a target within reach as a standard action, melting the flesh on a cellular level to stanch further blood loss. Unfortunately, the target takes 1 fire damage as a result. A target with any form of fire resistance can’t benefit from a scorch suture."
  },
  {
    "source": "Starfinder #36: Professional Courtesy pg. 50",
    "Name": "Scuba Gear",
    "Category": "Other",
    "Level": "1",
    "Price": "25",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Although this scuba gear offers little protection against attacks, it does provide 24 hours of breathable air; this capacity must be used in 1-hour increments but can be recharged in the same way as armor environmental protections. In addition, while wearing scuba gear, you gain a swim speed of 20 feet, and you don’t need to attempt Fortitude checks to avoid being sickened due to being in deep water (underwater at depths between 100 and 999 feet). You can’t wear scuba gear while also wearing armor."
  },
  {
    "source": "Character Operations Manual pg. 21",
    "Name": "Voice Distorter",
    "Category": "Other",
    "Level": "1",
    "Price": "55",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Kasathas who turn to crime, as well as those who value anonymity, sometimes wear masks that conceal their identities. A voice distorter worn over the mouth converts the user’s voice into an unrecognizable and obviously artificial tone. Any check attempted to identify the wearer’s voice takes a –5 penalty, and such identification can succeed only by relying on speech patterns, distinguishing phrases, and other idiosyncrasies of the wearer’s speech rather than the sound of the voice itself."
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "Zipstick",
    "Category": "Other",
    "Level": "1",
    "Price": "10",
    "Hands": "1",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "A zipstick is a small pen-like device used to administer a small jolt of electricity. This jolt is enough to deal 1 electricity damage with a successful melee attack as an improvised weapon. A zipstick is most often used to activate or deactivate ion-bonding technology, such as ion tape."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Emergency Raft, Basic",
    "Category": "Other",
    "Level": "1",
    "Price": "350",
    "Hands": "—",
    "Bulk": "3",
    "Capacity": "20",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "This emergency raft is stored as a brightred plastic cylinder, 6 inches wide and 2 feet long. When activated, it rapidly inflates into a plastic boat that measures 10 feet long, 4 feet wide, and 2 feet deep. It can hold four Medium creatures. The raft comes with four collapsible plastic oars to row with. As a move action, you can return the raft to its portable shape by pressing a button, as long as no objects or creatures remain inside. An emergency raft consumes 1 charge when you activate or collapse it."
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Environmental Field Collar, Huge or larger",
    "Category": "Other",
    "Level": "1",
    "Price": "300",
    "Hands": "—",
    "Bulk": "3",
    "Capacity": "10",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Environmental Field Collar, Large",
    "Category": "Other",
    "Level": "1",
    "Price": "75",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "10",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Environmental Field Collar, Medium",
    "Category": "Other",
    "Level": "1",
    "Price": "25",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "10",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 147",
    "Name": "Environmental Field Collar, Small or smaller",
    "Category": "Other",
    "Level": "1",
    "Price": "10",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "10",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Grenade Scrambler, Mk 1",
    "Category": "Other",
    "Level": "1",
    "Price": "250",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "Affects grenades with an item level of 1 or lower."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 53",
    "Name": "Micro Tap, Mk 1",
    "Category": "Other",
    "Level": "1",
    "Price": "200",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Musical Instrument, Basic",
    "Category": "Other",
    "Level": "1",
    "Price": "100",
    "Hands": "—",
    "Bulk": "Varies",
    "Capacity": "20",
    "Usage": "1/10 minutes",
    "type": "Technological Items",
    "desc": "Basic musical instruments can vary widely in quality and dimensions, but all can be played to provide a +2 insight bonus to Profession (musician) checks to earn a living. At the GM’s discretion, this bonus might also apply to similar Profession skills. Basic portable instruments are generally 1 bulk in size and can be held in one hand, even if they require two hands to play."
  },
  {
    "source": "Alien Archive 3 pg. 89",
    "Name": "Nanite Patch, Mk 1",
    "Category": "Other",
    "Level": "1",
    "Price": "50",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Restores 1d6 hp"
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Scanner, Video Camera",
    "Category": "Other",
    "Level": "1",
    "Price": "275",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "2/hour",
    "type": "Technological Items",
    "desc": "The most typical scanner is a video camera, which requires one hand to use. A video camera has ordinary sight and is capable of seeing whatever an ordinary human could see, with up to 10 times magnification. A video camera can record up to 4 hours of footage, which can be downloaded and viewed using nearly any computer."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Strategy Game, Basic",
    "Category": "Other",
    "Level": "1",
    "Price": "150",
    "Hands": "—",
    "Bulk": "Varies",
    "Capacity": "—",
    "Usage": "Varies",
    "type": "Technological Items",
    "desc": "If two to six characters spend 1 hour playing a basic strategy game together, each can roll an Intelligence check, with the highest result determining the game’s winner (reroll ties). The next time the strategy game’s winner attempts to use aid another to assist any of the other players of that game session, the DC of the aid another check is reduced by 1. A single basic strategy game can provide this benefit only once per week."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Tool Kit, Starfinder Armory",
    "Category": "Other",
    "Level": "1",
    "Price": "200",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "In escalating efforts to remain ahead of their competitors, many corporations market specialty tool kits as the latest advances or essential devices. The following tool kits supplement those presented on page 221 of the "
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Tool Kit",
    "Category": "Other",
    "Level": "1",
    "Price": "20",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A tool kit is a set of specialized tools and devices not worth purchasing individually, but which as a collection are required for a given task or provide a circumstance bonus to certain skill checks. The types of tool kits are: disguise kit (required for Disguise checks to change appearance), engineering kit (Engineering checks without one take a –2 penalty), hacking kit (required for most Computer checks; see page 137 for more information), navigator’s tools (grants a +4 bonus to Survival checks when orienteering), professional’s tools (provides a +4 bonus to Profession checks for one profession), rider’s kit (provides a +4 bonus to Survival checks to ride creatures), and trapsmith’s tools (provides a +4 bonus to Engineering or Mysticism checks to arm or disarm traps)."
  },
  {
    "source": "Pact Worlds pg. 198",
    "Name": "Tool Kit, Xhinti Holdings",
    "Category": "Other",
    "Level": "1",
    "Price": "200",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Xhinti Holdings, which has corporate offices on Salomo Station and factories on Akiton, produces a line of specialty tool kits that supplement those presented on page 221 of the Starfinder Core Rulebook. Xhinti tool kits include the following: a climbing kit (grants a +4 bonus to Athletics checks when climbing), demolitionist’s kit (grants a +4 bonus to Engineering checks when arming and disarming explosives), linguist’s kit (grants a +4 bonus to Culture checks when deciphering writing), portable weather station (grants a +4 bonus to Survival checks when predicting the weather), starship repair kit (grants a +4 bonus to Engineering checks when repairing the hull of a starship), and survivalist’s kit (grants a +4 bonus to Survival checks when enduring severe weather or living off the land). When using a demolitionist’s kit or starship repair kit for its specialized purpose, you don’t take the –2 penalty to Engineering checks if you don’t have an engineering kit."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 43",
    "Name": "Crash Pad",
    "Category": "Other",
    "Level": "2",
    "Price": "150",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A popular safety accessory for stunt performers, competitive climbers, and others who regularly risk falling or sustaining high-impact injuries, a crash pad is a rectangular packet of polyfluid worn on a belt or clipped to armor. A built-in altimeter can be set to customize the distance fallen before the crash pad activates, but it defaults to 15 feet. Further, an included accelerometer can be set to account for any acceleration that could prove harmful to a wearer. When you’re wearing a crash pad and fall or suffer an impact from your body being moved through space, such as in a vehicle collision, the crash pad activates, flash manufacturing ablative, protective foam and surrounding you with it. You reduce the number of dice of damage you take due to the triggering impact by three dice, taking no damage if this reduction leaves no dice to be rolled for the damage. You then halve any remaining damage you take from the triggering impact, rounded down. A used crash pad container can be recycled, allowing you to craft a new one with the usual 10% discount for having scavenged parts."
  },
  {
    "source": "Starfinder Armory pg. 100",
    "Name": "Datapad",
    "Category": "Other",
    "Level": "2",
    "Price": "55",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "Datapads are among the most common handheld computers and are ubiquitous in homes, manufacturing settings, and offices. Datapads require at least one hand to use. Nearly all datapads also incorporate a comm unit (which includes a microphone and speaker) along with several other functions, such as infosphere connectivity and data storage. Datapads can record simple audio and video (though not in high enough resolution to serve as proof of recorded events in most courts of law), store thousands of hours of recordings, play games, track time and set time-based alarms, act as word processors, and perform numerous other minor data processing and entertainment functions."
  },
  {
    "source": "Starfinder Armory pg. 101",
    "Name": "Diagnostic Lozenge",
    "Category": "Other",
    "Level": "2",
    "Price": "175",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This smooth, thumb-sized device activates automatically when it is inside a living creature. You can implant a diagnostic lozenge subdermally in a willing or unconscious creature with a successful DC 20 Medicine check, or a creature can choose to swallow one. An activated diagnostic lozenge steers itself into a creature’s tissue and extrudes several filaments to monitor its status, broadcasting information on a predetermined wireless frequency to a designated receiver, such as a datapad or comm unit, as long as the receiver is within 1 mile of the lozenge. The diagnostic lozenge broadcasts the creature’s direction and distance relative to the receiver, as well as any of the following conditions that are affecting the creature: dead, dying, frightened, nauseated, panicked, sickened, stable, staggered, stunned, or unconscious. A single receiver can accept information from up to six different diagnostic lozenges simultaneously. When a diagnostic lozenge runs out of charges, it breaks down into harmless components that eventually pass out of the creature’s body. Diagnostic lozenges can’t normally be safely removed once activated."
  },
  {
    "source": "Starfinder Armory pg. 103",
    "Name": "Evenfire Unit",
    "Category": "Other",
    "Level": "2",
    "Price": "550",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "2/hour",
    "type": "Technological Items",
    "desc": "Crafted of chemicals found on sweltering jungle worlds, this dull-brown cylindrical unit is no larger than a datapad. When an evenfire unit is activated, an electric current causes the chemicals to emit steady heat, but not light, within a 30-foot radius. Over 1 minute, the temperature of this area increases by 60° F, to a maximum of 80° F. The effects of multiple active evenfire units do not stack. This heat dissipates once the unit is shut off. An evenfire’s heat is consistent throughout the area and is no hotter closer to the unit than at the edge of its area of effect. Anyone in the heated area gains a +2 circumstance bonus to Fortitude saves against environmental cold dangers. In moderate or strong winds, an evenfire’s temperature increase is reduced to 30° F, and the circumstance bonus to Fortitude saves is reduced to +1."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Grappler",
    "Category": "Other",
    "Level": "2",
    "Price": "700",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "A grappler is a high-tech anchoring device that can be attached to a cable line as a move action. The cable line can instead be threaded through the grappler, which takes 1 minute but adds the cable line’s hardness and HP to the hardness and HP of the grappler (and vice versa). A grappler has clamps that can slide from its base along a cable line attached to it, allowing it to be climbed as easily as a knotted rope (see Athletics on page 136)."
  },
  {
    "source": "Starfinder #13: Fire Starters pg. 52",
    "Name": "Heatsink Cravat",
    "Category": "Other",
    "Level": "2",
    "Price": "300",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "1/round",
    "type": "Technological Items",
    "desc": "This garment is worn over the exterior of armor, often around the neck or head. Woven from golden nanotubes, a heatsink cravat converts heat energy into cold. It functions like a set of "
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Holoskin",
    "Category": "Other",
    "Level": "2",
    "Price": "500",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/10 minute",
    "type": "Technological Items",
    "desc": "This holographic projector is generally mounted to a belt or arm strap. It can be programmed using the Disguise skill to project a different appearance. When you use a holoskin, you can disguise major features, race, or creature type without the DC of your Disguise check increasing, except against Perception checks that involve physical examination."
  },
  {
    "source": "Pact Worlds pg. 198",
    "Name": "Magboots",
    "Category": "Other",
    "Level": "2",
    "Price": "750",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "Used by the brave souls who venture onto the exterior of Absalom Station to conduct repairs, these sturdy boots have powerful electromagnets built directly into the soles. These magnets can be activated as a move action, providing you a +5 circumstance bonus to Athletics checks made to climb metal surfaces, as well as +2 circumstance bonus to KAC against bull rush and trip combat maneuvers when you are standing on a metal surface. In areas of zero gravity, while wearing a pair of magboots, you can move your land speed across metal surfaces without having to attempt skill checks, and as long as you are adjacent to an appropriate surface, you do not automatically move at the beginning of your turn each round. Magboots function until they run out of power or until you deactivate them as a move action, whichever comes first."
  },
  {
    "source": "Starfinder Armory pg. 105",
    "Name": "Microgoggles",
    "Category": "Other",
    "Level": "2",
    "Price": "900",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This bulky set of goggles functions as a lighted magnifying glass or microscope, allowing you to see exceptionally small details with adjustable levels of magnification. Microgoggles provide a +2 insight bonus to any skill use that benefits from exceedingly close vision, such as detecting complicated forgeries or crafting drugs or medicinals."
  },
  {
    "source": "Starfinder #36: Professional Courtesy pg. 50",
    "Name": "Microjets",
    "Category": "Other",
    "Level": "2",
    "Price": "150",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This single-use, miniature jet pack can be attached to a thrown weapon (including a grenade) to increase its thrown range underwater to 60 feet (instead of the normal limitation of 5 feet). You can use the microjets as part of an action to make a ranged attack; this attack uses your Dexterity modifier instead of your Strength modifier."
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 44",
    "Name": "Pulse Ray",
    "Category": "Other",
    "Level": "2",
    "Price": "600",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "2/use",
    "type": "Technological Items",
    "desc": "This small electronic device emits a high-frequency tone that can temporarily shock the nervous system of a creature that has telepathy or limited telepathy. Suskillon scientists use these devices to aid in capturing Swarm enemies alive in order to study them. Aiming and activating this handheld unit is a standard action, and you can target a single creature within 30 feet of you. The target must succeed at a DC 14 Will saving throw or be staggered for 1 round; a creature with limited telepathy gains a +1 circumstance bonus to this save."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Radiation Sweeper",
    "Category": "Other",
    "Level": "2",
    "Price": "500",
    "Hands": "1",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "As radiation is deadly yet undetectable to most creatures’ senses, many races have invented sensors to detect its presence. A common sensor is the radiation sweeper, a handheld device capable of detecting radiation within 120 feet. The sweeper emits warning pings in different tones to indicate the presence of low, medium, high, or severe radiation and displays the areas of radiation on a screen at the top of the device. You must take a move action each round to use the radiation sweeper. A radiation sweeper cannot detect radiation through 3 feet of dirt or wood, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or any force field."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Survival Straw",
    "Category": "Other",
    "Level": "2",
    "Price": "450",
    "Hands": "1",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "See text",
    "type": "Technological Items",
    "desc": "This thin tube contains nanomachines and several filters that destroy contaminants or trap them in a washable compartment in the middle of the straw. When you activate a survival straw, water-based liquids you drink through it are automatically filtered and purified, removing any diseases, drugs, and poisons present in the liquid. A survival straw uses 1 charge per gallon of water filtered (or fraction thereof)."
  },
  {
    "source": "Starfinder Society Roleplaying Guild Guide, Version 2.0 pg. 31",
    "Name": "Tetred Certified Translator",
    "Category": "Other",
    "Level": "2",
    "Price": "500",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "10",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This elaborate datapad has several additional audio receptors to capture nearby sounds. If you don’t share a language with creatures you encounter, you can activate this device to collect basic linguistic information. The device requires 10 minutes of observed conversation to gain enough information to operate. The device then acts as a rudimentary translator. It does not allow you to converse with creatures with whom you don’t share a language, but it can relate very basic information. Examples of statements the device could interpret would be: “come with us,” “lower your weapons,” or “leave immediately.” The device cannot parse proper names, including personal designations or the names of items and places. Some extraordinary complex or obscure languages might not translate clearly with this device."
  },
  {
    "source": "Starfinder #28: The Hollow Cabal pg. 45",
    "Name": "Wingsuit",
    "Category": "Other",
    "Level": "2",
    "Price": "800",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A wingsuit consists of a tight-fitting overall with smart-fabric membranes stretched between the arms and legs. When wearing a wingsuit, you can retract or deploy the membranes as a swift action. When the membranes are deployed, your falling speed is slowed, reducing the maximum damage you could take from a fall to 10d6 (rather than 20d6), and you act as if you deliberately jumped instead of fell. The wingsuit grants you a +5 circumstance bonus to Acrobatics checks to reduce falling damage, as long as you are falling from a height of at least 30 feet. If you succeed at this check, you also don’t land prone. If the result of this check exceeds 20, you reduce the damage by an additional 1d6, and if the result exceeds 30, you further reduce the damage by 2d6 (4d6 total). While falling with the membranes deployed, you can also make small adjustments to move yourself laterally, moving up to 10 feet for every round spent falling."
  },
  {
    "source": "Character Operations Manual pg. 22",
    "Name": "Xenobiologist’s Field Kit",
    "Category": "Other",
    "Level": "2",
    "Price": "450",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Designed for adventurous scientists, this tool kit contains pipettes, syringes, vials, and other instruments that enable you to collect samples and analyze data outside a laboratory. Using a xenobiologist’s field kit grants you a +4 insight bonus to Life Science checks to identify and recall knowledge about flora and fauna, provided you take at least 10 minutes to do so. The field kit also counts as having access to an infosphere for taking 20 on such checks."
  },
  {
    "source": "Starfinder Armory pg. 103",
    "Name": "Emotion Regulator, Basic",
    "Category": "Other",
    "Level": "2",
    "Price": "800",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/10 minutes",
    "type": "Technological Items",
    "desc": "A basic emotion regulator grants you a +2 insight bonus to saves against emotion and fear effects, but your dulled reactions to danger impart a –2 penalty to your initiative checks and Reflex saving throws."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Nanite Hypopen, Brown",
    "Category": "Other",
    "Level": "2",
    "Price": "160",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Scanner, Shotgun Microphone",
    "Category": "Other",
    "Level": "2",
    "Price": "625",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "A shotgun microphone amplifies your sense of hearing within a particular direction. You gain a +2 insight bonus to hearing-based Perception checks in a 60-foot cone, but you take a –2 penalty to hearing-based Perception checks from other areas. A shotgun microphone can record up to 12 hours of sound. You don’t need to take an action to use a shotgun microphone, but changing its direction requires a move action."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Swarmproof Bangles, Basic",
    "Category": "Other",
    "Level": "2",
    "Price": "900",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "While basic swarmproof bangles are active, you have the entangled condition, but you also have DR 2/— against the swarm attack of Fine vermin and DR 1/— against the swarm attack of Diminutive vermin."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Tool Kit, Engineering Specialty",
    "Category": "Other",
    "Level": "2",
    "Price": "445",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "These kits each provide a +2 circumstance bonus to a specific use of the Engineering skill. Using an armorcrafter kit gives you a +2 bonus to repair, resize, or upgrade armor. A weaponsmithing kit gives you a +2 bonus to repair weapons."
  },
  {
    "source": "Starfinder Armory pg. 98",
    "Name": "Alert Redirector",
    "Category": "Other",
    "Level": "3",
    "Price": "1,450",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "The alert redirector consists of a metallic transmitter the size of a coin and a battery-powered receiver normally kept somewhere discreet on your body, such as in a pocket or on an arm strap under your clothing. As a standard action, you can attach the transmitter to a technological item that provides an alert or alarm when used, such as a radiation badge. Once the transmitter is attached, the item it is attached to doesn’t produce its usual alert or alarm; instead, the alert redirector’s receiver vibrates, warms slightly, or otherwise inaudibly alerts you as long as it is within 500 feet of the activated transmitter. Others relying on the item might consider an area safe, for example, while you know otherwise. Detecting a transmitter attached to an item normally requires a successful DC 20 Perception check, but the DC might be lower or higher based on the size of the item to which the transmitter is attached."
  },
  {
    "source": "Starfinder #36: Professional Courtesy pg. 50",
    "Name": "Beacon Buoys",
    "Category": "Other",
    "Level": "3",
    "Price": "1250",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "10",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "Beacon buoys are tiny, specialized flotation devices, each of which can self-adjust to float in place in water of any density. You can deploy a single beacon buoy as a move action, and each is automatically paired with a simple application that can be installed on most comm units and datapads. To deploy a buoy so that its data proves useful, it must have sufficient space by being at least 1 mile from any other buoy you’ve deployed. When you have at least 2 buoys deployed with sufficient space, you can use their relational-data feed to give you a circumstance bonus to Piloting checks to navigate in a vehicle and to Survival checks to orienteer underwater. This bonus is equal to half the number of buoys you’ve deployed with sufficient space (to a maximum of +10)."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 44",
    "Name": "Data Core",
    "Category": "Other",
    "Level": "3",
    "Price": "1,200",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This purplish-black cube, about 4 inches on each side, is based on the data cores of protocite speakers. It can store information and protect it from punishment and erasure. A data core is tough (AC 11, hardness 35, 55 HP) and can hold as much information as a "
  },
  {
    "source": "Starfinder Armory pg. 100",
    "Name": "Dermal Stapler",
    "Category": "Other",
    "Level": "3",
    "Price": "1,200",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "This oblong box the length of a human hand contains several hypoallergenic staples and a mass of sticky antiseptic gel. You use the dermal stapler by pressing it onto a willing or unconscious living creature’s wound; the dermal stapler launches one of its staples into the wound to close it and slathers the staple with the antiseptic gel. You can use a dermal stapler on a willing or unconscious creature to automatically end the bleeding condition without a Medicine check. Alternatively, you can use it in conjunction with a medkit to treat deadly wounds and gain a +1 insight bonus to your Medicine check. In addition to consuming a charge with each use, a dermal stapler must synthesize new staples and gel after 20 uses, at a cost in UPBs equal to one-quarter the stapler’s price."
  },
  {
    "source": "Starfinder Armory pg. 103",
    "Name": "Engineer\u0027s Puzzle Box",
    "Category": "Other",
    "Level": "3",
    "Price": "1,500",
    "Hands": "2",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This small box is covered with various circuits, electronic locks, gears, and other mechanisms that you must unlock or bypass in order to reach the box’s hollow center. The mechanisms shift and rearrange automatically, allowing for a multitude of combinations to keep the box from opening. Once unlocked, the box resets itself and reorders the mechanisms, starting the process over. Using an engineer’s puzzle box to improve your skills requires 1 hour and a DC 25 Engineering check. If you succeed at the check, you reduce the time required to disable devices using the Engineering skill by 2 rounds (to a minimum of 1 round). This bonus lasts for 24 hours. You can benefit from only one engineer’s puzzle box at a time."
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 44",
    "Name": "Gun Emplacement",
    "Category": "Other",
    "Level": "3",
    "Price": "1,350",
    "Hands": "—",
    "Bulk": "3",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This sturdy, metallic tripod can turn almost any gun into a semi-mobile turret, allowing soldiers to guard areas without putting themselves in harm’s way. It takes 10 minutes to attach or detach a non-analog longarm or heavy weapon to the emplacement; when attached to an emplacement, the gun can’t be wielded normally and can be fired only using the included wireless remote control that functions as a tier 1 computer with a control module. As long as the remote control is within 100 feet of the gun emplacement, you can use it to see through the emplacement’s camera (which has darkvision with a range of 30 feet) and operate the attached gun, either using your own ranged attack bonus with the attached weapon or allowing the computer to make the attack roll; the computer has a ranged attack bonus of +1 and proficiency with the attached weapon. Any weapon special properties and critical hit effects apply. When a gun emplacement gains the broken condition, you can no longer fire the attached gun."
  },
  {
    "source": "Starfinder Armory pg. 104",
    "Name": "Holoshroud",
    "Category": "Other",
    "Level": "3",
    "Price": "1,300",
    "Hands": "—",
    "Bulk": "2",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This loose mesh of wire and miniature holographic projectors is used to disguise the presence of creatures or objects. Holoshroud comes in 10-foot-by-10-foot square sheets. When you hide under an activated holoshroud, you gain a +2 insight bonus to Stealth checks as long as you remain immobile and prone. Covering yourself with holoshroud is a full action requiring a successful DC 10 Survival check (failure means you do not cover yourself correctly with the holoshroud and do not gain its bonus to Stealth checks). You have the entangled condition when using a holoshroud, except you do not take a penalty to initiative or Stealth checks from this condition. Taking off a holoshroud is a move action, or you can take off the holoshroud as part of the move action to stand up from a prone position. A creature with the blindsense ability ignores the effect of a holoshroud. You cannot hide under a holoshroud that is not activated; if the holoshroud runs out of charges while you are underneath it, you are visible as normal."
  },
  {
    "source": "Starfinder Armory pg. 105",
    "Name": "Ion Tape",
    "Category": "Other",
    "Level": "3",
    "Price": "275",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Ion tape is a ribbon of material tightly wound around a spindle. A roll of ion tape fits in the palm of a human hand and comes in a wide range of colors. A single roll contains 50 feet of tape. A single strip of tape is easy to cut through or tear. It has a weak adhesive that keeps the tape in place when wrapped around an object. When ion tape is exposed to an electrical charge of any power (including a jolt from a zipstick), the tape bonds into a single mass of plastic-like material, gaining hardness 8 and 15 Hit Points. When used to bind a creature, a few strips of activated ion tape require a successful DC 28 Strength check to break. A second jolt from an electrical source causes the tape to revert to its weaker ribbon state, at which point it can be torn easily. A strip of ion tape can hold about 5 pounds of weight normally, but when activated via a jolt, a single hardened strip can support up to 300 pounds. The uses for ion tape are many: it can be used to construct basic objects (such as a ladder), patch holes, bind prisoners, and so on."
  },
  {
    "source": "Starfinder #13: Fire Starters pg. 52",
    "Name": "Miniature Sun",
    "Category": "Other",
    "Level": "3",
    "Price": "1,200",
    "Hands": "1",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "A photonic inducer set in a brass-frame inset with glass similar to a lantern, a miniature sun is a portable light that exudes an area of bright light in a 30-foot radius. Thanks to a comfortable insulated handle, it requires only one hand to hold. After 1 minute of use, the exterior of a miniature sun becomes incredibly hot to the touch. When it is this hot, you can use a miniature sun as an improvised melee weapon that deals 1d3 fire damage, but each successful attack made in this way deals twice as much damage to the item, ignoring hardness."
  },
  {
    "source": "Starfinder #26: Flight of the Sleepers pg. 51",
    "Name": "Multiverse Mirror",
    "Category": "Other",
    "Level": "3",
    "Price": "1,300",
    "Hands": "—",
    "Bulk": "10",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Until it is activated, a multiverse mirror functions as normal full-length mirror. When activated, the reflective surface vibrates slightly, blurring the image. Once per day, you can spend 1 minute focusing on an activated mirror while contemplating a skill in which you have no ranks. As you do so, the image comes into focus, showing you a different version of yourself (presumably from an alternate reality) who is trained in that skill. The quantum energy released via the mirror briefly entangles you with this parallel self. Until the next time you take a full night’s rest, you can attempt one check with the chosen skill as if you had a number of ranks in that skill equal to your level. For that same period of time, the first time you roll a natural 20 for a skill check in a skill you are trained in, you must reroll that check and take the second result."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 44",
    "Name": "Portable Grinder",
    "Category": "Other",
    "Level": "3",
    "Price": "1,500",
    "Hands": "—",
    "Bulk": "2",
    "Capacity": "20",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "Based on protocite reclaimers, this grinder has flat-toothed discs that interlock and rotate toward one another. A multistage mechanism allows these grinders to break material down into junk or polyfluid. The initial stage renders 1 bulk of technological items into 1 bulk of inert electronic equipment suitable as a target for some spells, such as "
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "White-Noise Generator",
    "Category": "Other",
    "Level": "3",
    "Price": "1,350",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/10 minutes",
    "type": "Technological Items",
    "desc": "This small box produces random signals across multiple auditory and subauditory spectra. An activated white-noise generator increases the DC of sound-based Perception checks by 4 within 100 feet of the device. This increase is reduced by 1 for each additional 100 feet. The increase is doubled for checks that rely on technological listening, such as with a drone or microphone."
  },
  {
    "source": "Starfinder #26: Flight of the Sleepers pg. 15",
    "Name": "Gray Comm Unit, Planetary",
    "Category": "Other",
    "Level": "3",
    "Price": "1,500",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This bulky handheld unit can reach another unit on the same planet or on an object orbiting the same planet."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 53",
    "Name": "Micro Tap, Mk 2",
    "Category": "Other",
    "Level": "3",
    "Price": "400",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Scanner, Enhanced Camera",
    "Category": "Other",
    "Level": "3",
    "Price": "1,375",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "An enhanced camera functions as a video camera, but it can view a wider band of wavelengths, including infrared wavelengths. Enhanced cameras have low-light vision and darkvision with a range of 60 feet. An enhanced camera can record up to 24 hours of footage."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 43",
    "Name": "Anykey",
    "Category": "Other",
    "Level": "4",
    "Price": "1,750",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "An anykey is a lock-picking device, consisting of a handle and a thin metal strip. As a standard action, you can insert the strip into a physical lock and activate the anykey. Doing so causes the device to analyze the lock and extrude polyfluid into the mechanism. The fluid then hardens. This process creates a key that reduces the DC of Engineering checks to open that lock by 10. Resetting the anykey takes a standard action."
  },
  {
    "source": "Starfinder #26: Flight of the Sleepers pg. 17",
    "Name": "Eldricarnum",
    "Category": "Other",
    "Level": "4",
    "Price": "2,500",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A mass of metallic wires and small crystals of bright hues, this device can be worn like a glove. You can wire a spell gem into the eldricarnum (this process takes 1 minute) and use the gem as if the device were a weapon with the "
  },
  {
    "source": "Starfinder Armory pg. 104",
    "Name": "Inertial-Reinforcement Belt",
    "Category": "Other",
    "Level": "4",
    "Price": "2,200",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "Varies",
    "type": "Technological Items",
    "desc": "When activated, an inertial-reinforcement belt anchors you in place, protecting you against outside forces that would move you. This effect grants you a +4 bonus to your AC against bull rush, reposition, and trip combat maneuvers, consuming 1 charge per minute. If you fall from a height greater than 10 feet, the inertial-reinforcement belt automatically activates just prior to impact and reduces your falling damage by half, consuming 1 charge per die of falling damage. If the belt has fewer remaining charges than the number of dice, the damage is reduced only by a number of dice equal to the number of charges remaining. Damage from landing on hazardous objects such as spikes is not reduced."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 53",
    "Name": "Jammer Charge",
    "Category": "Other",
    "Level": "4",
    "Price": "375",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A jammer charge can be set as an explosive with the Engineering skill (with a detonator) or thrown like a grenade. When it detonates, a jammer charge silently releases a pulse of magnetic energy that interferes with broadcasting electronics. Computers and video cameras ("
  },
  {
    "source": "Starfinder Armory pg. 105",
    "Name": "Magnegloves",
    "Category": "Other",
    "Level": "4",
    "Price": "1,950",
    "Hands": "2",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "Varies",
    "type": "Technological Items",
    "desc": "These heavy, durable gloves have powerful electromagnets built directly into the palms and are designed to be worn either directly on the body, or over armor or protective gear. These magnets can be activated as a move action, providing you a +2 insight bonus to Athletics checks to climb metal surfaces, as well as a +4 circumstance bonus to AC against attempts to disarm you (per the disarm combat maneuver) of metal items that you’re holding, consuming 1 charge every hour."
  },
  {
    "source": "Pact Worlds pg. 198",
    "Name": "Magniscope",
    "Category": "Other",
    "Level": "4",
    "Price": "2,000",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "A magniscope is a set of goggles equipped with automated magnification-adjustment algorithms. A magniscope grants the same benefit as binoculars, but using it requires only one hand and no actions."
  },
  {
    "source": "Starfinder #14: Soldiers of Brass pg. 45",
    "Name": "Mechakata",
    "Category": "Other",
    "Level": "4",
    "Price": "2,000",
    "Hands": "—",
    "Bulk": "6",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This lionlike model can let out a tiny roar with a push of a button on its remote control or a computer with an added module that allows you to control it. A mechakata functions as a 1st-level mechanic’s combat drone, except it is Small and has no initial mods, no weapon mounts, no feats, and no ability to gain drone mods. Its skill unit is always Athletics. It cannot speak, but it does understand one language (chosen by you at time of purchase). You control it as if you were a 1st-level mechanic. A mechakata has a bite attack that deals 1d4 nonlethal piercing damage, and it is proficient with its bite attack (but it does not gain specialization with its bite attack). In addition, it can carry an item of light bulk or less in its jaws. It cannot make bite attacks while it is holding an item in its mouth."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Proximity Helmet",
    "Category": "Other",
    "Level": "4",
    "Price": "2,050",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "2/hour",
    "type": "Technological Items",
    "desc": "This open-faced, blue polymer helmet includes a nylon strap and adjustable tinted visor capable of hiding all but your mouth and chin. The interior of the tinted faceplate provides a heads-up display when activated, and while the helmet is activated, its external motion sensors pick up on sudden movements and subtle visual cues, granting you a +2 insight bonus to Perception checks to notice moving targets within 60 feet. A secondary setting on the helmet adds an audible alarm that creates a chirping sound near your ear whenever a Small or larger corporeal creature approaches within 60 feet, although a creature undetectable to normal vision (such as an invisible creature) does not trigger the alarm. Reduce this distance by 20 feet for each interposing closed door and each substantial interposing wall. This noise is loud enough to automatically wake you from sleep, but not loud enough to awaken nearby sleepers."
  },
  {
    "source": "Pact Worlds pg. 198",
    "Name": "Purifying Puck",
    "Category": "Other",
    "Level": "4",
    "Price": "2,000",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "1/round",
    "type": "Technological Items",
    "desc": "This circular device resembles the sort of tiny cleaning drone seen aboard space stations and larger vessels, but it has no independent programming. Law-enforcement officers use purifying pucks to clean up areas after they deploy smoke grenades and similar effects. As a standard action, you can activate a purifying puck and slide it across the ground a maximum of 30 feet (difficult terrain reduces this distance to 15 feet, at the GM’s discretion). The purifying puck then sucks in all smoke and vapors within a 20-foot-radius spread over the next 4 rounds, completely dispersing the effect (such as from a smoke grenade or the fog cloud spell). If the radius of an effect is smaller than 20 feet, the time it takes a purifying puck to disperse the effect is reduced proportionally. If the effect contains any toxins (such as a cloud of poisonous gas), the time is doubled. A purifying puck can’t disperse an effect that has a radius larger than 20 feet."
  },
  {
    "source": "Starfinder #16: The Blind City pg. 48",
    "Name": "Replenigel Megavitamin",
    "Category": "Other",
    "Level": "4",
    "Price": "300",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Replenigel is a nutritional gelatin interwoven with nanites that bolster the immune system. Originally designed by Abadarcorp during the war between the Pact Worlds and the Veskarium, replenigel is intended to provide a soldier with all of their daily nutritional needs and an added resistance to afflictions, while digesting slowly enough to require a soldier to eat only once per day. To minimize packaging costs, Abadarcorp commonly shipped replenigel to the front lines in 50-pound blocks that, unappetizingly, resembled marbled sulfur. After the conflict with the Veskarium ceased, the corporation found itself with a surplus of replenigel cubes and no way to sell them. A particularly savvy marketing executive realized that subtle tweaks to the product’s aesthetics could have a dramatic impact on its commercial viability. After extensive focus-group testing, Abadarcorp created Nutrimanders, reshaping the gelatin into sizable, 1-pound megavitamins molded to look like skittermanders and available in various artificial flavors and colors."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Solar Sheeting",
    "Category": "Other",
    "Level": "4",
    "Price": "2,000",
    "Hands": "—",
    "Bulk": "2",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "When you take a full action to unfurl this thin, 5-foot-square black panel, it absorbs solar energy and converts it into power, acting as a recharging station. In direct sunlight, it takes solar sheeting 10 minutes to recharge 1 charge in a battery or power cell. In overcast daytime conditions, it takes 1 hour per charge restored."
  },
  {
    "source": "Starfinder Armory pg. 101",
    "Name": "Domestic Drone, Basic",
    "Category": "Other",
    "Level": "4",
    "Price": "2,000",
    "Hands": "—",
    "Bulk": "Varies",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Grenade Scrambler, Mk 2",
    "Category": "Other",
    "Level": "4",
    "Price": "2,100",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "40",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "Affects grenades with an item level of 4 or lower."
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "Warning Wire, Mk 1",
    "Category": "Other",
    "Level": "4",
    "Price": "2,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 100",
    "Name": "Clearsight Goggles",
    "Category": "Other",
    "Level": "5",
    "Price": "2,750",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Those who explore environments obscured by fog, foliage, smoke, and other vision-impairing elements value clearsight goggles, a set of tight-fitting eyewear that can be worn under a helmet or even other eyewear. While you wear the goggles, fog, smoke, and similar gases don’t grant targets concealment from you, and vegetation doesn’t either. The trinket provides no benefit against a target with total concealment."
  },
  {
    "source": "Starfinder #36: Professional Courtesy pg. 50",
    "Name": "Emergency Surfacer",
    "Category": "Other",
    "Level": "5",
    "Price": "2750",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "When activated with a standard action, an emergency surfacer propels you to the surface at a rate of 100 feet per round for 10 rounds. You can release the surfacer at any time to stop your ascent (including at any point during the 100- foot movement per round); stopping this movement doesn’t require an action. An emergency surfacer ceases to function once it reaches the surface and has no effect above water. After use, an emergency surfacer must be recharged for 10 minutes in an atmosphere before it can be used again."
  },
  {
    "source": "Starfinder #26: Flight of the Sleepers pg. 45",
    "Name": "Ooze Stasis Flask",
    "Category": "Other",
    "Level": "5",
    "Price": "2,800",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "An ooze stasis flask is a transparent cylinder 12 inches long and 3 inches in diameter. One end of the cylinder features a latched and hinged flap. Designed to contain an ooze, the flask is reinforced on the interior with invisible force fields that harmlessly compress such a creature, which is usually inserted via the means of a funnel or other implements (a prod is often required to force the ooze to comply)."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Portable Gangway",
    "Category": "Other",
    "Level": "5",
    "Price": "2,700",
    "Hands": "—",
    "Bulk": "4",
    "Capacity": "40",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "When activated, this heavy, 1-foot-square metal box unfolds into a flat gangway up to 30 feet long and 10 feet wide that is capable of supporting up to 2 tons. The gangway is selfsupporting with struts that automatically unfold and brace it in place, as long as there is terrain to support the gangway on at least one end. The gangway can have an angle of up to 45 degrees when it is created, forming a ramp instead of a bridge. The portable gangway unfolds only partway if there isn’t room for the entire gangway, supporting as much of its size as can fit into the area. When a control stud at any of the gangway’s corners is pressed as a move action, the gangway refolds into a box around that stud, as long as there are no creatures or objects on the gangway."
  },
  {
    "source": "Starfinder #16: The Blind City pg. 48",
    "Name": "Sleeping Sentry",
    "Category": "Other",
    "Level": "5",
    "Price": "2,750",
    "Hands": "—",
    "Bulk": "15",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "The sleeping sentry is an exoskeletal harness equipped with an automated medical unit that can deliver pharmaceuticals intravenously, all mounted vertically atop a disk large enough for a Medium creature to stand on. Sleeping sentries are often used by eccentric corporations or military organizations that want round-the- clock non-automated security patrols but who don’t want to pay for multiple shifts. You activate a sleeping sentry by leaning back into the exoskeletal harness, allowing it to gently lock you into a standing position while supporting your neck, spine, legs, and arms. The automated medical unit then injects you with a cocktail of barbiturates that puts you instantly to sleep for the next 8 hours (or until awoken by the sleeping sentry); an unwilling creature forced into the harness can attempt a DC 17 Fortitude save to remain conscious. Shortly thereafter, antigravitry circuitry within the disc activates, suspending the entire structure approximately 1 inch off the ground and moving along a preprogrammed patrol route at a speed of 20 feet. The disc can move over land and over water, but not underwater."
  },
  {
    "source": "Starfinder #36: Professional Courtesy pg. 50",
    "Name": "Sonar Helmet",
    "Category": "Other",
    "Level": "5",
    "Price": "3000",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "40",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "When you wear this advanced headgear underwater, you gain blindsight (sound) with a range of 30 feet, blindsense (sound) with a range of 100 feet, and the ability to detect the presence of Medium or larger creatures at a distance of up to 1,000 feet (depending on conditions and subject to GM discretion). These senses apply only to creatures and objects within the same body of water in which you have line of effect."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 53",
    "Name": "Thief Drone",
    "Category": "Other",
    "Level": "5",
    "Price": "3,000",
    "Hands": "—",
    "Bulk": "4",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A thief drone is a specialized version of a "
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "Whisper Comm",
    "Category": "Other",
    "Level": "5",
    "Price": "3,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This tight choker with a tiny earbud operates as a comm unit’s wireless communication device with planetary range, but you can control audio connections with slight neck movements and communicate via subvocalization. Anyone observing you using a whisper comm must succeed at a DC 20 Perception or Sense Motive check to realize you are using it to communicate."
  },
  {
    "source": "Starfinder #15: Sun Divers pg. 53",
    "Name": "Micro Tap, Mk 3",
    "Category": "Other",
    "Level": "5",
    "Price": "750",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Nanite Hypopen, Purple",
    "Category": "Other",
    "Level": "5",
    "Price": "450",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 89",
    "Name": "Nanite Patch, Mk 2",
    "Category": "Other",
    "Level": "5",
    "Price": "425",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Restores 3d6 hp"
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Phrenic Scrambler, Clear",
    "Category": "Other",
    "Level": "5",
    "Price": "3,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "40",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "This is the most basic phrenic scrambler."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Scanner, Laser Microphone",
    "Category": "Other",
    "Level": "5",
    "Price": "2,725",
    "Hands": "2",
    "Bulk": "L",
    "Capacity": "10",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "This handheld sensor allows you to hear through normally sound-impervious materials at great range. It grants you sense through (hearing) with a range of 120 feet, but only through materials that are 1 inch thick or thinner, and each Perception check attempted using it takes a full action, during which you are flat-footed."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Strategy Game, Imperial Conquest",
    "Category": "Other",
    "Level": "5",
    "Price": "2,850",
    "Hands": "—",
    "Bulk": "2",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "Imperial conquest is an ancient board game with deceptively simple rules and great strategic depth, and it is typically played via an elaborate holographic interface. Up to four people can play a game of imperial conquest, which generally takes 30 minutes per player. At the end of an uninterrupted game, each character who played attempts a DC 20 Intelligence check, with success granting tactical insights. For the next 8 hours, any character who succeeded at the Intelligence check gains a +1 bonus to AC against attacks of opportunity; when two players who succeeded at the Intelligence check flank the same enemy during this time, the bonus to attack rolls from flanking increases by 1. You cannot gain the advantage from more than one game of imperial conquest at a time."
  },
  {
    "source": "Starfinder #26: Flight of the Sleepers pg. 50",
    "Name": "Analeptic Tablet",
    "Category": "Other",
    "Level": "6",
    "Price": "600",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This 2-inch-long oblong tablet contains a miniaturized scanner and 3D printer wrapped in a smooth, protective shell. An analeptic tablet must be ingested by a living creature (a standard action) or fed to an unconscious character with a full glass of water (a full action). The tablet automatically activates if the creature has already taken any ability score damage or is suffering from the effects of an affliction; otherwise it sits inactive within the creature’s stomach until the creature takes ability score damage or is affected by an affliction. One hour later, the analeptic tablet heals the target of all ability damage or moves the creature one step toward healthy on any affliction track they are on (this doesn’t cure the affliction, so unfortunate victims of fast-acting poisons might die before the analeptic tablet can do its work)."
  },
  {
    "source": "Starfinder #16: The Blind City pg. 47",
    "Name": "Blabbersponder",
    "Category": "Other",
    "Level": "6",
    "Price": "4,450",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "1/day",
    "type": "Technological Items",
    "desc": "This small, rectangular box is approximately the size of a handheld computer, with a nondescript carbon-fiber housing attached to an external chip interface that can be plugged into the computers of most starships. A blabbersponder’s case is filled with a compact array of microsensors (often composed of inubrix) connected to a miniaturized computer (treat as a tier 0 computer equipped with a control module) that, bolstered by a signal booster, analyzes and actively transmits a starship’s vital data to another source. While no astute starship captain would ever install a blabbersponder on their own ship, such devices are often sold in gray markets to saboteurs serving the whims of corporations, or bounty hunters who wish to gain vital information about a specific starship’s defenses. Some clever pirates of the Diaspora are also rumored to sell blabbersponders to gullible spacefarers by offering them as upgrades to starship communication systems. They then use the data they collect from the device to determine if the cargo, defenses, weapons, and crew aboard the ship warrant the effort of intercepting and ambushing it later."
  },
  {
    "source": "Starfinder Armory pg. 102",
    "Name": "Electroviscous Cloak",
    "Category": "Other",
    "Level": "6",
    "Price": "4,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "1/round",
    "type": "Technological Items",
    "desc": "This thin cloak is infused with conductive wiring and a polymer that changes states when charged with a specially modulated current. When you activate the cloak as a move action, its exterior becomes a frictionless gel, granting you a +2 circumstance bonus to your AC against grapple combat maneuvers and to Acrobatics checks to escape from a grapple or pin. In addition, when squeezing, you do not gain the entangled condition, though you still move at half speed and can’t run or charge."
  },
  {
    "source": "Starfinder #37: The White Glove Affair pg. 29",
    "Name": "Noise Dampener",
    "Category": "Other",
    "Level": "6",
    "Price": "4300",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "40",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "A small, nondescript disc about the size of a keycard, a noise dampener controls sound within in its area using specialized sonic waves. As a standard action, you can activate a noise dampener by attaching it to a flat surface. Once activated, it affects a 30-foot radius. Sounds within this radius can’t be heard beyond the radius, and sounds beyond the radius can’t be heard within it."
  },
  {
    "source": "Alien Archive 2 pg. 101",
    "Name": "Plasma Diverter",
    "Category": "Other",
    "Level": "6",
    "Price": "4,300",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This bandolier emits a low, crackling hum when activated. Whenever an attack from a plasma weapon hits the plasma diverter’s user, half of the electricity and half the fire damage (maximum 5 points of each) is prevented and instead restores a number of charges equal to the damage prevented to the plasma diverter’s battery. If this would restore more charges than the battery can hold, the battery must succeed at a DC 15 Fortitude saving throw or be destroyed, dealing 1d6 damage to the plasma diverter per excess charge."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Smart Cable",
    "Category": "Other",
    "Level": "6",
    "Price": "4,000/10 ft.",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This thick industrial cable of woven plastic contains special chains of chemicals that contract, expand, and twist when they receive electronic signals. A length of smart cable has a narrow battery pack near one end. When you activate the cable, you can change its shape by sending signals from a datapad or comm unit. You can command the smart cable to coil, uncoil, tie itself around objects, or go rigid. In addition, you can cause periodic sections of the cable to crimp, allowing creatures to treat it as a knotted rope for the purposes of using Athletics to climb. Commanding a smart cable requires a move action."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Spy Drone",
    "Category": "Other",
    "Level": "6",
    "Price": "4,550",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "A spy drone is a Tiny remote drone designed specifically to make observations at a distance. This acts as the flight drone of a 1st-level mechanic (and you control it as if you were a 1st-level mechanic, using its remote control or a computer with an added module to control the spy drone), except it cannot make any attacks and it has no weapon mounts, no feats, and no ability to add drone mods. Its skill unit is always Stealth. It cannot speak, but it does understand one language (chosen by you at the time of purchase) and allows you to attempt Perception checks using your own bonus when you directly control it (as the master control ability of a mechanic drone)."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Subdermal Extractor",
    "Category": "Other",
    "Level": "6",
    "Price": "3,850",
    "Hands": "1",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "This vicious-looking clawed wand is used to detect and quickly remove foreign objects from under the skin. You can use the subdermal extractor only on an unconscious or willing target. The clawed end of the subdermal extractor contains a delicate sensor that evaluates the target’s genetic material and scans for foreign objects (including alien eggs, biotech and cybernetic augmentations, tracking chips, etc.). To detect an anomalous object, you take a move action and must succeed at a Computers or Medicine check with a DC equal to 15 or 10 + the level of the implanted item, whichever is higher. If the implanted material was injected as part of a creature’s attack, the DC is instead 15 + the CR of the attacking creature. As a standard action, you can deploy the subdermal extractor to remove anomalous material you have detected. This typically requires a successful DC 25 Medicine check, but this DC might be lower or higher at the GM’s discretion (such as if the item is particularly small or if it has woven itself into the target’s interior physiology). Whether or not you succeed or fail at the check, the target takes 1d6 slashing damage from the attempt. Each detection attempt uses a charge from the subdermal extractor, as does each removal attempt. You can use a subdermal extractor on yourself, but the DCs of skill checks to use it are increased by 2."
  },
  {
    "source": "Pact Worlds pg. 199",
    "Name": "Tracking Bug",
    "Category": "Other",
    "Level": "6",
    "Price": "4,250",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This tiny tracking device contains a miniaturized transponder that makes it easier to follow and locate quarry. Tracking bugs are usually sold on Absalom Station to private detective agencies and suspicious family members. You can hide a tracking bug on a creature as a standard action with a successful Sleight of Hand check to pick the creature’s pocket (this usually can’t be done during combat). You can hide a tracking bug on a vehicle or other conveyance as a standard action with a successful Sleight of Hand check opposed by the Perception checks of anyone searching the vehicle; you gain a +4 circumstance bonus to this check due to the tracking bug’s size."
  },
  {
    "source": "Starfinder Armory pg. 105",
    "Name": "Mimic Imager, Helmet-Mounted",
    "Category": "Other",
    "Level": "6",
    "Price": "4,150",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "4/round",
    "type": "Technological Items",
    "desc": "The most common mimic imagers are mounted to a helmet on a swiveling, telescoping rod. When you activate the mimic imager, it takes 1 round to circle you and scan your current appearance. The round after you activate the mimic imager, it creates a holographic duplicate of you in a square (or squares, if you are a Large creature) within 20 feet that you designate. This hologram includes minor sounds but not understandable speech. The hologram then mimics your actual movements (walking forward as you walk forward, raising a gun as you do, and so on) while maintaining the same distance from you. You must always remain within 20 feet of the image and maintain line of sight to it, or the image winks out with a flash of static. Detecting the duplicate as being a hologram requires a move action and a successful DC 20 Perception check. If you deactivate the mimic imager or it runs out of charges, the mimic imager must rescan you the next time it is activated."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Musical Instrument, Euphonic",
    "Category": "Other",
    "Level": "6",
    "Price": "4,500",
    "Hands": "—",
    "Bulk": "Varies",
    "Capacity": "80",
    "Usage": "1/10 minutes",
    "type": "Technological Items",
    "desc": "These instruments are specifically designed to stir nearby listeners with thrumming chords and subliminal riffs that most races find uplifting. While playing an activated euphonic musical instrument, you can attempt a DC 20 Profession (musician) check as a move action; on a success, you can suppress the fascinated or shaken condition on allies within 30 feet for 1 round, plus 1 additional round for every 5 by which your check exceeds the check’s DC. This doesn’t change the duration of the condition; if the duration would continue after your uplifting performance ends, the ally immediately regains the condition that was suppressed."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Nanite Hypopen, Black",
    "Category": "Other",
    "Level": "6",
    "Price": "650",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Pact Worlds pg. 198",
    "Name": "Antigravity Belt",
    "Category": "Other",
    "Level": "7",
    "Price": "6,500",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "1/round",
    "type": "Technological Items",
    "desc": "Most commonly used by those brave enough to travel to the high-gravity world of Aucturn, this belt uses a form of graviton levitation to essentially reduce gravitational pull. You can activate the belt as a swift action, and it operates until you spend another swift action to deactivate it or until it runs out of charges. You treat areas of extreme gravity as having high gravity, areas of high gravity as having standard gravity, and areas of standard gravity as having low gravity. This belt has no effect in areas that naturally have low gravity or zero gravity."
  },
  {
    "source": "Starfinder #20: The Last Refuge pg. 44",
    "Name": "Organic Printing Vat",
    "Category": "Other",
    "Level": "7",
    "Price": "5,400",
    "Hands": "—",
    "Bulk": "3",
    "Capacity": "40",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This container made of transparent glass is about the size of a backpack (and can be worn like one, though it can’t store any items). An organic printing vat allows you to craft technological devices (including weapons and armor) and computers out of biological matter. You still need to have the requisite number of ranks in Computers or Engineering and an amount of UPBs equal to the price of the item to be created, and the process takes the same amount of time, but the organic printing vat counts as the necessary tools and workshop space. You can craft only items of 2 bulk or less, but any item you craft gains the analog and living weapon special properties and isn’t considered a manufactured item (and is therefore immune to spells such as entropic grasp). If an item created with an organic printing vat is destroyed, it dissolves into a biological sludge that counts as a number of UPBs equal to 15% of the item’s value that can be used to create another item with the organic printing vat."
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "Traction Holster",
    "Category": "Other",
    "Level": "7",
    "Price": "6,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "80",
    "Usage": "10/minute",
    "type": "Technological Items",
    "desc": "This flat, metal plate usually appears to be a simple rectangle about 1 foot long with a textile belt or armband firmly attached to one side. As a full action, you can activate a traction holster by pressing a longarm, one-handed melee weapon, small arm, or piece of equipment of no more than 1 bulk flat against it, creating a quasi-magnetic bond with the weapon. Only one weapon at a time can be paired in this way. Thereafter, when you drop the weapon or it would otherwise land adjacent to you, it is automatically drawn into the traction holster as though you had spent a move action to sheathe or holster it. The holster does not protect a paired weapon against disarm combat maneuvers. A traction holster operates until it runs out of charges or until you take a full action to break the connection between the traction holster and its current weapon by holding down a small reset button."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Scanner, Motion Detector",
    "Category": "Other",
    "Level": "7",
    "Price": "6,000",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "10",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This handheld scanner is capable of detecting sweeping kinetic moves, such as the locomotion of creatures and vehicles. Motion detectors have blindsense (vibration) out to 30 feet, but you must take a move action each round to use the sensor."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Swarmproof Bangles, Advanced",
    "Category": "Other",
    "Level": "7",
    "Price": "6,500",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "40",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "Advanced swarmproof bangles generate a more precise modulating field that impedes more than just vermin. You are not entangled when using advanced swarmproof bangles, and you have DR 10/— against the swarm attack of Fine creatures and DR 5/— against the swarm attack of Diminutive creatures. You also gain a +4 bonus to your AC against attacks by nanites or nanobots, such as those created by the "
  },
  {
    "source": "Pact Worlds pg. 198",
    "Name": "Autoclaw",
    "Category": "Other",
    "Level": "8",
    "Price": "9,000",
    "Hands": "2",
    "Bulk": "1",
    "Capacity": "40",
    "Usage": "1/round",
    "type": "Technological Items",
    "desc": "This advanced device has adjustable arms that can be folded into multiple configurations, allowing you to bend, open, and twist objects made of metal and other durable materials. Powered by electric motors, an autoclaw takes 1 minute to configure for a specific task and has an effective Strength score of 30 (a +10 bonus) for the purpose of attempting Strength checks to break down doors and similar efforts; your own Strength score doesn’t affect checks attempted with the autoclaw."
  },
  {
    "source": "Starfinder Armory pg. 103",
    "Name": "Envoy\u0027s Mouthpiece",
    "Category": "Other",
    "Level": "8",
    "Price": "9,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "20",
    "Usage": "2/hour",
    "type": "Technological Items",
    "desc": "Popularized by successful lashunta diplomats, an envoy’s mouthpiece is an elegant circlet with slender arms that reach down along the jaw. Two thin earpieces extend from the band to slip unobtrusively into your ears once the mouthpiece is donned. When created, an envoy’s mouthpiece is encoded with one specific language. Whenever the language is spoken within 30 feet of you, the mouthpiece translates that language into Common. In addition, any words you speak in Common are transformed by the mouthpiece into the encoded language, allowing conversation to take place between you and speakers of the encoded language. An envoy’s mouthpiece cannot be used to translate languages other than the one it has been programmed to translate, although devices that translate into languages other than Common do exist. An envoy’s mouthpiece automatically records any words it translates, allowing anything translated through the device to be replayed through its earpiece at the touch of a button located on the lower right side. Up to 10 continuous hours can be recorded in this manner. Holding the button down for a full round erases any currently stored conversations."
  },
  {
    "source": "Starfinder #16: The Blind City pg. 47",
    "Name": "Flushbuster",
    "Category": "Other",
    "Level": "8",
    "Price": "1,300",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A flushbuster is a palm-sized, malleable, one-use satchel charge designed specifically to travel easily through any water-propagated waste-removal system (such as those found on many planets with standard gravity and aboard some starships). It resembles a vacuum-sealed plastic bag divided into two pouches, one containing a substance that looks like purple clay, and the other containing a substance that resembles green gelatin. The bag itself is made of a time-release polymer that instantaneously disintegrates after 1d4 minutes of immersion in water, allowing the two volatile substances within to mix into a composite explosive that immediately detonates. Once the bag disintegrates, the mixture of the composite explosive and water generates a massive pressurized explosion that overloads the pipe system, causing any toilet or latrine within 100 feet of the device and connected to it by pipe to explode violently. Each creature or object within a 10-foot radius of any exploding toilet takes 4d6 bludgeoning damage (Reflex DC 12 half) and watery sewage begins flooding into the room (filling a 15-foot-by-15-foot room with 1 foot of water per round). A creature that begins its turn within this sewage must succeed at a DC 12 Fortitude save or gain the sickened condition for 1 minute. Any creature adjacent to an exploded toilet can spend a full action to attempt a DC 20 Engineering check to stop the flooding in that specific room."
  },
  {
    "source": "Starfinder Armory pg. 104",
    "Name": "Hoverskates",
    "Category": "Other",
    "Level": "8",
    "Price": "8,500",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "20",
    "Usage": "1/10 minutes",
    "type": "Technological Items",
    "desc": "These stylish boots contain antigravity circuitry that, when activated, suspends you approximately 1 inch off the ground. You do not count as flying when using hoverskates; you move at your normal land speed when wearing them. You can walk both overland and over water (but not underwater), and you can ignore difficult terrain. When you take a move action to move your speed, you can increase your land speed by 20 feet by overcharging your hoverskates. This extra movement is treated as an enhancement bonus. The hoverskates must cool down for 1 minute before you can overcharge them again."
  },
  {
    "source": "Starfinder #26: Flight of the Sleepers pg. 15",
    "Name": "Gray Comm Unit, System-wide",
    "Category": "Other",
    "Level": "8",
    "Price": "9,000",
    "Hands": "—",
    "Bulk": "40",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A gray comm unit with a system-wide range typically takes up 10 or so cubic feet, much of it a network of wire and crystals set within a wall unit."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Grenade Scrambler, Mk 3",
    "Category": "Other",
    "Level": "8",
    "Price": "9,300",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "40",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "Affects grenades with an item level of 8 or lower. Affected grenades with an item level of 3 or lower automatically miss."
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "Warning Wire, Mk 2",
    "Category": "Other",
    "Level": "8",
    "Price": "8,800",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 98",
    "Name": "Autocartographer",
    "Category": "Other",
    "Level": "9",
    "Price": "13,500",
    "Hands": "1",
    "Bulk": "1",
    "Capacity": "100",
    "Usage": "10/hour",
    "type": "Technological Items",
    "desc": "This handheld holographic display unit has an underslung rack housing dozens of miniaturized flying microbots. When you activate the autocartographer, you pick a grid intersection within 50 feet to which you have line of effect. The microbots scatter in a 100-foot cube, scanning the environment and sending data back to the display unit for aggregation and analysis. The microbots transmit the dimensions and basic layout of rooms, corridors, and sizable natural features, including large furnishings. Their sensors ignore living creatures, fine details (such as images on computer screens), and temporary magical effects, but they record permanent ones, including illusory obstacles. They can’t differentiate between illusions or holograms and real objects. The microbots’ data is sent by a wireless signal and is therefore vulnerable to countermeasures such as signal jammers."
  },
  {
    "source": "Starfinder #37: The White Glove Affair pg. 29",
    "Name": "Short-circuit Grenade",
    "Category": "Other",
    "Level": "9",
    "Price": "2000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A short-circuit grenade emits a powerful electrical signal on impact. It has a 20-foot range increment and a capacity of drawn, and its explode special property creates an electromagnetic pulse in a 10-foot radius; technological constructs within this area take 2d6 electricity damage and must succeed at a Fortitude save or be stunned for 1d4 rounds."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Nanite Hypopen, White",
    "Category": "Other",
    "Level": "9",
    "Price": "2,300",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 89",
    "Name": "Nanite Patch, Mk 3",
    "Category": "Other",
    "Level": "9",
    "Price": "1950",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Restores 6d6 hp"
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Phrenic Scrambler, Viridian",
    "Category": "Other",
    "Level": "9",
    "Price": "13,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "40",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "A phrenic scrambler with a viridian crystal also imparts a –1 penalty to saving throws against all spells or effects with the emotion, fear, mind-affecting, or pain descriptor within 30 feet."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Scanner, True-Frame Camera",
    "Category": "Other",
    "Level": "9",
    "Price": "12,250",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "100",
    "Usage": "2/hour",
    "type": "Technological Items",
    "desc": "A true-frame camera functions as an enhanced camera, and it also has supplemental multispectrum programming designed to detect the slight errors in shading and lighting that are artifacts of holograms and illusions. True-frame cameras automatically shift to variant wavelengths to detect and image actual objects, identifying the holograms and illusions as such with overlay text or masking. True-frame cameras automatically identify holograms and illusions via sense through (vision), except for images that specifically fool cameras or other surveillance systems (such as "
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Scanner, X-Ray Visor",
    "Category": "Other",
    "Level": "9",
    "Price": "15,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "1/round",
    "type": "Technological Items",
    "desc": "This sensor is worn as an adjustable viewer resting over the eyes, like goggles or thick glasses. It sends out X-rays and interprets the information gathered as an image it imposes over your normal vision. This grants "
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 44",
    "Name": "Bug Snare",
    "Category": "Other",
    "Level": "10",
    "Price": "740",
    "Hands": "2",
    "Bulk": "2",
    "Capacity": "20",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "A reusable battlefield trap that SDF soldiers deploy to secure locations and encampments against wild animals and smaller Swarm foes, a bug snare is four large metallic claws that extend outward from a central point and snap shut when disturbed. As a full action, you can set a bug snare at an intersection to cover a 5-foot radius. The next creature that steps into that radius sets off the trap and must succeed at a DC 13 Reflex save or take 1d4 piercing damage and gain the entangled condition until it (or an adjacent ally) can extricate itself with a successful DC 14 Strength check as a standard action. An included wireless remote control can be used to disarm the trap from 15 feet away as a move action. You can attempt to hide a bug snare from view with a Stealth check (this check is opposed by the Perception check of a potential target). You can attach a bug snare to a fixed object (such as a nearby tree) with a length of cable line, rendering a trapped creature immobile, but this grants any creature attempting to spot a hidden bug snare a +2 circumstance bonus to its Perception check."
  },
  {
    "source": "Starfinder #20: The Last Refuge pg. 44",
    "Name": "DNA Scrambler",
    "Category": "Other",
    "Level": "10",
    "Price": "17,400",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This small gun-shaped device uses acute microwave radiation to scramble the DNA of living creatures caught in its area of effect. It was accidentally invented by shirren scientists attempting to understand Swarm biology and turned into an effective nonlethal, albeit pain-inducing, weapon. While wielding a DNA scrambler in one-hand, you can activate it as a standard action, dealing 3d8 nonlethal damage to all living targets in a 30-foot cone as their DNA unravels. This causes a great deal of pain, imparting the off-target condition on each living creature in the cone for 1 round. A creature who DC 19 Fortitude saving throw halves the damage and negates the off-target condition. This is a pain effect."
  },
  {
    "source": "Starfinder #28: The Hollow Cabal pg. 52",
    "Name": "Fungal Bomb",
    "Category": "Other",
    "Level": "10",
    "Price": "2,750",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "These sealed and pressurized glass tubes are filled with a substance derived from dycepskian spores. Each can be used only once. When a fungal bomb explodes, it releases a cloud of modified spores in a 20-foot-radius spread. This is a disease effect. Creatures in this area must succeed at a Fortitude save or be sickened for 1 day. If a sickened creature spends Resolve to recover Stamina Points, it can attempt this saving throw again, ending the sickened condition on a success."
  },
  {
    "source": "Starfinder Armory pg. 104",
    "Name": "Inductive Bandolier",
    "Category": "Other",
    "Level": "10",
    "Price": "19,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "100",
    "Usage": "2/minute",
    "type": "Technological Items",
    "desc": "This heavy bandolier’s large, flat buckle is a metallic charging pad that charges synced devices that are within a few inches of your body, including light or heavy armor or armor upgrades installed in light or heavy armor. While the bandolier is activated, you can tap a rechargeable item to the pad to sync the item to the bandolier (the item must use charges or a battery; the inductive bandolier can’t recharge other items). The synced item regains 1 charge per minute until it is fully charged or until the synced item is more than a few inches from your body. In either case, the item is no longer synced and the bandolier vibrates slightly to alert you to the lost connection. The inductive bandolier expends its charges as long as it is activated, whether or not an item is synced to it."
  },
  {
    "source": "Starfinder Armory pg. 101",
    "Name": "Domestic Drone, Elite",
    "Category": "Other",
    "Level": "10",
    "Price": "18,000",
    "Hands": "—",
    "Bulk": "Varies",
    "Capacity": "100",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Emergency Raft, Hovercraft",
    "Category": "Other",
    "Level": "10",
    "Price": "17,800",
    "Hands": "—",
    "Bulk": "4",
    "Capacity": "40",
    "Usage": "Varies",
    "type": "Technological Items",
    "desc": "This emergency hovercraft is more luxurious and capable than its basic counterpart, and it is 2 feet wide and 4 feet long in its compact form. When activated, it unfolds into a hover pod, except that it has 40 Hit Points, is broken when reduced to or below 20 Hit Points, provides no bonus to Piloting checks, and has no autocontrol system. As a move action, you can return the hovercraft to its portable shape at the touch of a button, as long as no objects or creatures remain inside. An emergency hovercraft consumes 2 charges when you activate or collapse it, and it consumes 1 charge for every 10 minutes (or fraction thereof) its engines are in operation. You can power down its engines so that it doesn’t consume charges; like a basic emergency raft, it comes with four oars for rowing."
  },
  {
    "source": "Starfinder Armory pg. 98",
    "Name": "Bypass Subroutine",
    "Category": "Other",
    "Level": "11",
    "Price": "23,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A bypass subroutine is a miniaturized single-function computer which takes the form of a ring with four nanite circuit-nodes and can be sized to fit nearly any finger. The compact nanites are attuned to input from the circuit-nodes and can form specific tools much larger than the ring itself as directed by information stored within the circuit-node. Infiltrators utilize these high-tech metal bands to assist in covert missions. Aspis Consortium agents also use these rings to ensure that locks that were opened appear as if they were never tampered with."
  },
  {
    "source": "Starfinder Armory pg. 105",
    "Name": "Mimic Imager, Hovering",
    "Category": "Other",
    "Level": "11",
    "Price": "24,500",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "4/round",
    "type": "Technological Items",
    "desc": "A hovering mimic imager is a 2-inch-wide spherical microbot with more sophisticated imaging software and data on your movements, speech, and mannerisms. The hovering mimic imager operates as the helmet-mounted version, except that the hologram created by the hovering mimic imager can also mimic speech in your voice, and the DC of Perception checks to identify the hologram is 30. As the hovering mimic imager isn’t attached to you, the image can be up to 100 feet from you and doesn’t require line of sight to you (although it must be within 20 feet of and have line of sight to the microbot). The hovering mimic imager can receive your directions by voice or via a signal from a personal comm unit or a datapad with a control module installed. The hovering mimic imager has sound baffling and a light-shifting shell to avoid detection, but a creature can notice it with a successful DC 25 Perception check. Detecting the microbot doesn’t automatically reveal that your duplicate is a hologram, but its presence can provide creatures a clue that something unusual is going on. The hovering mimic imager is a Tiny technological construct with an AC of 20, hardness 8, 10 Hit Points, and a fly speed of 40 feet with perfect maneuverability. It cannot make attacks, and it fails any saving throw it is required to make. When the mimic imager has only 4 charges remaining, the hologram winks out and the hovering mimic imager immediately returns to you if it can. Your communication with a hovering mimic imager uses a wireless signal, and is therefore vulnerable to countermeasures such as signal jammers."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Nanite Hypopen, Gray",
    "Category": "Other",
    "Level": "11",
    "Price": "3,500",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 103",
    "Name": "Flash Shield Generator",
    "Category": "Other",
    "Level": "12",
    "Price": "32,000",
    "Hands": "1",
    "Bulk": "1",
    "Capacity": "100",
    "Usage": "10/use",
    "type": "Technological Items",
    "desc": "This scepter-like device coalesces atmosphere into a crystalline sheet. When you activate a flash shield generator, you select one edge of a square within 10 feet of you and create a 5-footsquare vertical sheet of translucent crystal on that edge, providing partial cover against attacks coming from one side of the sheet (your choice). The flash shield must be supported by the ground or another structure when it is created, and it can’t support any weight. You can make the flash shield cloudy when you create it, which causes it to block line of sight. The flash shield is delicate and easy to break; it has an AC of 10, hardness 0, and 10 Hit Points. A flash shield disintegrates on its own after 24 hours. If you create a new flash shield within 100 feet of an existing shield, the old shield disappears, its material evaporated and transformed to create the new shield. A flash shield generator does not function where there is no atmosphere."
  },
  {
    "source": "Starfinder Armory pg. 103",
    "Name": "Emotion Regulator, Advanced",
    "Category": "Other",
    "Level": "12",
    "Price": "37,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "100",
    "Usage": "1/10 minutes",
    "type": "Technological Items",
    "desc": "An advanced emotion regulator is more effective at suppressing a broader range of extreme emotions, granting you a +2 insight bonus to saves against emotion, fear, mind-affecting, and pain effects. In addition, you are undetectable to blindsense (emotion) and blindsight (emotion). An advanced emotion regulator does not impart penalties."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Grenade Scrambler, Mk 4",
    "Category": "Other",
    "Level": "12",
    "Price": "35,000",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "40",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "Affects grenades with an item level of 12 or lower. Affected grenades with an item level of 7 or lower automatically miss."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Nanite Hypopen, Green",
    "Category": "Other",
    "Level": "12",
    "Price": "5,600",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "Warning Wire, Mk 3",
    "Category": "Other",
    "Level": "12",
    "Price": "32,900",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "40",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive pg. 57",
    "Name": "Memory Expunger",
    "Category": "Other",
    "Level": "13",
    "Price": "50,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This metal-and-glass disk is 4 inches in diameter and has a small red button along its perimeter. By presenting the disk to a creature within 10 feet and pressing the button (all a standard action), you can erase the last 5 minutes of that creature’s memory as per "
  },
  {
    "source": "Starfinder #6: Empire of Bones pg. 30",
    "Name": "Spear of Fates",
    "Category": "Other",
    "Level": "13",
    "Price": "102,300",
    "Hands": "2",
    "Bulk": "2",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "\u003cb\u003e\u003ci\u003eWARNING: This entry contains spoilers for the Dead Sun Adventure Path.\u003c/i\u003e\u003c/b\u003e"
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Phrenic Scrambler, Violet",
    "Category": "Other",
    "Level": "13",
    "Price": "49,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "40",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "A phrenic scrambler with a violet crystal instead imparts a –2 penalty to saving throws against spells or effects with the emotion, fear, mind-affecting, or pain descriptor within 30 feet and allows you to set whether certain descriptors are included or excluded from this penalty as a move action (for example, you can impart the penalty against emotion and pain descriptors only)."
  },
  {
    "source": "Starfinder Armory pg. 100",
    "Name": "Carter\u0027s Baton",
    "Category": "Other",
    "Level": "14",
    "Price": "65,000",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "80",
    "Usage": "8/round",
    "type": "Technological Items",
    "desc": "This flanged rod allows you to control gravitational forces around a single object within 100 feet. When you activate the baton, you can move an object of no more than 25 pounds or 2 bulk up to 20 feet per round in any direction (including up or down), but you can’t move it farther than 100 feet from you. If you attempt to move an object that another creature is holding, that creature can attempt a DC 15 Reflex save to prevent you from removing the object from its grasp."
  },
  {
    "source": "Alien Archive 4 pg. 39",
    "Name": "Nanite Capsules",
    "Category": "Other",
    "Level": "14",
    "Price": "12",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "As a move action, you can swallow this silvery, one-time-use pill to hopefully gain an edge on the competition, though you risk deleterious side effects. Roll 1d6 on the table below to determine the nanite capsule’s effect; each effect lasts for 1 hour, and you can be under the effect of only one nanite capsule at a time. "
  },
  {
    "source": "Starfinder #16: The Blind City pg. 47",
    "Name": "Neuropoppet",
    "Category": "Other",
    "Level": "14",
    "Price": "65,000",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "40",
    "Usage": "1/use",
    "type": "Technological Items",
    "desc": "A neuropoppet is a small simulacrum of a featureless humanoid creature, composed of a malleable eggshell-white polymer that is wirelessly linked to a tiny needle-shaped neural receiver. The receiver can be loaded into any ranged weapon that uses darts as ammunition, though it deals no damage to a target when fired (nor can it impose any critical hit effects). Instead, the receiver embeds into the target’s body, injecting a small numbing agent into the target’s bloodstream, making them unaware of the embedded receiver unless they or an adjacent ally succeeds at a Perception check (DC \u003d the result of your attack roll to embed the receiver). Once found, the receiver can be removed with a standard action and a successful DC 30 Medicine check. The signal sent from a neuropoppet to the neural receiver can be jammed with a signal jammer."
  },
  {
    "source": "Starfinder Armory pg. 108",
    "Name": "Synaptic Link",
    "Category": "Other",
    "Level": "14",
    "Price": "75,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "100",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "These heavy headbands resemble woven insect chitin and always come in pairs. Each headband has a capacity of 100 and uses 5 charges per round. When you and another creature wear and activate the headband, you both benefit from a psychic communion that transmits information about danger between you instantaneously as long as you are within 60 feet of each other. While connected in this way, both wearers gain a +2 insight bonus to initiative and Perception checks. If one wearer is aware of a combatant, the other wearer is also aware of it, and a wearer cannot be surprised unless the other wearer is also surprised. If one wearer succeeds at a Will save to disbelieve an illusion effect, the other wearer also disbelieves that effect. This link does not otherwise allow thoughts or communication to be shared."
  },
  {
    "source": "Starfinder #26: Flight of the Sleepers pg. 15",
    "Name": "Gray Comm Unit, Unlimited",
    "Category": "Other",
    "Level": "14",
    "Price": "72,000",
    "Hands": "—",
    "Bulk": "120",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Few have seen these massive gray comm unit units, which take up a small room and highjack Drift beacons to transmit their telepathic signals across interstellar distances."
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Nanite Hypopen, Red",
    "Category": "Other",
    "Level": "14",
    "Price": "11,500",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Alien Archive 3 pg. 81",
    "Name": "Entanglement Badges",
    "Category": "Other",
    "Level": "15",
    "Price": "110,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "2/use",
    "type": "Technological Items",
    "desc": "Entanglement badges are crafted in pairs and link those who wear them at a quantum level. An entanglement badge can be activated or deactivated as a move action, and both badges must be worn and activated to function properly. In addition, the wearers of the two badges must be within 200 feet of each other to use them. When the wearer of the linked badge takes damage, you can, as a reaction, reduce the amount of damage they take by half, taking that amount of damage yourself; you can’t reduce this damage in any way. Once per day as a reaction, you can use the result of the linked badge’s wearer’s saving throw for an effect that affects you both instead of your own."
  },
  {
    "source": "Starfinder Armory pg. 103",
    "Name": "Grounding Boots",
    "Category": "Other",
    "Level": "15",
    "Price": "105,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "100",
    "Usage": "1/minute",
    "type": "Technological Items",
    "desc": "When activated, these heavy boots create an electromagnetic field around you that disperses electrical current into the ground. You gain electricity resistance 15, and as long as you are standing on any surface larger than you are, creatures adjacent to you gain electricity resistance 5."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Regeneration Table",
    "Category": "Other",
    "Level": "16",
    "Price": "45,000",
    "Hands": "2",
    "Bulk": "20",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A regeneration table is a medical bed that uses the most advanced medical technology known in the Pact Worlds to restore a creature’s body to full function from nearly any mishap or injury, including death. It does this with quantumlocked nanites held in a suspended state from which they can become nearly any form of matter, including stem cells for biological creatures or mechanical components for artificial creatures like androids or Akiton’s anacites. The table both reads the creature’s own genetic code (or equivalent data) and uses supercomputing predictive algorithms to determine what damage or affliction is present, then attempts to restore the subject to perfect health based on that information."
  },
  {
    "source": "Alien Archive 3 pg. 81",
    "Name": "Superposition Belt",
    "Category": "Other",
    "Level": "16",
    "Price": "180,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "2/use",
    "type": "Technological Items",
    "desc": "A superposition belt contains a series of conductive filaments attached to a small, sturdy container that holds material collected from a quantum slime. When worn, you can activate the belt as a standard action to teleport yourself to a square 30 feet away to which you have line of sight. After using this item, you can’t take any other actions until your next turn, but you gain the benefits of "
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Grenade Scrambler, Mk 5",
    "Category": "Other",
    "Level": "16",
    "Price": "165,000",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "100",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "Affects grenades with an item level of 16 or lower. Affected grenades with an item level of 11 or lower automatically miss."
  },
  {
    "source": "Starfinder Armory pg. 107",
    "Name": "Quantum Boxes",
    "Category": "Other",
    "Level": "17",
    "Price": "250,000",
    "Hands": "—",
    "Bulk": "2",
    "Capacity": "100",
    "Usage": "See text",
    "type": "Technological Items",
    "desc": "These silvery boxes always come in pairs, and while powerful corporations use them to smuggle items of great value, their potential applications are virtually limitless. By spending 1 minute, you can seal one item of up to 1 bulk into each quantum box, subjecting the contents of each box to quantum entanglement. This uses 25 charges and causes both items to effectively cease to exist, including for the purposes of spells and effects such as "
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Personal Phase Shifter",
    "Category": "Other",
    "Level": "18",
    "Price": "380,000",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "100",
    "Usage": "10/round",
    "type": "Technological Items",
    "desc": "A personal phase shifter works on a subatomic level to allow atoms to pass out of phase with one another. In practice, this allows the affected material to exist without interacting with other physical material. A personal phase shifter is a formfitting jumpsuit that can be worn over most clothing and light armor, but not over heavy armor or powered armor. When you activate a personal phase shifter, you are incorporeal (Core Rulebook 264) except you do not gain the ability to move at full speed if you otherwise could not do so. The phase shifter contains antigravity repulsors that grant you a fly speed of 30 feet with average maneuverability. You cannot hold any items while incorporeal, and your nonmagical attacks deal half damage. Magical attacks are unaffected, and you can use magic items and other equipment worn under the jumpsuit as normal."
  },
  {
    "source": "Starfinder Armory pg. 109",
    "Name": "Weightless Footlocker",
    "Category": "Other",
    "Level": "18",
    "Price": "340,000",
    "Hands": "—",
    "Bulk": "2",
    "Capacity": "100",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "This metal chest is 2 feet long and can normally hold up to 1 item of 2 bulk, 4 items of 1 bulk, or up to 20 items of light bulk. When you close and activate the footlocker, sophisticated gravity-reversal units built into the chest’s frame reduce the bulk of any items in the chest to 0. Even superdense materials have their bulk negated, as long as they fit within the chest. You must deactivate the chest before opening it, which returns its contents to their normal weight."
  },
  {
    "source": "Starfinder Armory pg. 101",
    "Name": "Disintegration Hoop",
    "Category": "Other",
    "Level": "20",
    "Price": "750,000",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "100",
    "Usage": "10/round",
    "type": "Technological Items",
    "desc": "This adamantine ring is 1 foot in diameter and surrounded by coils and circuitry. When activated, the disintegration hoop completely obliterates all matter placed through the center. Creatures that place an appendage into the hoop take 4d20 electricity and fire damage as the appendage is disintegrated, and creatures small enough to fit entirely within the hoop instead take 14d20 electricity and fire damage. In either case, a creature that would be forced through the hoop can attempt a DC 14 Reflex save to avoid passing into the hoop. Appendages destroyed by the disintegration hoop can be restored only with "
  },
  {
    "source": "Starfinder Armory pg. 106",
    "Name": "Grenade Scrambler, Mk 6",
    "Category": "Other",
    "Level": "20",
    "Price": "815,000",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "100",
    "Usage": "5/round",
    "type": "Technological Items",
    "desc": "Affects grenades with an item level of 20 or lower. Affected grenades with an item level of 15 or lower automatically miss."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Portable Light, Beacon",
    "Category": "Portable Lights",
    "Level": "1",
    "Price": "25",
    "Hands": "2",
    "Bulk": "1",
    "Capacity": "10",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Portable Light, Flashlight",
    "Category": "Portable Lights",
    "Level": "1",
    "Price": "1",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "10",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Portable Light, Lantern",
    "Category": "Portable Lights",
    "Level": "1",
    "Price": "1",
    "Hands": "1",
    "Bulk": "L",
    "Capacity": "10",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Portable Light, Spotlight",
    "Category": "Portable Lights",
    "Level": "1",
    "Price": "25",
    "Hands": "2",
    "Bulk": "1",
    "Capacity": "10",
    "Usage": "1/hour",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Kishalee Battery",
    "Category": "Relic",
    "Level": "2",
    "Price": "400",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Holdall Raiment",
    "Category": "Relic",
    "Level": "4",
    "Price": "2,000",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "Though this ivory-white frock is tailored for kishalee physiology, most humanoids can wear it with little to no discomfort. A holdall raiment features a dozen pockets, each of which can access a series of linked extradimensional pockets. Each pocket can hold a single item that weighs up to 1 bulk, though any item stored within the raiment can be retrieved from any pocket as a move action, but only by the wearer of the raiment. The stored items cannot be detected by anyone searching or frisking you."
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Acclimation Torc",
    "Category": "Relic",
    "Level": "5",
    "Price": "2,700",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This simple metal band attaches to the collar area of your space suit, suit of armor, or other set of clothes. When activated as a standard action, an acclimation torc places your respiratory system and your digestive system in a form of temporal stasis, while still keeping you alive. Essentially, your need to eat, drink, and breathe is temporarily “paused” while the acclimation torc continues to hold a charge. You can breathe normally in vacuums, clouds of smoke, water, and thick, thin, and toxic atmospheres, though you aren’t protected against the damage of a corrosive atmosphere. In addition, you don’t need to worry about starvation or thirst while your acclimation torc is active. Unlike the normal protections provided by most suits of armor, an acclimation torc doesn’t grant you protection against low levels of radiation or conditions of cold and heat. An acclimation torc holds 50 charges and uses 1 charge per hour. You can replenish these charges the same way you recharge the duration of a suit of armor’s environmental protections ("
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Dimensional Comm Unit",
    "Category": "Relic",
    "Level": "6",
    "Price": "4,500",
    "Hands": "1",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "These devices are handheld and circular in shape and have a very high-resolution screen and simple controls. Dimensional comm units are a kishalee version of the comm units commonly found in the Pact Worlds, but they function using the remnants of the vast demiplane network utilized by the now extinct kishalee civilization. The advantage of dimensional comm units is that their text and verbal communications are instantaneous, whether in the same system or through interstellar space, but because of the degraded state of the kishalee dimensional network, they work only sporadically. Prior to use, a dimensional comm unit must be linked with at least one other unit—a process that takes only a minute when all units to be linked are on the same planet. Dimensional comm units nearly always work when used on the same planet to reach other linked devices. Over greater distances, each time a dimensional comm is used, there is a 50% chance that it will function properly if used in the same system or a 25% chance if the communication is interstellar (this is rolled in secret by the GM), but only with linked dimensional comm units. If two linked dimensional comm units make a connection, they retain that connection for 24 hours. If the dimensional comm units don’t manage to connect, the users can try again after 24 hours. Dimensional comm units do not function within the Drift or on other planes."
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Kishalee Battery, High-Capacity",
    "Category": "Relic",
    "Level": "6",
    "Price": "3,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Horizon Shield",
    "Category": "Relic",
    "Level": "7",
    "Price": "6,500",
    "Hands": "1",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "A horizon shield slips over one hand much like a set of brass knuckles with a touch-sensitive control pad resting in your palm. Activating or deactivating a horizon shield is a move action. When activated, a horizon shield forms a nearly invisible barrier that warps space around you, making you more difficult to hit with ranged attacks. Any ranged attack targeting you treats you as if are 60 feet farther away than you actually are. This might impart a range increment penalty to the attack roll or even make the attack impossible altogether. You must be aware of the attacker and can’t be holding anything else in the hand equipped with the horizon shield. This effect doesn’t stack with effects from other horizon shields. A horizon shield has a capacity of 20 and uses 1 charge per round that it is active."
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Kishalee Battery, Super-Capacity",
    "Category": "Relic",
    "Level": "7",
    "Price": "5,000",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Kishalee Battery, Ultra-Capacity",
    "Category": "Relic",
    "Level": "8",
    "Price": "8,400",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Sovereign Helm",
    "Category": "Relic",
    "Level": "9",
    "Price": "14,975",
    "Hands": "—",
    "Bulk": "L",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "This strange silvery helm features a glowing band of greenish energy. Four metal clasps attached to long, sharp appendages poke out from the crown of the helm. When the apparatus is held over the head of a Small or Medium living creature for 1 minute, the band of energy pulsates wildly, and at the end of that time, the clasps slap down and start to painlessly burrow into the creature’s cranium. After another full minute, the appendages become fully embedded, and the sovereign helm begins the 24-hour process of rewriting the neural pathways of the subject’s brain. If the helm is removed at any time during this period and then placed back onto the same subject, the 24 hours begin anew. Once this process is complete, the sovereign helm grants the wearer some control over constructs with the technological subtype."
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Restraints, Binders",
    "Category": "Restraints",
    "Level": "1",
    "Price": "5",
    "Hands": "—",
    "Bulk": "—",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  },
  {
    "source": "Starfinder Core Rulebook pg. 219",
    "Name": "Restraints, Manacles",
    "Category": "Restraints",
    "Level": "4",
    "Price": "350",
    "Hands": "—",
    "Bulk": "1",
    "Capacity": "—",
    "Usage": "—",
    "type": "Technological Items",
    "desc": "top desc: hr"
  }
]