[
  {
    "source": "Starfinder Core Rulebook pg. 232",
    "Name": "Fine Art",
    "Price": "Varies",
    "Bulk": "Varies",
    "type": "Trade Goods",
    "desc": "Fine art can be nearly anything, though as trade goods those items with a set, singular, physical existence (paintings, sculpture, and so on) are more easily bought and sold than performance art (though, for example, the sole copy of a famous vesk play could be valuable until broadly disseminated). Fine art can be of nearly any price or bulk, as determined by the GM."
  },
  {
    "source": "Starfinder Core Rulebook pg. 232",
    "Name": "Gem",
    "Price": "Varies",
    "Bulk": "—",
    "type": "Trade Goods",
    "desc": "Gems are valued for their scarcity, their beauty, and, in some cases, their utility for some forms of magic rituals and technology. The value of a gemstone is determined by many factors, including size, rarity, clarity, cut, polish, and potential cultural influences. Gems considered of low quality are usually priced at 5–45 credits. Gems rated as semiprecious are generally priced at 50–95 credits. Gems rated as precious are generally priced at 150–450 credits, and those rated as jewels are generally priced at 1,000–4,500 credits. Gems rated as grand jewels are priced no lower than 5,000 credits, and the rarest and most valued can be worth hundreds of thousands or even millions of credits."
  },
  {
    "source": "Starfinder Core Rulebook pg. 232",
    "Name": "Grain",
    "Price": "1",
    "Bulk": "1",
    "type": "Trade Goods",
    "desc": "Grain is a common staple and can be considered representative of a wide range of basic foods. Of course, grain prices vary wildly, but the price given here is a baseline for a typical grain, packaged and shipped in bulk amounts."
  },
  {
    "source": "Starfinder Core Rulebook pg. 233",
    "Name": "UPB (1000)",
    "Price": "1,000",
    "Bulk": "1",
    "type": "Trade Goods",
    "desc": "A universal polymer base, or UPB, is the basis for most technology in the Pact Worlds, the Veskarium, and many other systems. Each UPB is a tiny multifunction component, not much larger than a grain of rice, capable of being configured to act as a brace, capacitor, circuit, diode, fastener, insulator, lens, modulator, pipe, resistor, and dozens of other constituent parts. UPBs can even be spun out into fabric, broken down into component chemicals, reconstituted into new chemicals, or supplemented with base materials (such as dirt or sand) to form massive braces or walls. The right combination of hundreds or even thousands of UPBs can create everything from a comm unit to a laser weapon to powered armor. In their raw form, UPBs have a bulk of 1 per 1,000 UPBs, though when aligned and configured they can easily take up less bulk, and when configured for a specific purpose that calls for a minimum size and bracing (possibly combining them with inert materials), they can have a higher bulk."
  },
  {
    "source": "Starfinder Core Rulebook pg. 232",
    "Name": "Textiles, Common",
    "Price": "1",
    "Bulk": "L",
    "type": "Trade Goods",
    "desc": "Common textiles include good linen and most synthetic fabrics. Fine textiles are of higher quality, with more visual appeal, higher durability, or both. Various silks, satins, and similar cloths are typical fine textiles, though more exotic materials exist in this category. Truly luxurious fabrics, including marramas and samite, can easily cost much more than even the best fine fabrics."
  },
  {
    "source": "Starfinder Core Rulebook pg. 232",
    "Name": "Textiles, Fine",
    "Price": "100",
    "Bulk": "L",
    "type": "Trade Goods",
    "desc": "Common textiles include good linen and most synthetic fabrics. Fine textiles are of higher quality, with more visual appeal, higher durability, or both. Various silks, satins, and similar cloths are typical fine textiles, though more exotic materials exist in this category. Truly luxurious fabrics, including marramas and samite, can easily cost much more than even the best fine fabrics."
  }
]