[
  {
    "source": "Starfinder Core Rulebook pg. 192",
    "Name": "Anchoring",
    "Level": "1",
    "Summary": "A weapon with the anchoring fusion has a chance to immobilize its targets.",
    "type": "weapon_fusions",
    "desc": "A weapon with the anchoring fusion has a chance to immobilize its targets. The weapon gains immobilization as a critical hit effect. If the weapon already has a critical hit effect, choose each time whether to apply the weapon’s normal critical hit effect or the immobilization effect. A target affected by the immobilization critical hit effect is unable to move from its space under its own power for 1d4 rounds. It cannot use any form of movement, including teleportation effects, to change its position. If the target is entirely contained in a mobile object (such as a starship or large vehicle), the target is immobile relative to its location within that object. Other creatures and forces can move the target normally."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Called",
    "Level": "1",
    "Summary": "A weapon with the called fusion can be teleported to its owner’s hand as a swift action, even if the weapon is in the possession of another creature.",
    "type": "weapon_fusions",
    "desc": "A weapon with the called fusion can be teleported to its owner’s hand as a swift action, even if the weapon is in the possession of another creature. This ability has a maximum range of 100 feet, and effects that block teleportation prevent the return of a called weapon. A weapon with the called fusion must be in your possession for at least 24 hours for this ability to function."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Defiant",
    "Level": "1",
    "Summary": "A weapon with the defiant fusion resists efforts to be removed from its wielder.",
    "type": "weapon_fusions",
    "desc": "A weapon with the defiant fusion resists efforts to be removed from its wielder. If you are wielding it when you are knocked unconscious, panicked, or stunned, it stays in your hand. You also gain a bonus to your KAC against combat maneuvers to disarm the weapon equal to one-fifth the weapon’s level (minimum +1)."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Durable",
    "Level": "1",
    "Summary": "The durable fusion uses magical runes and reinforcements to significantly increase a weapon’s toughness.",
    "type": "weapon_fusions",
    "desc": "The durable fusion uses magical runes and reinforcements to significantly increase a weapon’s toughness. When determining a weapon’s hardness, Hit Points, and saving throws, treat its item level as being 5 higher. For more about calculating these values, see Breaking Objects on page 409."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Glamered",
    "Level": "1",
    "Summary": "As a standard action, a weapon with the glamered fusion can be commanded to change its appearance to assume the form of another object of similar size.",
    "type": "weapon_fusions",
    "desc": "As a standard action, a weapon with the glamered fusion can be commanded to change its appearance to assume the form of another object of similar size. The weapon retains all its properties (including bulk) when disguised but does not radiate magic. Only true seeing or similar magic reveals the true nature of a glamered weapon while it is in disguise. After a glamered weapon is used to make an attack, this fusion is suppressed for 1 minute."
  },
  {
    "source": "Starfinder #11: The Penumbra Protocol pg. 53",
    "Name": "Hindering",
    "Level": "1",
    "Summary": "A hindering fusion turns a melee weapon into a device suitable for making your foes less capable of escaping and fighting back.",
    "type": "weapon_fusions",
    "desc": "A hindering fusion turns a melee weapon into a device suitable for making your foes less capable of escaping and fighting back. The weapon grants you a circumstance bonus to attack rolls to attempt dirty trick, disarm, and trip combat maneuvers equal to 1 + one-sixth of the weapon’s level."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Hybridized",
    "Level": "1",
    "Summary": "A weapon with the hybridized fusion replaces much of its technological functions with magic counterparts.",
    "type": "weapon_fusions",
    "desc": "A weapon with the hybridized fusion replaces much of its technological functions with magic counterparts. It gains the analog weapon special property (see page 180), and the core function of the weapon is considered to be a hybrid of magic and technology (rather than only the fusion counting as a hybrid item). A hybridized weapon still consumes ammunition and battery charges normally."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Illuminating",
    "Level": "1",
    "Summary": "The illuminating fusion causes a weapon to gain the bright weapon special property (see page 181).",
    "type": "weapon_fusions",
    "desc": "The illuminating fusion causes a weapon to gain the bright weapon special property (see page 181). You can deactivate this fusion as a move action, in which case the weapon acts as if it does not have the bright property until it is reactivated (which also requires a move action)."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Invigorating",
    "Level": "1",
    "Summary": "The invigorating fusion fills its wielder with vigor when defeating foes.",
    "type": "weapon_fusions",
    "desc": "The invigorating fusion fills its wielder with vigor when defeating foes. After making a successful attack with this weapon that drops a foe (by killing it or rendering it unconscious), you feel a rush of energy that eliminates the fatigued condition and reduces exhaustion to fatigue. If you were neither exhausted nor fatigued, you instead gain a +3 morale bonus to Strength-, Dexterity- and Constitution-based ability checks and skill checks, and you gain a +10 enhancement bonus to your speed for all of your modes of movement until the end of your next turn."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Ominous",
    "Level": "1",
    "Summary": "A weapon with the ominous fusion trails a shadowy haze behind it and moans a menacing dirge in battle.",
    "type": "weapon_fusions",
    "desc": "A weapon with the ominous fusion trails a shadowy haze behind it and moans a menacing dirge in battle. The weapon gains intimidation as a critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the intimidation effect. A target affected by the intimidation critical hit effect is shaken for 1d4 rounds (Fortitude save negates). A creature that gains the shaken condition from a weapon with the ominous fusion can’t gain that condition again from the same weapon for 24 hours."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Returning",
    "Level": "1",
    "Summary": "You can add this fusion only to a weapon that has the thrown weapon special property.",
    "type": "weapon_fusions",
    "desc": "You can add this fusion only to a weapon that has the thrown weapon special property. A returning weapon flies through the air back to you after you make a thrown ranged attack with it. It returns to you just before your next turn (and is therefore ready to use again in that turn). Catching the weapon when it comes back takes no action. If you can’t catch it, or if you have moved since throwing it, the weapon drops to the ground in the square from which you threw it."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Secured",
    "Level": "1",
    "Summary": "The secured fusion ties the weapon to a single owner.",
    "type": "weapon_fusions",
    "desc": "The secured fusion ties the weapon to a single owner. When you use your weapon, it functions normally, but when wielded by any other, it remains inert and useless. Any analog, nonmagical properties of the weapon that do not require ammunition or charges still function, so a club would still be a club, but a pistol becomes merely an improvised weapon. Only the person who places a secured fusion seal on a weapon can remove it from that weapon. Once removed, the fusion seal can be affixed to a new weapon by a new owner. Even if not the owner, a character trained in Mysticism can remove an installed secured fusion or fusion seal using a process similar to transferring a fusion. For a fusion, this costs half as much as purchasing the fusion for the weapon on which it is currently installed; for a seal, this is half the cost of the seal itself. The process takes 8 hours. Afterward, a fusion can be installed on a new weapon and assigned a new owner for the installation cost, and a fusion seal can be used normally."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Soulfire",
    "Level": "1",
    "Summary": "The soulfire fusion (and soulfire fusion seals) can only be applied to solarian weapon crystals.",
    "type": "weapon_fusions",
    "desc": "The soulfire fusion (and soulfire fusion seals) can only be applied to solarian weapon crystals. When you hit a target with a solar weapon augmented by a solarian weapon crystal with the soulfire fusion, you add your Charisma bonus to the damage done, in addition to your Strength bonus."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Stabilizing",
    "Level": "1",
    "Summary": "The stabilizing fusion helps you keep your orientation in zero gravity.",
    "type": "weapon_fusions",
    "desc": "The "
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Trailblazer",
    "Level": "1",
    "Summary": "A weapon with the trailblazer fusion manages to alter the nature of its attacks to overcome the penalties of some natural environmental effects.",
    "type": "weapon_fusions",
    "desc": "A weapon with the trailblazer fusion manages to alter the nature of its attacks to overcome the penalties of some natural environmental effects. Its attacks ignore the cover provided by bogs and the cover creatures submerged at least chest deep in water receive from attacks made from the surface. Fire damage dealt by the weapon to underwater targets does half normal damage (rather than the normal one-quarter), and other attacks made underwater deal full damage (rather than the normal half damage)."
  },
  {
    "source": "Starfinder Core Rulebook pg. 192",
    "Name": "Anarchic",
    "Level": "2",
    "Summary": "The anarchic fusion imbues a weapon with divine energy from a chaotic deity.",
    "type": "weapon_fusions",
    "desc": "The anarchic fusion imbues a weapon with divine energy from a chaotic deity. Any attacks with the weapon are chaotic-aligned. Damage from the weapon bypasses DR/chaotic and ignores the energy resistance of lawful dragons and lawful outsiders. The anarchic fusion can’t be added to weapons that have the axiomatic fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 192",
    "Name": "Axiomatic",
    "Level": "2",
    "Summary": "The axiomatic fusion imbues a weapon with divine energy from a lawful deity.",
    "type": "weapon_fusions",
    "desc": "The axiomatic fusion imbues a weapon with divine energy from a lawful deity. Any attacks with the weapon are lawful-aligned. Damage from the weapon bypasses DR/lawful and ignores the energy resistance of chaotic dragons and chaotic outsiders. The axiomatic fusion can’t be added to weapons that have the anarchic fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 192",
    "Name": "Blasting",
    "Level": "2",
    "Summary": "The blasting fusion allows a weapon to make a single attack as a blast (see the blast weapon special property on page 180) once per day as a full action.",
    "type": "weapon_fusions",
    "desc": "The blasting fusion allows a weapon to make a single attack as a blast (see the blast weapon special property on page 180) once per day as a full action. This attack has a maximum range of 30 feet and deals half the weapon’s normal damage. Only ranged weapons that don’t have the automatic, explode, line, or thrown weapon special property can benefit from the blasting fusion. Weapons that don’t require attack rolls to affect their targets also can’t benefit from the blasting fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Burst",
    "Level": "2",
    "Summary": "With the burst fusion, a weapon’s energy damage can form a small explosion that spills onto a second target.",
    "type": "weapon_fusions",
    "desc": "With the burst fusion, a weapon’s energy damage can form a small explosion that spills onto a second target. The weapon gains the arc critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the arc effect. The amount of damage dealt to the secondary target is equal to one-third the level of the weapon with the burst fusion (minimum 1). Only weapons that deal acid, cold, electricity, fire, or sonic damage can benefit from a burst fusion. If your weapon deals more than one type of energy damage, you select one of those types for the arc critical hit effect to apply to secondary targets when the fusion is added."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Entangling",
    "Level": "2",
    "Summary": "A weapon with the entangling fusion gains the entangle weapon special property (see page 181).",
    "type": "weapon_fusions",
    "desc": "A weapon with the entangling fusion gains the entangle weapon special property (see page 181). Only a single attack each day may benefit from this property, and you must announce before making an attack that it is an entangle attack. Regardless of how many targets you can hit with a single attack from your weapon, only a single target of your choice is affected by the entangle condition. The entangle effect ends after 1d4 rounds if the target has not already escaped it. Only weapons that do bludgeoning, piercing, slashing, or cold damage can benefit from this fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Holy",
    "Level": "2",
    "Summary": "A weapon with the holy fusion becomes blessed with divine energy from a good deity.",
    "type": "weapon_fusions",
    "desc": "A weapon with the holy fusion becomes blessed with divine energy from a good deity. Any attacks with the fused weapon are good-aligned. Damage from the weapon bypasses DR/good and ignores the energy resistance of evil dragons, evil outsiders, and evil undead. The holy fusion cannot be added to weapons that have the unholy fusion."
  },
  {
    "source": "Starfinder Armory pg. 63",
    "Name": "Inspiring",
    "Level": "2",
    "Summary": "The inspiring fusion imbues a weapon with hope.",
    "type": "weapon_fusions",
    "desc": "The inspiring fusion imbues a weapon with hope. When you score a critical hit using a weapon with the inspiring fusion, you and all allies within 60 feet gain a +2 morale bonus to saving throws against attacks, effects, and spells from the target of your attack for 1 minute. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the inspiring effect."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Merciful",
    "Level": "2",
    "Summary": "A weapon with the merciful fusion often hums pleasantly when at rest and makes soft, airy musical noises when it is used to make an attack.",
    "type": "weapon_fusions",
    "desc": "A weapon with the merciful fusion often hums pleasantly when at rest and makes soft, airy musical noises when it is used to make an attack. The magic of this fusion subdues the damaging effect of the weapon it is added to. While this fusion is active, the weapon’s regular damage becomes nonlethal damage. If the weapon deals two types of damage, both of the damage types become nonlethal. You can activate or deactivate the merciful fusion as a swift action."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Opportunistic",
    "Level": "2",
    "Summary": "The opportunistic fusion guides your accuracy when making attacks of opportunity and leaves your foes vulnerable to your attack.",
    "type": "weapon_fusions",
    "desc": "The opportunistic fusion guides your accuracy when making attacks of opportunity and leaves your foes vulnerable to your attack. You gain a +2 bonus to attacks of opportunity made with this weapon. If your attack of opportunity hits, you gain a +2 bonus to the damage roll for that attack of opportunity. This damage increases by 1 if the weapon is item level 5, and by an additional 1 for every 5 item levels thereafter. Only melee weapons can benefit from this fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Spellthrower",
    "Level": "2",
    "Summary": "A weapon with the spellthrower fusion is able to have a single spell gem loaded into it at a time.",
    "type": "weapon_fusions",
    "desc": "A weapon with the spellthrower fusion is able to have a single spell gem loaded into it at a time. It takes 1 minute to load a spell gem, and only gems containing a spell with a casting time of one standard action or less and a spell level no greater than one-quarter the weapon’s item level can be loaded into the weapon."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Throwing",
    "Level": "2",
    "Summary": "The throwing fusion makes even the most cumbersome melee weapon usable as a thrown weapon.",
    "type": "weapon_fusions",
    "desc": "The throwing fusion makes even the most cumbersome melee weapon usable as a thrown weapon. A melee weapon with this fusion gains the thrown special property with a range increment of 10 feet. If the weapon has an item level of 10 or higher, the range increment is 20 feet. This fusion allows you to add additional fusions that benefit thrown weapons. You must be proficient with a melee weapon with the throwing fusion in order to benefit from the thrown special property granted by it. Only melee weapons can benefit from the throwing fusion."
  },
  {
    "source": "Pact Worlds pg. 195",
    "Name": "Ulrikka Duster",
    "Level": "2",
    "Summary": "Dwarven asteroid miners favor the Ulrikka duster fusion, which causes any weapon with it to take on an armored, stocky appearance.",
    "type": "weapon_fusions",
    "desc": "Dwarven asteroid miners favor the Ulrikka duster fusion, which causes any weapon with it to take on an armored, stocky appearance. Attacks made with weapons with this fusion ignore half of a target item’s hardness. Use of such weapons has helped more than one short-supplied dwarven mining crew remove the last bits of useful material from an asteroid while still remaining armed enough to fight off space pirates."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Unholy",
    "Level": "2",
    "Summary": "The unholy fusion imbues a weapon with divine energy from an evil deity.",
    "type": "weapon_fusions",
    "desc": "The unholy fusion imbues a weapon with divine energy from an evil deity. Any attacks with the fused weapon are evil-aligned. Damage from the weapon overcomes DR/evil and ignores the energy resistance of good dragons and good outsiders. The unholy fusion can’t be added to weapons that have the holy fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Venomous",
    "Level": "2",
    "Summary": "A weapon with the venomous fusion gains the injection weapon special property (see page 181).",
    "type": "weapon_fusions",
    "desc": "A weapon with the venomous fusion gains the injection weapon special property (see page 181). Only a single attack each day may benefit from this property, and you must announce before making an attack that it is an injection attack. Regardless of how many targets you can hit with a single attack from your weapon, only a single target of your choice is exposed to the drug, medicinal, or poison when you use the injection property in an attack. Only weapons that deal piercing or slashing damage can benefit from this fusion."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Astute",
    "Level": "3",
    "Summary": "The fusion causes a weapon to become etched with glowing circuitry and ringed with faint blue-black flames.",
    "type": "weapon_fusions",
    "desc": "The fusion causes a weapon to become etched with glowing circuitry and ringed with faint blue-black flames. Stewards often use astute weapons as they hunt down criminals within the Pact Worlds. The DC of Bluff checks to feint against you and to use the operative’s trick attack ability against you increases by 2 while you wield such a weapon."
  },
  {
    "source": "Starfinder #1: Incident at Absalom Station pg. 52",
    "Name": "Binding",
    "Level": "3",
    "Summary": "Weapons with the binding fusion often feature decorative images of bars, gates, and manacles.",
    "type": "weapon_fusions",
    "desc": "Weapons with the binding fusion often feature decorative images of bars, gates, and manacles. A binding weapon gains the bind critical hit effect. When you score a critical hit on a target, you gain a +2 bonus to grapple checks you make against that target until the end of your next turn. If the weapon already has a critical hit effect, you can apply either the weapon’s normal critical hit effect or the binding critical hit effect when you score a critical hit. You can add this fusion only to melee weapons."
  },
  {
    "source": "Starfinder Armory pg. 62",
    "Name": "Conserving",
    "Level": "3",
    "Summary": "Weapons with the conserving fusion preserve their ammunition and charges after a miss.",
    "type": "weapon_fusions",
    "desc": "Weapons with the conserving fusion preserve their ammunition and charges after a miss. When you miss with a ranged attack roll, your charge or ammunition is not consumed, as though the weapon had never been fired. This fusion does not prevent your weapon from malfunctioning or breaking as a consequence of your attack. Only weapons that use arrows, batteries, darts, flares, grenade arrows, mini-rockets, rounds, or scattergun shells as ammunition can benefit from a conserving fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Deafening",
    "Level": "3",
    "Summary": "With the deafening fusion, a weapon releases a blast of low-frequency sonic energy on impact.",
    "type": "weapon_fusions",
    "desc": "With the deafening fusion, a weapon releases a blast of low-frequency sonic energy on impact. The weapon gains the deafen critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the deafen effect. Only weapons that deal bludgeoning, piercing, slashing, or sonic damage can benefit from a deafening fusion."
  },
  {
    "source": "Starfinder Armory pg. 63",
    "Name": "Defending",
    "Level": "3",
    "Summary": "Weapons with the defending fusion aid their wielder when blocking or fighting defensively.",
    "type": "weapon_fusions",
    "desc": "Weapons with the defending fusion aid their wielder when blocking or fighting defensively. When you fight defensively while attacking with a weapon with this fusion, you gain a +1 bonus to attack rolls with the weapon (effectively reducing the penalty from fighting defensively to –3) and an additional +1 bonus to AC until the start of your next turn. Additionally, if your weapon has the block weapon special property, increase the enhancement bonus to your AC against melee attacks from that target to +2. Only melee weapons can benefit from this fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Dispelling",
    "Level": "3",
    "Summary": "A weapon with the dispelling fusion gathers spare wisps of latent magic during combat, which it can then unleash in a focused effort to dispel magic.",
    "type": "weapon_fusions",
    "desc": "A weapon with the dispelling fusion gathers spare wisps of latent magic during combat, which it can then unleash in a focused effort to dispel magic. The weapon gains dispelling as a critical hit effect in combat. This ability manifests only in high-stakes situations, so you must be in combat and facing a significant enemy (see page 242) for it to gain this critical hit effect. If there’s any doubt about whether you’re in combat or able to access the critical hit effect, the GM decides. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the dispelling effect. A target affected by the dispelling critical hit effect is the subject of a targeted dispel magic, as the spell, using the weapon’s item level as the dispel check’s caster level."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Disruptive",
    "Level": "3",
    "Summary": "The disruptive fusion imbues a weapon with powerful positive energy designed to disrupt the magical forces that allow undead to exist.",
    "type": "weapon_fusions",
    "desc": "The disruptive fusion imbues a weapon with powerful positive energy designed to disrupt the magical forces that allow undead to exist. The weapon ignores any DR and energy resistance of undead creatures. Only weapons that deal bludgeoning damage can benefit from this fusion."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Potent",
    "Level": "3",
    "Summary": "The potent fusion boosts the DC of saving throws associated with the weapon.",
    "type": "weapon_fusions",
    "desc": "The potent fusion boosts the DC of saving throws associated with the weapon. When you attack using a weapon with this fusion, increase the DC for saving throws against the weapon’s critical hit effects, other weapon fusions, weapon special properties, and any effect delivered by the weapon (such as an injected poison) by 1."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Seeking",
    "Level": "3",
    "Summary": "The seeking fusion causes an attack from a weapon to veer toward its target.",
    "type": "weapon_fusions",
    "desc": "The seeking fusion causes an attack from a weapon to veer toward its target. This negates any miss chance caused by the target having concealment, though it has no effect on miss chances from other sources (and does not offset the miss chance from a target having total concealment)."
  },
  {
    "source": "Pact Worlds pg. 195",
    "Name": "Sentinel",
    "Level": "3",
    "Summary": "Like most weapon fusions designed for use on AbadarCorp weapons, the sentinel fusion makes a weapon richly ornamented, sometimes even gold-plated, and often adds icons of vault doors.",
    "type": "weapon_fusions",
    "desc": "Like most weapon fusions designed for use on AbadarCorp weapons, the sentinel fusion makes a weapon richly ornamented, sometimes even gold-plated, and often adds icons of vault doors. Favored by colonists and corporate guards, once per day a sentinel weapon allows you to declare an area of up to 1,000 cubic feet as being under guard for up to 8 continuous hours. While wielding the sentinel weapon within an area under guard in this manner, you gain a +2 bonus to initiative checks and Perception checks."
  },
  {
    "source": "Near Space pg. 150",
    "Name": "Valorous",
    "Level": "3",
    "Summary": "Your weapon whispers bolstering words into your mind, allowing you to withstand even mighty terrors such as the colossi of Daimalko.",
    "type": "weapon_fusions",
    "desc": "Your weapon whispers bolstering words into your mind, allowing you to withstand even mighty terrors such as the colossi of Daimalko. The DC to demoralize you increases by 1 while you wield the weapon, and you gain a +1 morale bonus to your saving throws against fear effects."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Bonding",
    "Level": "4",
    "Summary": "A creation of the Brethedan biotech firm Life Innovations, a bonding weapon melds into your limb when you draw it (its coloration changes to match your skin tone).",
    "type": "weapon_fusions",
    "desc": "A creation of the Brethedan biotech firm Life Innovations, a bonding weapon melds into your limb when you draw it (its coloration changes to match your skin tone). You gain a +2 circumstance bonus to your KAC against disarm and sunder combat maneuvers targeting the weapon."
  },
  {
    "source": "Starfinder #1: Incident at Absalom Station pg. 51",
    "Name": "Burning",
    "Level": "4",
    "Summary": "Weapons with the burning fusion often take on an appearance that includes numerous flame-like elements.",
    "type": "weapon_fusions",
    "desc": "Weapons with the burning fusion often take on an appearance that includes numerous flame-like elements. However, if applied to a weapon that already has visual details representing crows or ravens, the fusion adds further raven-like flourishes to the weapon instead. A weapon with the burning fusion gains the burn critical hit effect. The burn damage for the critical hit effect is 1d6 when the fusion is applied to a 4th- or 5th-level weapon, 2d6 when applied to 6th- to 10th-level weapons, 3d6 when applied to 11th- to 15th-level weapons, and 4d6 when applied 16th- to 20th-level weapons. If the weapon already has a critical hit effect, you can apply either the weapon’s normal critical hit effect or the burn critical hit effect when you score a critical hit."
  },
  {
    "source": "Pact Worlds pg. 195",
    "Name": "Manufacturing",
    "Level": "4",
    "Summary": "Followers of the Prophecies of Kalistrade use manufacturing weapon fusions to ensure they are never without ammunition (or gouged by isolated traders for ammunition), even on long trade missions.",
    "type": "weapon_fusions",
    "desc": "Followers of the Prophecies of Kalistrade use manufacturing weapon fusions to ensure they are never without ammunition (or gouged by isolated traders for ammunition), even on long trade missions. This fusion often makes the weapon pearly white with gold accents. You can add up to 400 credits of UPBs to a manufacturing weapon as a swift action. When you do, the fusion’s magic instantly manufactures ammunition inside the weapon worth an equal amount (which might mean recharging a battery) up to the maximum the weapon can carry. This ammunition is nonmagical and can be removed normally."
  },
  {
    "source": "Alien Archive 4 pg. 95",
    "Name": "Radioactive",
    "Level": "4",
    "Summary": "Once per day before making an attack with a weapon with the radioactive fusion, you can imbue the attack with toxic radioactivity.",
    "type": "weapon_fusions",
    "desc": "Once per day before making an attack with a weapon with the radioactive fusion, you can imbue the attack with toxic radioactivity. One of the targets that takes damage from the attack is exposed to low radiation that bypasses any immunity to radiation provided by armor’s environmental protections (though the armor’s saving throw bonus still applies). The initial saving throw DC against this radiation equals 10 + half the weapon’s level + your ability modifier used for making the attack (such as Dexterity for a ranged weapon); subsequent saving throws against the radiation have a DC of 13. If the weapon with the radioactive fusion is 12th level or higher, the fusion instead exposes the target to moderate radiation. Only weapons that deal fire damage and use batteries can benefit from this fusion."
  },
  {
    "source": "Pact Worlds pg. 195",
    "Name": "Tactical",
    "Level": "4",
    "Summary": "You can add the tactical fusion only to a ranged weapon.",
    "type": "weapon_fusions",
    "desc": "You can add the tactical fusion only to a ranged weapon. Tactical weapons are traditionally associated with the mercenaries of the Skyfire Legion and the close bonds they often form with one another. Such weapons typically take on decorations of crossed blades, bundles of arrows, or similar sets of weaponry. When you use a tactical weapon to provide covering fire or harrying fire, the bonus granted increases by 1. This ability of this fusion doesn’t stack with other abilities that increase the bonuses provided by covering fire or harrying fire."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Vanishing",
    "Level": "4",
    "Summary": "The vanishing fusion can hide its wielder from the sight of one foe.",
    "type": "weapon_fusions",
    "desc": "The vanishing fusion can hide its wielder from the sight of one foe. Once per day after making an attack with your weapon, regardless of whether you hit your target, you can become invisible to that target per invisibility for a number of rounds equal to the weapon’s item level. Any attacks you make (even against other targets) end your invisibility as normal. All creatures other than the target continue to be able to see you normally. Only small arms and weapons with the operative special property can benefit from this fusion."
  },
  {
    "source": "Starfinder Armory pg. 62",
    "Name": "Accurate",
    "Level": "5",
    "Summary": "The accurate fusion bestows exceptional balance and handling on a weapon.",
    "type": "weapon_fusions",
    "desc": "The accurate fusion bestows exceptional balance and handling on a weapon. When you take a move action to aim a weapon with this fusion at a specific target, you gain a +1 bonus to your next attack roll with that weapon provided neither you nor your target has moved since you aimed. You also gain this bonus if you take a move action to aim for other purposes, such as aiming a weapon with the sniper special property. Only ranged weapons can benefit from this fusion."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Apprehending",
    "Level": "5",
    "Summary": "The apprehending fusion causes the weapon to grow spikes and overwrought iron fixtures, as befits its use by the Hellknights.",
    "type": "weapon_fusions",
    "desc": "The apprehending fusion causes the weapon to grow spikes and overwrought iron fixtures, as befits its use by the Hellknights. When an apprehending weapon hits an enemy, you can activate the fusion as a reaction to perform a trip combat maneuver against that target with the same attack bonus as for the weapon attack. Additionally, the target must succeed at a Fortitude saving throw (DC \u003d 10 + half the weapon’s item level + the ability score modifier you apply to attack rolls with the weapon) or be unable to cast spells or spell-like abilities for 1 round. Once the weapon has used this ability, it cannot use it again until you take a 10-minute rest to regain Stamina Points."
  },
  {
    "source": "Starfinder Core Rulebook pg. 192",
    "Name": "Bane",
    "Level": "5",
    "Summary": "The bane fusion enhances the power of critical hits against certain foes.",
    "type": "weapon_fusions",
    "desc": "The bane fusion enhances the power of critical hits against certain foes. Against a designated foe, the bane weapon gains the stunned critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit against an appropriate foe, you can apply either the weapon’s normal critical hit effect or the stunned effect. When you add this fusion to a weapon (or create it as a fusion seal), you must select a single creature type (aberration, animal, construct, dragon, fey, humanoid, magical beast, ooze, outsider, plant, undead, or vermin) against which it will apply. If you select humanoid or outsider, you must also select one subtype. The stunned critical hit effect applies only against creatures of the selected type (and subtype, if selected). Once selected, the creature type and subtype can’t be changed."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Bleeding",
    "Level": "5",
    "Summary": "The bleeding fusion weaves entropic energy into the weapon’s form.",
    "type": "weapon_fusions",
    "desc": "The bleeding fusion weaves entropic energy into the weapon’s form. The weapon gains the bleed critical hit effect (see page 182). The amount of damage taken each round from this effect is equal to 1d6 per 5 levels of the weapon, rounded down. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the bleed effect. Only weapons that deal piercing or slashing damage can have this fusion."
  },
  {
    "source": "Starfinder Armory pg. 62",
    "Name": "Bombarding",
    "Level": "5",
    "Summary": "The bombarding fusion allows a weapon to duplicate the effect of a single grenade that is loaded into an extradimensional space within the weapon.",
    "type": "weapon_fusions",
    "desc": "The bombarding fusion allows a weapon to duplicate the effect of a single grenade that is loaded into an extradimensional space within the weapon. Loading a grenade into a weapon with the bombarding fusion takes a full round, as does removing a previously loaded grenade. A grenade loaded into a weapon with the bombarding fusion cannot have an item level greater than the weapon’s item level. The grenade cannot be detonated, sundered, or otherwise affected while it is within this extradimensional space, and if the weapon is destroyed or gains the broken condition, the grenade is permanently destroyed."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Devastating",
    "Level": "5",
    "Summary": "You can apply the devastating fusion only to a weapon with two or more critical hit effects.",
    "type": "weapon_fusions",
    "desc": "You can apply the devastating fusion only to a weapon with two or more critical hit effects. When you score a critical hit with a weapon that has the devastating fusion, you can select two of the critical hit effects to apply to the target (even if you are normally required to select just one critical hit effect)."
  },
  {
    "source": "Starfinder Armory pg. 63",
    "Name": "Energetic",
    "Level": "5",
    "Summary": "A projectile weapon with the energetic fusion relies on energy rather than physical ammunition to generate kinetic attacks.",
    "type": "weapon_fusions",
    "desc": "A projectile weapon with the energetic fusion relies on energy rather than physical ammunition to generate kinetic attacks. Instead of being loaded with darts, rounds, or scattergun shells, the weapon is loaded with a battery. The type of battery the projectile weapon uses depends on its original capacity as follows: 1–20 use batteries, 21–40 use high-capacity batteries, 41–80 use super-capacity batteries, and 81 or more use ultracapacity batteries. The weapon’s usage does not change, but it takes charges from the installed battery, rather than expending physical ammunition. The fusion converts the energy into physical bullets which target KAC and deal damage normally for the weapon. Only weapons in the projectile category that would normally use darts, rounds, or scattergun shells can benefit from the energetic fusion."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Flaming",
    "Level": "5",
    "Summary": "The flaming fusion imbues a weapon with the fiery power of a star.",
    "type": "weapon_fusions",
    "desc": "The flaming fusion imbues a weapon with the fiery power of a star. Half the weapon’s damage type is replaced with fire damage. You can activate or deactivate the flaming fusion as a swift action. If the weapon already deals two types of damage, replace one of them with fire (you decide which damage type to replace each time you activate the flaming fusion). You can add this fusion only to a weapon that does not already deal fire damage. This fusion never causes a weapon that normally targets KAC to target EAC."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Frost",
    "Level": "5",
    "Summary": "The frost fusion imbues a weapon with the icy cold of a dead world far from its system’s sun.",
    "type": "weapon_fusions",
    "desc": "The frost fusion imbues a weapon with the icy cold of a dead world far from its system’s sun. Half the weapon’s damage type is replaced with cold damage. You can activate or deactivate the frost fusion as a swift action. If the weapon already deals two types of damage, replace one of them with cold (you decide which damage type to replace each time you activate the frost fusion). You can add this fusion only to a weapon that does not already deal cold damage. This fusion never causes a weapon that normally targets KAC to target EAC."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Ghost Killer",
    "Level": "5",
    "Summary": "Attacks from a weapon with this fusion deal full damage to incorporeal creatures.",
    "type": "weapon_fusions",
    "desc": "Attacks from a weapon with this fusion deal full damage to incorporeal creatures. They also pass into the Ethereal Plane, allowing such attacks to affect ethereal creatures normally. Weapons with the ghost killer fusion can also score critical hits against incorporeal creatures. In addition, an incorporeal creature (though not an ethereal one) can pick up, move, or wield a ghost killer weapon."
  },
  {
    "source": "Pact Worlds pg. 194",
    "Name": "Interposing",
    "Level": "5",
    "Summary": "You can add the interposing fusion only to a melee weapon.",
    "type": "weapon_fusions",
    "desc": "You can add the interposing fusion only to a melee weapon. Developed and popularized by the Knights of Golarion, this fusion generally adds shining sword icons to the weapon. Whenever you hit an enemy with an interposing weapon, you and all adjacent allies gain a +1 enhancement bonus to AC against that enemy’s melee attacks until the beginning of your next turn."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Limning",
    "Level": "5",
    "Summary": "Successful attacks with a weapon with the limning fusion surround the target with a glowing aura.",
    "type": "weapon_fusions",
    "desc": "Successful attacks with a weapon with the limning fusion surround the target with a glowing aura. For 1 round after you successfully attack a single creature with your weapon, it is surrounded by a pale glow that reveals its location. While so illuminated, the creature takes a –20 penalty to Stealth checks and does not benefit from concealment provided by darkness, invisibility, smoke, and similar effects. However, displacement and other effects that shift location entirely are not negated. The light is too dim to harm creatures vulnerable to light and does not serve to illuminate anything but the creature affected by limning. Limning weapons create glows in a variety of hues, and some even bestow a variety of colors. The limning fusion has no effect on attacks that affect multiple foes. MALEDICTION LEVEL 9 Once per day when you successfully attack a foe with a weapon with the malediction fusion, as a reaction you can cast bestow curse on the target as a spell-like ability (using the weapon’s item level as the caster level). This does not provoke an attack of opportunity. If the weapon with this fusion has an item level of 14 or higher you may use this ability twice per day, and if it has an item level of 19 or higher you may use this ability three times per day. A weapon cannot have the malediction fusion if it also has either the holy or merciful weapon fusions."
  },
  {
    "source": "Near Space pg. 150",
    "Name": "Numbing",
    "Level": "5",
    "Summary": "Incorporating polar ice from particularly cold planets such as Vesk-7, this fusion causes the attached weapon to deliver a creeping numbness.",
    "type": "weapon_fusions",
    "desc": "Incorporating polar ice from particularly cold planets such as Vesk-7, this fusion causes the attached weapon to deliver a creeping numbness. Once per day, when a numbing weapon deals cold damage to an enemy, you can activate the fusion as a reaction to make a disarm attempt against that target with the same attack bonus as the weapon attack. The target must also succeed at a Fortitude saving throw (DC \u003d 10 + half the weapon’s item level + the ability score modifier you apply to attack rolls with the weapon) or feel a lack of sensation in its limbs, taking a –4 penalty to attack rolls, melee damage rolls, and Reflex saving throws for 1 round. The numbing weapon can be applied only to weapons that deal cold damage."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Obscuring",
    "Level": "5",
    "Summary": "A weapon with the obscuring fusion emits mist, smoke, or a similar obscuring vapor when wielded.",
    "type": "weapon_fusions",
    "desc": "A weapon with the obscuring fusion emits mist, smoke, or a similar obscuring vapor when wielded. After attacking with the weapon, as a move action you can cause the weapon to emit enough vapor to conceal you until the start of your next turn. This effect ends immediately if you move for any reason from where you made your attack. This concealment does not interfere with your attacks or benefit others, even if they move into the space you attacked from, and you can’t use it to hide. Conditions such as strong wind or vacuum that quickly disperse vapors negate this concealment. Only projectile weapons or those that deal cold or fire damage can benefit from this fusion."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Punishing",
    "Level": "5",
    "Summary": "Subsequent wounds from a weapon with the punishing fusion have greater effect.",
    "type": "weapon_fusions",
    "desc": "Subsequent wounds from a weapon with the punishing fusion have greater effect. When you damage a creature with the weapon, you receive a +1 bonus to damage against that target with this weapon until the end of your turn. If you successfully damage the same creature with this weapon multiple times in the same round, the bonus increases by 1 on each additional attack. If you damage a creature with this weapon when it isn’t your turn, such as with an attack of opportunity, the bonus lasts until the end of your next turn after the attack."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Selective",
    "Level": "5",
    "Summary": "With the selective weapon fusion, you can exclude a single target from a weapon’s area of effect.",
    "type": "weapon_fusions",
    "desc": "With the selective weapon fusion, you can exclude a single target from a weapon’s area of effect. When using a selective weapon to make an automatic, blast, explode, line, or other form of area attack that affects multiple targets, you can choose a single target to leave out of the area of effect."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Shock",
    "Level": "5",
    "Summary": "The shock fusion weaves the electrical energy of the universe into the weapon’s form.",
    "type": "weapon_fusions",
    "desc": "The shock fusion weaves the electrical energy of the universe into the weapon’s form. Half the weapon’s damage type is replaced with electricity damage. You can activate or deactivate the shock fusion as a swift action. If the weapon already deals two types of damage, replace one of them with electricity (you decide which damage type to replace each time you activate the shock fusion). You can add this fusion only to a weapon that does not already deal electricity damage. This fusion never causes a weapon that normally target KAC to target EAC."
  },
  {
    "source": "Starfinder #2: Temple of the Twelve pg. 53",
    "Name": "Vicious",
    "Level": "5",
    "Summary": "Vicious weapons have sinister appearances.",
    "type": "weapon_fusions",
    "desc": "Vicious weapons have sinister appearances. A vicious weapon gains the boost special weapon property, but when you make an attack with the boosted damage, you take damage equal to the additional boost damage. This damage applies even if your attack misses, and it is not reduced by DR, resistance, or any other ability. The boost is 1d4, plus an additional 1d4 for every 6 item levels the weapon has. If the weapon does not use charges or ammunition, boosting it takes a standard action and does not expend any additional charges or ammunition. You cannot boost an attack made with the automatic, blast, explode, or line weapon special property. Weapons that have the boost special weapon property cannot be vicious."
  },
  {
    "source": "Starfinder #19: Fate of the Fifth pg. 52",
    "Name": "Adaptive",
    "Level": "6",
    "Summary": "An weapon fitted with an adaptive fusion adjusts to any target it hits repeatedly.",
    "type": "weapon_fusions",
    "desc": "An weapon fitted with an adaptive fusion adjusts to any target it hits repeatedly. The fusion’s benefits can be granted against only one target at a time. Once the weapon hits a new target, it resets and starts building up momentum against that target, losing the benefits it might have had for any previous target. An adaptive weapon gains the following benefits depending on how many hits it has scored against a given target. The effects are cumulative."
  },
  {
    "source": "Starfinder Armory pg. 62",
    "Name": "Advancing",
    "Level": "6",
    "Summary": "When you defeat a foe, a weapon with the advancing fusion draws you further into the fray.",
    "type": "weapon_fusions",
    "desc": "When you defeat a foe, a weapon with the advancing fusion draws you further into the fray. The first time each round that you make a successful melee attack with an advancing weapon that drops a foe (by killing it or rendering it unconscious), you can take a guarded step as a reaction. This movement must move you closer to at least one foe."
  },
  {
    "source": "Starfinder #11: The Penumbra Protocol pg. 53",
    "Name": "Agonizing",
    "Level": "6",
    "Summary": "Once per day when you successfully attack a foe with a weapon with the agonizing fusion, you can cast inflict pain on the target as a spell-like ability (using the weapon\u0027s item level as the caster level).",
    "type": "weapon_fusions",
    "desc": "Once per day when you successfully attack a foe with a weapon with the agonizing fusion, you can cast \u003ca style\u003d\"text-decoration:underline\" href\u003d\"SpellDisplay.aspx?ItemName\u003dInflict%20Pain\u0026amp;Family\u003dInflict%20Pain\"\u003einflict pain\u003c/a\u003e on the target as a spell-like ability (using the weapon\u0027s item level as the caster level). This doesn\u0027t provoke an attack of opportunity. If the weapon with this fusion has an item level of 11 or higher, you can use this ability twice per day, and if it has an item level of 16 or higher, you can use this ability three times per day. "
  },
  {
    "source": "Starfinder #1: Incident at Absalom Station pg. 52",
    "Name": "Chained",
    "Level": "6",
    "Summary": "Weapons with the chained fusion gain a short chain that dangles from the haft or handle.",
    "type": "weapon_fusions",
    "desc": "Weapons with the chained fusion gain a short chain that dangles from the haft or handle. The chain magically extends to enable the weapon to attack foes beyond the wielder’s immediate reach. A chained weapon gains the reach weapon special property for the first attack made with it each round. After it has been used for an attack, the weapon loses the reach weapon special property until the beginning of your next turn. You can add this fusion only to melee weapons."
  },
  {
    "source": "Starfinder Armory pg. 63",
    "Name": "Cruel",
    "Level": "6",
    "Summary": "The cruel fusion feeds on fear and despair.",
    "type": "weapon_fusions",
    "desc": "The cruel fusion feeds on fear and despair. When you strike a target that is frightened, panicked, or shaken with a weapon with this fusion, the target is sickened for 1 round. When you make a successful attack that drops a foe (either by killing it or knocking it unconscious), you gain 5 temporary Hit Points that last for 10 minutes. Weapons with the nonlethal special property cannot benefit from the cruel fusion."
  },
  {
    "source": "Starfinder #20: The Last Refuge pg. 44",
    "Name": "Dampening",
    "Level": "6",
    "Summary": "On a critical hit, a weapon with the dampening fusion can suppress any vibration-based blindsense the target has for 1d4 rounds.",
    "type": "weapon_fusions",
    "desc": "On a critical hit, a weapon with the dampening fusion can suppress any vibration-based blindsense the target has for 1d4 rounds. The target can negate this effect with a successful Fortitude save. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the dampening effect."
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 39",
    "Name": "Dimensional Disruption",
    "Level": "6",
    "Summary": "This fusion infuses the disruption of kishalee weapons into the weapon’s output.",
    "type": "weapon_fusions",
    "desc": "This fusion infuses the disruption of kishalee weapons into the weapon’s output. Half of the weapon’s damage type is replaced with sonic damage, and it gains the staggered critical hit effect. You can activate or deactivate the dimensional disruption fusion as a swift action. If the weapon already deals two types of damage, replace one of them with sonic (you decide which damage type is replaced each time you activate the dimensional disruption fusion). If the weapon already has a critical effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the staggered effect, though you can apply the staggered effect only if the target takes sonic damage from this fusion. This fusion can never cause a weapon that normally targets KAC to target EAC."
  },
  {
    "source": "Alien Archive 3 pg. 109",
    "Name": "EMP",
    "Level": "6",
    "Summary": "The EMP weapon fusion gives the weapon an electromagnetic pulse critical hit effect.",
    "type": "weapon_fusions",
    "desc": "The EMP weapon fusion gives the weapon an electromagnetic pulse critical hit effect. When this effect triggers, the target’s worn and wielded technology, including weapons without the analog special property, armor environmental protections, powered armor, and technological and hybrid items, cease functioning for 1 round. A technological construct struck by this effect must succeed at a Reflex save or be staggered for 1 round. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the EMP effect."
  },
  {
    "source": "Starfinder Armory pg. 63",
    "Name": "Ensnaring",
    "Level": "6",
    "Summary": "The ensnaring fusion binds the target on a critical hit.",
    "type": "weapon_fusions",
    "desc": "The ensnaring fusion binds the target on a critical hit. On a critical hit with this weapon, you can apply the entangle weapon special property. The entangle effect ends after 1 minute if the target has not already escaped it. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the entangle effect. If you successfully affect a target with both the entangling and ensnaring fusions on the same attack roll, only the ensnaring fusion applies, and your use of the entangling fusion is not consumed. Only weapons that deal bludgeoning, cold, piercing, or slashing damage can benefit from this fusion."
  },
  {
    "source": "Starfinder #20: The Last Refuge pg. 44",
    "Name": "Hive Buster",
    "Level": "6",
    "Summary": "A weapon with the hive buster fusion can temporarily disrupt the psychic ability of certain creatures on a critical hit.",
    "type": "weapon_fusions",
    "desc": "A weapon with the hive buster fusion can temporarily disrupt the psychic ability of certain creatures on a critical hit. The target can negate this effect with a successful Will save; otherwise, it can’t use its limited telepathy or telepathy for 1d4 rounds. If the creature has the hive mind or Swarm mind ability, it can’t use that ability and gains the flat-footed and off-target conditions for the same duration. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the hive buster effect."
  },
  {
    "source": "Starfinder Core Rulebook pg. 194",
    "Name": "Knockdown",
    "Level": "6",
    "Summary": "With the knockdown fusion, a weapon disrupts a target’s center of gravity.",
    "type": "weapon_fusions",
    "desc": "With the knockdown fusion, a weapon disrupts a target’s center of gravity. The weapon gains the knockdown critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the knockdown effect. Only weapons that deal bludgeoning damage can benefit from this fusion."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Menacing",
    "Level": "6",
    "Summary": "A weapon with the menacing fusion aggressively pushes against your foe’s guard, making way for other attackers.",
    "type": "weapon_fusions",
    "desc": "A weapon with the menacing fusion aggressively pushes against your foe’s guard, making way for other attackers. When you hit an enemy with a melee attack using a menacing weapon, that enemy is considered flanked for all other melee attackers until the start of your next turn. This weapon fusion does not provide any benefit to your own attacks. Only melee weapons can benefit from the menacing fusion."
  },
  {
    "source": "Alien Archive pg. 67",
    "Name": "Nanite",
    "Level": "6",
    "Summary": "The nanite fusion gives a weapon the nanite burst critical effect.",
    "type": "weapon_fusions",
    "desc": "The nanite fusion gives a weapon the nanite burst critical effect. When this critical effect is triggered, a cloud of nanites detaches from the blade and begins devouring the target, swarming over it and dismantling it at the molecular level. In this situation, the weapon deals double damage as normal, but all of the damage is treated as acid damage, and the target must succeed at a Fortitude saving throw (see page 181 of the Starfinder Core Rulebook for how to calculate the DC) or be nauseated for 1 round. When you score a critical hit with a weapon that has multiple critical hit effects, you can apply only one of those critical hit effects of your choice. Only melee weapons can have this fusion. "
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 50",
    "Name": "Quantum Storage",
    "Level": "6",
    "Summary": "A weapon with a quantum storage fusion can be placed into rel-state, erasing it from existence; the weapon remains quantumly entangled with its wielder, and it can be retrieved at any time.",
    "type": "weapon_fusions",
    "desc": "A weapon with a quantum storage fusion can be placed into rel-state, erasing it from existence; the weapon remains quantumly entangled with its wielder, and it can be retrieved at any time. Sending a weapon into rel-state or retrieving it is a swift action. When the weapon is in rel-state, it has Bulk 0, can’t be disarmed or otherwise removed from its wielder, and can’t be used. If the wielder of the weapon is killed or destroyed, the weapon emerges from rel-state automatically."
  },
  {
    "source": "Starfinder #1: Incident at Absalom Station pg. 53",
    "Name": "Spellbane",
    "Level": "6",
    "Summary": "A weapon with the spellbane fusion gains the spellbane critical hit effect.",
    "type": "weapon_fusions",
    "desc": "A weapon with the spellbane fusion gains the spellbane critical hit effect. A target affected by the spellbane critical hit effect must succeed at a Will save (DC as normal for a weapon of the given item level; see page 181 of the Starfinder Core Rulebook) or be unable to cast spells or use spell-like abilities for 1d4 rounds. If the weapon already has a critical hit effect, you can choose to apply either the weapon’s normal critical hit effect or the spellbane effect when you score a critical hit."
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 49",
    "Name": "Cellular Degenerating",
    "Level": "7",
    "Summary": "This fusion causes the target’s cells to overheat and rapidly degenerate.",
    "type": "weapon_fusions",
    "desc": "This fusion causes the target’s cells to overheat and rapidly degenerate. The weapon gains the degeneration critical hit effect, dealing d6 equal to the weapon’s level divided by 5 (round down). You can activate or deactivate the cellular degenerating fusion as a swift action. If the weapon already has a critical effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the degeneration effect. This fusion can never cause a weapon that normally targets KAC to target EAC."
  },
  {
    "source": "Starfinder Armory pg. 62",
    "Name": "Charge Disrupting",
    "Level": "7",
    "Summary": "A weapon with the charge disrupting fusion disrupts power sources.",
    "type": "weapon_fusions",
    "desc": "A weapon with the charge disrupting fusion disrupts power sources. When you score a critical hit using a weapon with the charge disrupting fusion, either the target or a single visible object carried by the target is subject to discharge, as the spell. The target creature (or its bearer, in the case of an object) can attempt a Fortitude save to negate the effect, as normal. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the charge disrupting effect."
  },
  {
    "source": "Alien Archive 4 pg. 113",
    "Name": "Jinxing",
    "Level": "7",
    "Summary": "A weapon with the jinxing weapon fusion gains the jinx critical hit effect.",
    "type": "weapon_fusions",
    "desc": "A weapon with the jinxing weapon fusion gains the jinx critical hit effect. A target affected by the jinx critical hit effect must succeed at a Will save (DC as normal for a weapon of the given item level) or roll all attack rolls, saving throws, and skill checks twice and use the lower result. This effect lasts until the end of the target’s next turn. If the weapon already has a critical hit effect, you can choose to apply either the weapon’s normal critical hit effect or the jinx effect when you score a critical hit."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Mind Reading",
    "Level": "7",
    "Summary": "Scoring a critical hit with a weapon with the mind rending fusion damages the psyche of the creature struck.",
    "type": "weapon_fusions",
    "desc": "Scoring a critical hit with a weapon with the mind rending fusion damages the psyche of the creature struck. The target can negate this effect with a successful Will save; otherwise, roll on the Psychic Trauma table to determine how the target creature is affected. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or a psychic trauma. Psychic trauma is a mind-affecting effect. While each psychic trauma exploits a potential neurosis, the trauma does not cause actual insanity. The effects of psychic trauma can be removed with the remove affliction spell (DC \u003d 15 + half the item level of the mind rending weapon). \u003ch2\u003eTable 1-13: Psychic Trauma\u003c/h2\u003e\u003ctable class\u003d\"inner\"\u003e\n \u003ctbody\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e\u003cb\u003e\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003e\u003c/b\u003e\u003c/td\u003e\n   \u003ctd\u003e\u003cb\u003e\u003c/b\u003e\u003c/td\u003e\n  \u003c/tr\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e1-5\u003c/td\u003e\n   \u003ctd\u003eAnxiety\u003c/td\u003e\n   \u003ctd\u003eShaken 1d4 rounds\u003c/td\u003e\n  \u003c/tr\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e6-9\u003c/td\u003e\n   \u003ctd\u003eIndecision\u003c/td\u003e\n   \u003ctd\u003eStaggered 1d4 rounds\u003c/td\u003e\n  \u003c/tr\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e10-12\u003c/td\u003e\n   \u003ctd\u003eDementia\u003c/td\u003e\n   \u003ctd\u003eConfused 1 round\u003c/td\u003e\n  \u003c/tr\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e13-14\u003c/td\u003e\n   \u003ctd\u003eAmnesia\u003c/td\u003e\n   \u003ctd\u003e-5 penalty to all skill checks to recall knowledge for 24 hours\u003c/td\u003e\n  \u003c/tr\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e15-16\u003c/td\u003e\n   \u003ctd\u003eParanoia\u003c/td\u003e\n   \u003ctd\u003eNot treated as an ally and can\u0027t treat any other character as an ally for 24 hours\u003c/td\u003e\n  \u003c/tr\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e17-18\u003c/td\u003e\n   \u003ctd\u003eDespair\u003c/td\u003e\n   \u003ctd\u003e-2 penalty to attack rolls and saving throws for 24 hours\u003c/td\u003e\n  \u003c/tr\u003e\n  \u003ctr\u003e\n   \u003ctd\u003e19-20\u003c/td\u003e\n   \u003ctd\u003ePhobia\u003c/td\u003e\n   \u003ctd\u003ePanicked 1 round\u003c/td\u003e\n  \u003c/tr\u003e\n \u003c/tbody\u003e\n\u003c/table\u003e"
  },
  {
    "source": "Pact Worlds pg. 195",
    "Name": "Tattoo",
    "Level": "7",
    "Summary": "Popular among the Xun of the Golden League, a tattoo weapon can be hidden in the form of a tattoo on your body.",
    "type": "weapon_fusions",
    "desc": "Popular among the Xun of the Golden League, a tattoo weapon can be hidden in the form of a tattoo on your body. If you already have tattoos, the weapon matches them in size and style when in tattoo form. When not in tattoo form, the weapon has images similar to its last tattoo form worked along its length as colorful decorations."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Wounding",
    "Level": "7",
    "Summary": "The wounding fusion causes a weapon to deal exceptionally traumatic damage.",
    "type": "weapon_fusions",
    "desc": "The wounding fusion causes a weapon to deal exceptionally traumatic damage. The weapon gains the wound critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the wound effect."
  },
  {
    "source": "Starfinder #2: Temple of the Twelve pg. 53",
    "Name": "Annihilator",
    "Level": "8",
    "Summary": "A weapon with the annihilator fusion looks corroded, worn, and crudely formed.",
    "type": "weapon_fusions",
    "desc": "A weapon with the annihilator fusion looks corroded, worn, and crudely formed. If a target is slain by an attack with an annihilator weapon, the target disintegrates entirely (as though by the disintegrate spell)."
  },
  {
    "source": "Starfinder Armory pg. 63",
    "Name": "Continuous",
    "Level": "8",
    "Summary": "The continuous fusion lets a weapon with the line special property sustain fire continuously by expending additional charges.",
    "type": "weapon_fusions",
    "desc": "The continuous fusion lets a weapon with the line special property sustain fire continuously by expending additional charges. When you make a line attack with a weapon with this fusion, you can expend additional ammunition or charges equal to the weapon’s usage value to sustain your attack until the start of your next turn. This has no additional effect on targets already within the line, but anything that moves across your weapon’s line is attacked using your original attack roll and damage. If you hit but fail to damage this new target, it blocks your line as normal. If an existing blockage is removed, your line extends out to its maximum range unless blocked anew, and it can damage creatures and objects that it failed to reach previously. You can’t damage a single target more than once in a round with the continuous fusion, even if it moves in and out of the path of your attack. If you move from where you initiated the attack for any reason, your line automatically ends. Only weapons that can make a line attack benefit from this fusion. You can use the continuous fusion with unwieldy weapons."
  },
  {
    "source": "Starfinder Armory pg. 63",
    "Name": "Guarded",
    "Level": "8",
    "Summary": "The guarded fusion guides timing so that ranged attacks don’t leave the wielder vulnerable.",
    "type": "weapon_fusions",
    "desc": "The guarded fusion guides timing so that ranged attacks don’t leave the wielder vulnerable. When you make a ranged attack using a weapon with this fusion, your attack does not provoke an attack of opportunity. The guarded fusion does not prevent attacks of opportunity provoked for any reason other than making a ranged attack. Only ranged and thrown weapons can benefit from this fusion."
  },
  {
    "source": "Alien Archive 2 pg. 55",
    "Name": "Leeching",
    "Level": "8",
    "Summary": "The leeching weapon fusion gives a weapon the leech critical hit effect.",
    "type": "weapon_fusions",
    "desc": "The leeching weapon fusion gives a weapon the leech critical hit effect. When you score a critical hit with the weapon, if at least one target of the attack takes damage equal to the weapon’s item level, you recover a number of Hit Points equal to the weapon’s item level, in addition to any other critical hit effect. This healing restores Hit Point damage first, followed by Stamina Points. Any healing in excess of your Hit Point damage and Stamina Point damage is lost. Once you have benefited from this healing, you cannot benefit from the leeching fusion again until you take a 10-minute rest and expend 1 Resolve Point to regain Stamina Points."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Rebounding",
    "Level": "8",
    "Summary": "The rebounding fusion lets you bounce your attacks off a wall to reach your target.",
    "type": "weapon_fusions",
    "desc": "The rebounding fusion lets you bounce your attacks off a wall to reach your target. When making a ranged attack, you can ricochet your attack off a single solid barrier into your target. You take a –4 penalty to your attack roll. You must have line of sight to your target, and your target still benefits from any applicable concealment. Calculate cover based on the point you ricochet from. The fusion prevents any damage to the barrier and allows you to carom shots at apparently impossible angles. You can’t ricochet off a barrier your weapon would automatically pass through, such as rebounding a laser off a transparent surface, but you can ricochet off a barrier that your weapon would normally destroy. A thrown weapon with both the rebounding and returning fusions returns as normal, rebounding off the barrier again on its way back to you. Only thrown and ranged weapons can benefit from this fusion."
  },
  {
    "source": "Alien Archive 2 pg. 45",
    "Name": "Synesthetic",
    "Level": "8",
    "Summary": "A weapon with the synesthetic fusion carries a trace of the Dreamers’ psychic energies.",
    "type": "weapon_fusions",
    "desc": "A weapon with the synesthetic fusion carries a trace of the Dreamers’ psychic energies. When you score a critical hit using a weapon with this fusion, the target must succeed at a Will save or the distinctions between its senses begin to blur in a particularly disorienting fashion. For 1d3 rounds, the affected creature’s speeds are halved and it takes a –4 penalty to attack rolls, AC, Reflex saves, and skill checks. A creature affected by a synesthetic weapon is immune to this effect from the same weapon for 24 hours. This is a mind-affecting effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the synesthetic effect."
  },
  {
    "source": "Starfinder #5: The Thirteenth Gate pg. 40",
    "Name": "Temporal Disruption",
    "Level": "8",
    "Summary": "With this fusion, a weapon’s energy damage can slow down the rate of subatomic movement in the target.",
    "type": "weapon_fusions",
    "desc": "With this fusion, a weapon’s energy damage can slow down the rate of subatomic movement in the target. The weapon gains the stunned critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the stunned effect. Only weapons that deal sonic damage can benefit from the temporal disruption fusion. If your weapon deals more than one type of energy damage, you can apply the stunned critical effect only if one of those damage types is sonic."
  },
  {
    "source": "Alien Archive 2 pg. 15",
    "Name": "Tritidair",
    "Level": "8",
    "Summary": "An installed tritidair fusion causes a weapon to show a star field with one bright constellation, similar to the patterns on tritidair wings.",
    "type": "weapon_fusions",
    "desc": "An installed tritidair fusion causes a weapon to show a star field with one bright constellation, similar to the patterns on tritidair wings. You can activate or deactivate the tritidair fusion as a swift action. While the fusion is active, half the weapon’s damage becomes electricity damage, and the weapon gains the bright property. You can add this fusion to a weapon that already deals electricity damage, but then the fusion has no effect on the weapon’s damage other than to make it magical. If the weapon already deals two types of damage, you choose which one of them to replace with electricity damage each time you activate the tritidair fusion. When you score a critical hit with a weapon that has an active tritidair fusion, the target must succeed at a Fortitude saving throw or be blinded for 1d3 rounds. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or this blinded effect. This fusion never causes a weapon that normally targets KAC to target EAC."
  },
  {
    "source": "Starfinder Armory pg. 62",
    "Name": "Beneficent",
    "Level": "9",
    "Summary": "When you score a critical hit against a significant enemy with a weapon that has the beneficent fusion, you gain one charge of beneficence.",
    "type": "weapon_fusions",
    "desc": "When you score a critical hit against a significant enemy with a weapon that has the beneficent fusion, you gain one charge of beneficence. As long as you are wielding the same weapon, you can expend a charge of beneficence to cast either remove affliction or lesser remove condition as a spell-like ability, using the weapon’s item level as your caster level. You cannot have more than one charge of beneficence at a time, and you lose all charges of beneficence if you take a 10 minute rest and spend a Resolve Point to regain your Stamina Points or if you take an 8-hour rest and regain your daily-use abilities and spells. If the weapon with the beneficent fusion has an item level of 14 or higher, you can instead use a charge of beneficence to cast remove condition. If the weapon has an item level of 19 or higher, you can instead use a charge of beneficence to cast greater remove condition. A weapon cannot have the beneficent weapon fusion if it also has the unholy or wounding weapon fusions."
  },
  {
    "source": "Near Space pg. 150",
    "Name": "Burdening",
    "Level": "9",
    "Summary": "First commissioned by the wardens of the prison-planet Daegox 4 and now used in prisons throughout Near Space, the burdening weapon fusion often bears chains or manacles.",
    "type": "weapon_fusions",
    "desc": "First commissioned by the wardens of the prison-planet Daegox 4 and now used in prisons throughout Near Space, the burdening weapon fusion often bears chains or manacles. When you score a critical hit using a weapon with the burdening fusion, the target gains the encumbered condition for 1d4 rounds. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the burdening effect."
  },
  {
    "source": "Starfinder Core Rulebook pg. 193",
    "Name": "Corrosive",
    "Level": "9",
    "Summary": "The corrosive fusion weaves the destructive power of acid into the weapon’s form.",
    "type": "weapon_fusions",
    "desc": "The corrosive fusion weaves the destructive power of acid into the weapon’s form. Half the weapon’s damage type is replaced with acid damage. You can activate or deactivate the corrosive fusion as a swift action. If the weapon already deals two types of damage, replace one of them with acid (you decide which damage type is replaced each time you activate the corrosive fusion). You can add this fusion only to a weapon that does not already deal acid damage. This fusion never causes a weapon that normally targets KAC to target EAC."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Malediction",
    "Level": "9",
    "Summary": "Once per day when you successfully attack a foe with a weapon with the malediction fusion, as a reaction you can cast bestow curse on the target as a spell-like ability (using the weapon’s item level as the caster level).",
    "type": "weapon_fusions",
    "desc": "Once per day when you successfully attack a foe with a weapon with the malediction fusion, as a reaction you can cast bestow curse on the target as a spell-like ability (using the weapon’s item level as the caster level). This does not provoke an attack of opportunity. If the weapon with this fusion has an item level of 14 or higher you may use this ability twice per day, and if it has an item level of 19 or higher you may use this ability three times per day. A weapon cannot have the malediction fusion if it also has either the holy or merciful weapon fusions."
  },
  {
    "source": "Pact Worlds pg. 195",
    "Name": "Ratjaw",
    "Level": "9",
    "Summary": "Famously linked to criminals who worship Lao Shu Po, the ratjaw fusion aids in disarming and robbing foes.",
    "type": "weapon_fusions",
    "desc": "Famously linked to criminals who worship Lao Shu Po, the ratjaw fusion aids in disarming and robbing foes. On a critical hit, the weapon knocks an item of your choice out of the target’s possession, as long as it something that could be removed with a successful disarm combat maneuver. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or this disarming ability. If the ratjaw weapon is a ranged weapon, the disarmed item lands in any square of your choice adjacent to the target. If the ratjaw weapon is a melee weapon, it draws the item to you, and you can grab the item with a free hand."
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 50",
    "Name": "Rel-Entrapment",
    "Level": "9",
    "Summary": "Scoring a critical hit with a weapon with the rel-entrapment fusion forces the target to attempt a Will save; on a failure, the creature is forced into rel-state, temporarily ceasing to exist.",
    "type": "weapon_fusions",
    "desc": "Scoring a critical hit with a weapon with the rel-entrapment fusion forces the target to attempt a Will save; on a failure, the creature is forced into rel-state, temporarily ceasing to exist. Each round, the target can attempt a new Will save; on a success, they return to existence in the same space where they entered rel-state. If this space is filled with a solid object, such as another creature, the target appears in the nearest open space. Targets have a cumulative +1 bonus to their Will saving throw for every round they have been in rel-state."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Thundering",
    "Level": "9",
    "Summary": "The thundering fusion imbues a weapon with heightened frequency vibrations.",
    "type": "weapon_fusions",
    "desc": "The thundering fusion imbues a weapon with heightened frequency vibrations. Half the weapon’s damage type is replaced with sonic damage. You can activate or deactivate the thundering fusion as a swift action. If the weapon already deals two types of damage, replace one of them with sonic (you decide which damage type to replace each time you activate the thundering fusion). You can add this fusion only to a weapon that does not already deal sonic damage. This fusion never causes a weapon that normally target KAC to target EAC."
  },
  {
    "source": "Starfinder #33: Dominion’s End pg. 49",
    "Name": "Disentanglement",
    "Level": "10",
    "Summary": "Scoring a critical hit with a weapon with the disentanglement fusion alters the target at a subatomic level, causing debilitating and horrific mutations.",
    "type": "weapon_fusions",
    "desc": "Scoring a critical hit with a weapon with the disentanglement fusion alters the target at a subatomic level, causing debilitating and horrific mutations. The weapon gains the mutation critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the mutation effect."
  },
  {
    "source": "Alien Archive 3 pg. 71",
    "Name": "Lightveiled",
    "Level": "10",
    "Summary": "The lightveiled fusion renders a weapon invisible in bright light.",
    "type": "weapon_fusions",
    "desc": "The lightveiled fusion renders a weapon invisible in bright light. While the weapon is carried openly in an area of bright light, it is invisible, though attacking with the weapon renders it visible for 1 minute."
  },
  {
    "source": "Starfinder Armory pg. 64",
    "Name": "Nullifying",
    "Level": "10",
    "Summary": "Damage from a weapon with the nullifying fusion temporarily reduces spell resistance.",
    "type": "weapon_fusions",
    "desc": "Damage from a weapon with the nullifying fusion temporarily reduces spell resistance. When you damage a creature with spell resistance using a weapon with this fusion, its spell resistance is reduced by 2 until the end of your next turn. Multiple hits from weapons with this fusion stack."
  },
  {
    "source": "Alien Archive 4 pg. 107",
    "Name": "Quantum",
    "Level": "10",
    "Summary": "Three times per day as a standard action, you can use a quantum weapon to make two ranged attacks, each against a different target.",
    "type": "weapon_fusions",
    "desc": "Three times per day as a standard action, you can use a quantum weapon to make two ranged attacks, each against a different target. After learning the result of each attack, you must pick one attack to ignore (it doesn’t hit or expend ammunition and has no effects) and apply the effects of the other attack (such as damage and critical hit effects) as normal. This fusion can be applied only to ranged weapons."
  },
  {
    "source": "Starfinder Armory pg. 65",
    "Name": "Tracking",
    "Level": "10",
    "Summary": "The tracking fusion lets you locate a creature recently damaged by the weapon.",
    "type": "weapon_fusions",
    "desc": "The tracking fusion lets you locate a creature recently damaged by the weapon. Activating the fusion is a move action that binds the tracking fusion to the first creature you damage with the weapon before the start of your next turn. Once you track a target with this fusion, you are aware of the target’s location as long as it is within 1,000 feet and you keep the weapon with this fusion in hand."
  },
  {
    "source": "Starfinder Core Rulebook pg. 195",
    "Name": "Vorpal",
    "Level": "10",
    "Summary": "With the vorpal fusion, a weapon can tear between the molecules of a creature.",
    "type": "weapon_fusions",
    "desc": "With the vorpal fusion, a weapon can tear between the molecules of a creature. The weapon gains the severe wound critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the severe wound effect. Only a weapon that deals bludgeoning, piercing, or slashing damage can benefit from this fusion."
  },
  {
    "source": "Near Space pg. 150",
    "Name": "Mind-Reading",
    "Level": "13",
    "Summary": "Developed by telepathic creatures such as the psychic gas oozes inhabiting Preluria, the mind-reading fusion reverberates with psychic feedback.",
    "type": "weapon_fusions",
    "desc": "Developed by telepathic creatures such as the psychic gas oozes inhabiting Preluria, the mind-reading fusion reverberates with psychic feedback. When you score a critical hit using a weapon with the mind-reading fusion, you automatically read the surface thoughts of the creature struck. This is a mind-affecting ability. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the mind-reading effect."
  },
  {
    "source": "Alien Archive 4 pg. 49",
    "Name": "Kaleidoscopic",
    "Level": "14",
    "Summary": "The kaleidoscopic fusion augments a weapon’s attacks, causing them to appear unusually bright, colorful, and even mesmerizing.",
    "type": "weapon_fusions",
    "desc": "The kaleidoscopic fusion augments a weapon’s attacks, causing them to appear unusually bright, colorful, and even mesmerizing. The weapon gains the kaleidoscopic charm critical hit effect. When this critical hit effect is triggered, the fusion converts the weapon’s force into a powerful enchantment. The target takes no damage from the attack and instead is charmed for 1d4 rounds, as though you had cast charm monster on it (Will save negates). If the target is immune to this effect or negates it with a successful saving throw, the target takes the double damage as normal. When you score a critical hit with a weapon that has multiple critical hit effects, you can apply only one of those effects of your choice. This fusion can only be applied to weapons that deal electricity or fire damage, or that have the aurora, bright, or fiery AR weapon special properties."
  }
]